[Survived] BooleanLiteral
src/orchestrator/SecurityManager.ts:176:16
 
   constructor(config: Partial<SecurityConfig> = {}) {
     this.config = {
-      enabled: true,
+      enabled: false,
       sessionTimeoutMs: 3600000, // 1 hour
       maxSessionsPerAgent: 5,

[Killed] ObjectLiteral
src/orchestrator/SecurityManager.ts:179:19
       enabled: true,
       sessionTimeoutMs: 3600000, // 1 hour
       maxSessionsPerAgent: 5,
-      rateLimits: {
-        submitTask: {
-          requestsPerWindow: 10,
-          windowMs: 60000,
-          blockDurationMs: 300000,
-        },
-        queryTasks: {
-          requestsPerWindow: 30,
-          windowMs: 60000,
-          blockDurationMs: 60000,
-        },
-        updateProgress: {
-          requestsPerWindow: 60,
-          windowMs: 60000,
-          blockDurationMs: 30000,
-        },
-      },
+      rateLimits: {},
       trustedAgents: [],
       adminAgents: [],
killedBy: SecureTaskQueue enqueues task when credentials are valid
statusReason: TypeError: Cannot read properties of undefined (reading 'requestsPerWindow')

[Killed] BooleanLiteral
src/orchestrator/SecurityManager.ts:198:21
       },
       trustedAgents: [],
       adminAgents: [],
-      auditLogging: true,
+      auditLogging: false,
       policies: {
         maxTaskDescriptionLength: 10000,
killedBy: SecurityManager Security Events should log authentication events
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
src/orchestrator/SecurityManager.ts:199:17
       trustedAgents: [],
       adminAgents: [],
       auditLogging: true,
-      policies: {
-        maxTaskDescriptionLength: 10000,
-        maxMetadataSize: 10240, // 10KB
-        allowedTaskTypes: {},
-        suspiciousPatterns: [
-          /<script/i,
-          /javascript:/i,
-          /data:text\/html/i,
-          /\.\./, // Directory traversal
-        ],
-      },
+      policies: {},
       ...config,
     };
killedBy: SecurityManager Input Sanitization should allow safe input
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "this.config.policies.suspiciousPatterns is not iterable"

      482 |       // Check for suspicious patterns
      483 |       const dataString = JSON.stringify(data);
    > 484 |       for (const pattern of this.config.policies.suspiciousPatterns) {

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:217:44
   /**
    * Register an agent profile for authentication
    */
-  registerAgent(agent: AgentProfile): void {
-    this.agentRegistry.set(agent.id, agent);
-  }
+  registerAgent(agent: AgentProfile): void {}
 
   /**
killedBy: SecurityManager Agent Registration should register agent successfully
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/orchestrator/SecurityManager.ts:225:9
    * Authenticate agent credentials
    */
   authenticate(credentials: AuthCredentials): SecurityContext | null {
-    if (!this.config.enabled) {
+    if (false) {
       // In disabled mode, create minimal context for testing
       const agent = this.agentRegistry.get(credentials.agentId);
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) Disabled Security Mode should allow all operations when security disabled
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/orchestrator/SecurityManager.ts:225:9
    * Authenticate agent credentials
    */
   authenticate(credentials: AuthCredentials): SecurityContext | null {
-    if (!this.config.enabled) {
+    if (true) {
       // In disabled mode, create minimal context for testing
       const agent = this.agentRegistry.get(credentials.agentId);
killedBy: SecurityManager Authentication should reject invalid token
statusReason: Error: expect(received).toBeNull()

[Killed] ConditionalExpression
src/orchestrator/SecurityManager.ts:228:11
     if (!this.config.enabled) {
       // In disabled mode, create minimal context for testing
       const agent = this.agentRegistry.get(credentials.agentId);
-      if (!agent) {
+      if (false) {
         this.logSecurityEvent({
           type: SecurityEventType.AUTH_FAILURE,
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) Disabled Security Mode should handle unregistered agent with security disabled
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:228:19
     if (!this.config.enabled) {
       // In disabled mode, create minimal context for testing
       const agent = this.agentRegistry.get(credentials.agentId);
-      if (!agent) {
-        this.logSecurityEvent({
-          type: SecurityEventType.AUTH_FAILURE,
-          context: null,
-          resource: "authentication",
-          action: "authenticate",
-          result: "failure",
-          details: {
-            agentId: credentials.agentId,
-            reason: "agent_not_registered",
-          },
-          severity: "medium",
-        });
-        return null;
-      }
+      if (!agent) {}
 
       return this.createSecurityContext(agent, credentials);
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) Disabled Security Mode should handle unregistered agent with security disabled
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] BooleanLiteral
src/orchestrator/SecurityManager.ts:249:9
 
     // Validate credentials (simplified - in production use proper auth)
     const agent = this.agentRegistry.get(credentials.agentId);
-    if (!agent) {
+    if (agent) {
       this.logSecurityEvent({
         type: SecurityEventType.AUTH_FAILURE,
killedBy: SecurityManager Agent Registration should register agent successfully
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ObjectLiteral
src/orchestrator/SecurityManager.ts:250:29
     // Validate credentials (simplified - in production use proper auth)
     const agent = this.agentRegistry.get(credentials.agentId);
     if (!agent) {
-      this.logSecurityEvent({
-        type: SecurityEventType.AUTH_FAILURE,
-        context: null,
-        resource: "authentication",
-        action: "authenticate",
-        result: "failure",
-        details: { agentId: credentials.agentId, reason: "agent_not_found" },
-        severity: "medium",
-      });
+      this.logSecurityEvent({});
       return null;
     }
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A8: Security Incident Response should track authentication failures
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/orchestrator/SecurityManager.ts:263:9
     }
 
     // Basic token validation (simplified)
-    if (!this.validateToken(credentials.token)) {
+    if (true) {
       this.logSecurityEvent({
         type: SecurityEventType.AUTH_FAILURE,
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A1: Comprehensive Test Suite Execution should support all security operations
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:263:49
     }
 
     // Basic token validation (simplified)
-    if (!this.validateToken(credentials.token)) {
-      this.logSecurityEvent({
-        type: SecurityEventType.AUTH_FAILURE,
-        context: null,
-        resource: "authentication",
-        action: "authenticate",
-        result: "failure",
-        details: { agentId: credentials.agentId, reason: "invalid_token" },
-        severity: "medium",
-      });
-      return null;
-    }
+    if (!this.validateToken(credentials.token)) {}
 
     // Check session limits
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A4: Edge Cases and Boundary Conditions should handle null/undefined in credentials
statusReason: Error: expect(received).toBeNull()

[Survived] MethodExpression
src/orchestrator/SecurityManager.ts:277:28
     }
 
     // Check session limits
-    const activeSessions = Array.from(this.sessions.values()).filter(
-      (ctx) => ctx.agentId === credentials.agentId
-    ).length;
+    const activeSessions = Array.from(this.sessions.values()).length;
 
     if (activeSessions >= this.config.maxSessionsPerAgent) {

[Killed] ArrowFunction
src/orchestrator/SecurityManager.ts:278:7
 
     // Check session limits
     const activeSessions = Array.from(this.sessions.values()).filter(
-      (ctx) => ctx.agentId === credentials.agentId
+      () => undefined
     ).length;
 
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A4: Edge Cases and Boundary Conditions should handle session limit boundary
statusReason: Error: expect(received).toBeNull()

[Killed] ConditionalExpression
src/orchestrator/SecurityManager.ts:278:16
 
     // Check session limits
     const activeSessions = Array.from(this.sessions.values()).filter(
-      (ctx) => ctx.agentId === credentials.agentId
+      (ctx) => false
     ).length;
 
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A4: Edge Cases and Boundary Conditions should handle session limit boundary
statusReason: Error: expect(received).toBeNull()

[Killed] EqualityOperator
src/orchestrator/SecurityManager.ts:281:9
       (ctx) => ctx.agentId === credentials.agentId
     ).length;
 
-    if (activeSessions >= this.config.maxSessionsPerAgent) {
+    if (activeSessions > this.config.maxSessionsPerAgent) {
       this.logSecurityEvent({
         type: SecurityEventType.AUTH_FAILURE,
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A4: Edge Cases and Boundary Conditions should handle session limit boundary
statusReason: Error: expect(received).toBeNull()

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:281:60
       (ctx) => ctx.agentId === credentials.agentId
     ).length;
 
-    if (activeSessions >= this.config.maxSessionsPerAgent) {
-      this.logSecurityEvent({
-        type: SecurityEventType.AUTH_FAILURE,
-        context: null,
-        resource: "authentication",
-        action: "authenticate",
-        result: "failure",
-        details: {
-          agentId: credentials.agentId,
-          reason: "session_limit_exceeded",
-        },
-        severity: "low",
-      });
-      return null;
-    }
+    if (activeSessions >= this.config.maxSessionsPerAgent) {}
 
     const context = this.createSecurityContext(agent, credentials);
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A4: Edge Cases and Boundary Conditions should handle session limit boundary
statusReason: Error: expect(received).toBeNull()

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:321:31
     permission: Permission,
     resource?: string
   ): boolean {
-    if (!this.config.enabled) {
-      return true; // Allow all in disabled mode
-    }
+    if (!this.config.enabled) {}
 
     // Check if context is expired
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) Disabled Security Mode should allow all operations when security disabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/orchestrator/SecurityManager.ts:321:9
     permission: Permission,
     resource?: string
   ): boolean {
-    if (!this.config.enabled) {
+    if (this.config.enabled) {
       return true; // Allow all in disabled mode
     }
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A5: Compliance and Audit Trail should track all permission checks
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1
Received:   1

[Killed] BooleanLiteral
src/orchestrator/SecurityManager.ts:322:14
     resource?: string
   ): boolean {
     if (!this.config.enabled) {
-      return true; // Allow all in disabled mode
+      return false; // Allow all in disabled mode
     }
 
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) Disabled Security Mode should allow all operations when security disabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/orchestrator/SecurityManager.ts:326:9
     }
 
     // Check if context is expired
-    if (Date.now() > context.expiresAt.getTime()) {
+    if (Date.now() <= context.expiresAt.getTime()) {
       this.logSecurityEvent({
         type: SecurityEventType.SESSION_EXPIRED,
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A1: Comprehensive Test Suite Execution should support all security operations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:326:51
     }
 
     // Check if context is expired
-    if (Date.now() > context.expiresAt.getTime()) {
-      this.logSecurityEvent({
-        type: SecurityEventType.SESSION_EXPIRED,
-        context,
-        resource: resource || "authorization",
-        action: "authorize",
-        result: "failure",
-        details: { permission, reason: "session_expired" },
-        severity: "low",
-      });
-      return false;
-    }
+    if (Date.now() > context.expiresAt.getTime()) {}
 
     // Check permissions
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) Session Management should reject expired sessions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ObjectLiteral
src/orchestrator/SecurityManager.ts:327:29
 
     // Check if context is expired
     if (Date.now() > context.expiresAt.getTime()) {
-      this.logSecurityEvent({
-        type: SecurityEventType.SESSION_EXPIRED,
-        context,
-        resource: resource || "authorization",
-        action: "authorize",
-        result: "failure",
-        details: { permission, reason: "session_expired" },
-        severity: "low",
-      });
+      this.logSecurityEvent({});
       return false;
     }
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) Session Management should reject expired sessions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] LogicalOperator
src/orchestrator/SecurityManager.ts:330:19
       this.logSecurityEvent({
         type: SecurityEventType.SESSION_EXPIRED,
         context,
-        resource: resource || "authorization",
+        resource: resource && "authorization",
         action: "authorize",
         result: "failure",

[Survived] ConditionalExpression
src/orchestrator/SecurityManager.ts:330:19
       this.logSecurityEvent({
         type: SecurityEventType.SESSION_EXPIRED,
         context,
-        resource: resource || "authorization",
+        resource: true,
         action: "authorize",
         result: "failure",

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:342:25
     // Check permissions
     const hasPermission = context.permissions.includes(permission);
 
-    if (!hasPermission) {
-      this.logSecurityEvent({
-        type: SecurityEventType.AUTHZ_FAILURE,
-        context,
-        resource: resource || "authorization",
-        action: "authorize",
-        result: "failure",
-        details: { permission, reason: "insufficient_permissions" },
-        severity: "medium",
-      });
-    }
+    if (!hasPermission) {}
 
     return hasPermission;
killedBy: SecurityManager Security Events should log authorization failures
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/orchestrator/SecurityManager.ts:342:9
     // Check permissions
     const hasPermission = context.permissions.includes(permission);
 
-    if (!hasPermission) {
+    if (false) {
       this.logSecurityEvent({
         type: SecurityEventType.AUTHZ_FAILURE,
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A5: Compliance and Audit Trail should track all permission checks
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1
Received:   1

[Killed] ObjectLiteral
src/orchestrator/SecurityManager.ts:343:29
     const hasPermission = context.permissions.includes(permission);
 
     if (!hasPermission) {
-      this.logSecurityEvent({
-        type: SecurityEventType.AUTHZ_FAILURE,
-        context,
-        resource: resource || "authorization",
-        action: "authorize",
-        result: "failure",
-        details: { permission, reason: "insufficient_permissions" },
-        severity: "medium",
-      });
+      this.logSecurityEvent({});
     }
 
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A5: Compliance and Audit Trail should maintain complete audit log
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:363:14
   checkRateLimit(
     context: SecurityContext,
     action: keyof SecurityConfig["rateLimits"]
-  ): boolean {
-    if (!this.config.enabled) {
-      return true;
-    }
-
-    const limiter = this.getRateLimiter(context.agentId, action);
-    return limiter.checkLimit();
-  }
+  ): boolean {}
 
   /**
killedBy: SecureTaskQueue enqueues task when credentials are valid
statusReason: SecurityError: Rate limit exceeded

[Killed] ConditionalExpression
src/orchestrator/SecurityManager.ts:364:9
     context: SecurityContext,
     action: keyof SecurityConfig["rateLimits"]
   ): boolean {
-    if (!this.config.enabled) {
+    if (true) {
       return true;
     }
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A3: Rate Limiting and Load Testing should enforce rate limits per action type
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/orchestrator/SecurityManager.ts:365:14
     action: keyof SecurityConfig["rateLimits"]
   ): boolean {
     if (!this.config.enabled) {
-      return true;
+      return false;
     }
 
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) Disabled Security Mode should allow all operations when security disabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/orchestrator/SecurityManager.ts:376:9
    * Sanitize and validate input data
    */
   sanitizeInput<T>(context: SecurityContext, action: string, data: T): T {
-    if (!this.config.enabled) {
+    if (false) {
       return data;
     }
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) Disabled Security Mode should allow all operations when security disabled
statusReason: Error: expect(received).not.toThrow()

Error name:    "SecurityError"
Error message: "Input contains suspicious content"

      504 |                 severity: "high"
      505 |               }));
    > 506 |               throw new SecurityError("Input contains suspicious content", "SUSPICIOUS_CONTENT");

[Killed] BooleanLiteral
src/orchestrator/SecurityManager.ts:376:9
    * Sanitize and validate input data
    */
   sanitizeInput<T>(context: SecurityContext, action: string, data: T): T {
-    if (!this.config.enabled) {
+    if (this.config.enabled) {
       return data;
     }
killedBy: Penetration Testing - Injection Attacks XSS Attack Vectors should handle XSS payload #1: <script>alert("XSS")</script>
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:382:68
 
     // Check for suspicious patterns
     const dataString = JSON.stringify(data);
-    for (const pattern of this.config.policies.suspiciousPatterns) {
-      if (pattern.test(dataString)) {
-        this.logSecurityEvent({
-          type: SecurityEventType.SUSPICIOUS_ACTIVITY,
-          context,
-          resource: action,
-          action: "sanitize_input",
-          result: "blocked",
-          details: {
-            pattern: pattern.toString(),
-            dataLength: dataString.length,
-          },
-          severity: "high",
-        });
-        throw new SecurityError(
-          "Input contains suspicious content",
-          "SUSPICIOUS_CONTENT"
-        );
-      }
-    }
+    for (const pattern of this.config.policies.suspiciousPatterns) {}
 
     // Size limits
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A2: Malicious Input Handling XSS Attack Vectors should block <script> tag injection
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: SecurityError

Received function did not throw

[Killed] ConditionalExpression
src/orchestrator/SecurityManager.ts:383:11
     // Check for suspicious patterns
     const dataString = JSON.stringify(data);
     for (const pattern of this.config.policies.suspiciousPatterns) {
-      if (pattern.test(dataString)) {
+      if (true) {
         this.logSecurityEvent({
           type: SecurityEventType.SUSPICIOUS_ACTIVITY,
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A1: Comprehensive Test Suite Execution should support all security operations
statusReason: Error: expect(received).not.toThrow()

Error name:    "SecurityError"
Error message: "Input contains suspicious content"

      504 |                 severity: "high"
      505 |               }));
    > 506 |               throw new SecurityError("Input contains suspicious content", "SUSPICIOUS_CONTENT");

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:383:37
     // Check for suspicious patterns
     const dataString = JSON.stringify(data);
     for (const pattern of this.config.policies.suspiciousPatterns) {
-      if (pattern.test(dataString)) {
-        this.logSecurityEvent({
-          type: SecurityEventType.SUSPICIOUS_ACTIVITY,
-          context,
-          resource: action,
-          action: "sanitize_input",
-          result: "blocked",
-          details: {
-            pattern: pattern.toString(),
-            dataLength: dataString.length,
-          },
-          severity: "high",
-        });
-        throw new SecurityError(
-          "Input contains suspicious content",
-          "SUSPICIOUS_CONTENT"
-        );
-      }
+      if (pattern.test(dataString)) {}
     }
 
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A2: Malicious Input Handling XSS Attack Vectors should block <script> tag injection
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: SecurityError

Received function did not throw

[Killed] ObjectLiteral
src/orchestrator/SecurityManager.ts:384:31
     const dataString = JSON.stringify(data);
     for (const pattern of this.config.policies.suspiciousPatterns) {
       if (pattern.test(dataString)) {
-        this.logSecurityEvent({
-          type: SecurityEventType.SUSPICIOUS_ACTIVITY,
-          context,
-          resource: action,
-          action: "sanitize_input",
-          result: "blocked",
-          details: {
-            pattern: pattern.toString(),
-            dataLength: dataString.length,
-          },
-          severity: "high",
-        });
+        this.logSecurityEvent({});
         throw new SecurityError(
           "Input contains suspicious content",
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A2: Malicious Input Handling Security Event Logging should log all injection attempts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/orchestrator/SecurityManager.ts:404:9
     }
 
     // Size limits
-    if (dataString.length > this.config.policies.maxMetadataSize) {
+    if (dataString.length <= this.config.policies.maxMetadataSize) {
       this.logSecurityEvent({
         type: SecurityEventType.INPUT_VALIDATION_FAILURE,
killedBy: Penetration Testing - Injection Attacks Fuzzing with Random Inputs should handle extremely long inputs
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: SecurityError
Received constructor: ReferenceError

[Killed] ConditionalExpression
src/orchestrator/SecurityManager.ts:404:9
     }
 
     // Size limits
-    if (dataString.length > this.config.policies.maxMetadataSize) {
+    if (true) {
       this.logSecurityEvent({
         type: SecurityEventType.INPUT_VALIDATION_FAILURE,
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A1: Comprehensive Test Suite Execution should support all security operations
statusReason: Error: expect(received).not.toThrow()

Error name:    "SecurityError"
Error message: "Input data too large"

      528 |             severity: "medium"
      529 |           }));
    > 530 |           throw new SecurityError("Input data too large", "DATA_TOO_LARGE");

[Survived] ObjectLiteral
src/orchestrator/SecurityManager.ts:411:18
         resource: action,
         action: "sanitize_input",
         result: "blocked",
-        details: {
-          dataLength: dataString.length,
-          maxSize: this.config.policies.maxMetadataSize,
-        },
+        details: {},
         severity: "medium",
       });

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:426:49
   /**
    * Get immutable view of policy configuration
    */
-  getPolicyConfig(): SecurityConfig["policies"] {
-    return {
-      ...this.config.policies,
-      suspiciousPatterns: [...this.config.policies.suspiciousPatterns],
-    };
-  }
+  getPolicyConfig(): SecurityConfig["policies"] {}
 
   /**
killedBy: SecureTaskQueue enqueues task when credentials are valid
statusReason: TypeError: Cannot read properties of undefined (reading 'allowedTaskTypes')

[Survived] BlockStatement
src/orchestrator/SecurityManager.ts:436:44
   /**
    * Determine whether agent is trusted (trusted or admin)
    */
-  isTrustedAgent(agentId: string): boolean {
-    return (
-      this.config.trustedAgents.includes(agentId) ||
-      this.config.adminAgents.includes(agentId)
-    );
-  }
+  isTrustedAgent(agentId: string): boolean {}
 
   /**

[Killed] ConditionalExpression
src/orchestrator/SecurityManager.ts:438:7
    */
   isTrustedAgent(agentId: string): boolean {
     return (
-      this.config.trustedAgents.includes(agentId) ||
-      this.config.adminAgents.includes(agentId)
+      true
     );
   }
killedBy: SecureTaskQueue rejects task types not permitted for the agent
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] ConditionalExpression
src/orchestrator/SecurityManager.ts:438:7
    */
   isTrustedAgent(agentId: string): boolean {
     return (
-      this.config.trustedAgents.includes(agentId) ||
-      this.config.adminAgents.includes(agentId)
+      false
     );
   }

[Killed] ConditionalExpression
src/orchestrator/SecurityManager.ts:455:9
     }
 
     // Agents can always access their own resources
-    if (context.agentId === resourceAgentId) {
+    if (true) {
       return true;
     }
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) Resource Access Control should enforce resource ownership
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:455:46
     }
 
     // Agents can always access their own resources
-    if (context.agentId === resourceAgentId) {
-      return true;
-    }
+    if (context.agentId === resourceAgentId) {}
 
     // Admin/Trusted level can access all resources
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) Resource Access Control should enforce resource ownership
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/orchestrator/SecurityManager.ts:456:14
 
     // Agents can always access their own resources
     if (context.agentId === resourceAgentId) {
-      return true;
+      return false;
     }
 
killedBy: SecurityManager Resource Access Control should allow agent to access own resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/orchestrator/SecurityManager.ts:461:7
 
     // Admin/Trusted level can access all resources
     if (
-      context.securityLevel === SecurityLevel.ADMIN ||
-      context.securityLevel === SecurityLevel.TRUSTED_AGENT
+      false
     ) {
       return true;
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) Resource Access Control should allow trusted agents cross-access
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/orchestrator/SecurityManager.ts:461:7
 
     // Admin/Trusted level can access all resources
     if (
-      context.securityLevel === SecurityLevel.ADMIN ||
+      false ||
       context.securityLevel === SecurityLevel.TRUSTED_AGENT
     ) {
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) Resource Access Control should allow admin agents full access
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
