[Killed] BooleanLiteral
src/resources/AdaptiveResourceManager.ts:30:12
  * Default configuration
  */
 const DEFAULT_CONFIG: AdaptiveResourceManagerConfig = {
-  enabled: true,
+  enabled: false,
   monitoringIntervalMs: 5000,
   loadBalancingStrategy: LoadBalancingStrategy.LEAST_LOADED,
killedBy: AdaptiveResourceManager Initialization should start and stop manager
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BooleanLiteral
src/resources/AdaptiveResourceManager.ts:33:30
   enabled: true,
   monitoringIntervalMs: 5000,
   loadBalancingStrategy: LoadBalancingStrategy.LEAST_LOADED,
-  enableDynamicRateLimiting: true,
+  enableDynamicRateLimiting: false,
   enableAutoFailover: true,
   thresholds: {

[Killed] BooleanLiteral
src/resources/AdaptiveResourceManager.ts:34:23
   monitoringIntervalMs: 5000,
   loadBalancingStrategy: LoadBalancingStrategy.LEAST_LOADED,
   enableDynamicRateLimiting: true,
-  enableAutoFailover: true,
+  enableAutoFailover: false,
   thresholds: {
     cpuWarning: 70,
killedBy: AdaptiveResourceManager Failover should handle failover
statusReason: Error: Auto-failover is disabled

[Survived] ObjectLiteral
src/resources/AdaptiveResourceManager.ts:35:15
   loadBalancingStrategy: LoadBalancingStrategy.LEAST_LOADED,
   enableDynamicRateLimiting: true,
   enableAutoFailover: true,
-  thresholds: {
-    cpuWarning: 70,
-    cpuCritical: 85,
-    memoryWarning: 75,
-    memoryCritical: 90,
-  },
+  thresholds: {},
   maxAllocationDecisionMs: 50,
   enableCapacityPlanning: true,

[Survived] BooleanLiteral
src/resources/AdaptiveResourceManager.ts:42:27
     memoryCritical: 90,
   },
   maxAllocationDecisionMs: 50,
-  enableCapacityPlanning: true,
+  enableCapacityPlanning: false,
   capacityAnalysisIntervalMs: 300000, // 5 minutes
 };

[Survived] BooleanLiteral
src/resources/AdaptiveResourceManager.ts:62:23
   private resourceMonitor: ResourceMonitor;
   private loadBalancer: LoadBalancer;
   private resourceAllocator: ResourceAllocator;
-  private isRunning = false;
+  private isRunning = true;
   private capacityAnalysisTimer?: ReturnType<typeof setInterval>;
   private lastCapacityAnalysis?: CapacityAnalysis;

[Killed] ObjectLiteral
src/resources/AdaptiveResourceManager.ts:69:19
 
   constructor(config: Partial<AdaptiveResourceManagerConfig> = {}) {
     this.logger = new Logger("AdaptiveResourceManager");
-    this.config = { ...DEFAULT_CONFIG, ...config };
+    this.config = {};
 
     // Initialize sub-components
killedBy: AdaptiveResourceManager Performance Agent Selection Performance should select agents within 50ms
statusReason: TypeError: Cannot read properties of undefined (reading 'cpuWarning')

[Survived] ObjectLiteral
src/resources/AdaptiveResourceManager.ts:72:48
     this.config = { ...DEFAULT_CONFIG, ...config };
 
     // Initialize sub-components
-    this.resourceMonitor = new ResourceMonitor({
-      intervalMs: this.config.monitoringIntervalMs,
-      cpuThresholds: {
-        warning: this.config.thresholds.cpuWarning,
-        critical: this.config.thresholds.cpuCritical,
-      },
-      memoryThresholds: {
-        warning: this.config.thresholds.memoryWarning,
-        critical: this.config.thresholds.memoryCritical,
-      },
-    });
+    this.resourceMonitor = new ResourceMonitor({});
 
     this.loadBalancer = new LoadBalancer(

[Survived] ObjectLiteral
src/resources/AdaptiveResourceManager.ts:78:25
         warning: this.config.thresholds.cpuWarning,
         critical: this.config.thresholds.cpuCritical,
       },
-      memoryThresholds: {
-        warning: this.config.thresholds.memoryWarning,
-        critical: this.config.thresholds.memoryCritical,
-      },
+      memoryThresholds: {},
     });
 

[Survived] BlockStatement
src/resources/AdaptiveResourceManager.ts:97:37
   /**
    * Initialize the resource manager
    */
-  async initialize(): Promise<void> {
-    // Stop monitor first to prevent multiple timers
-    await this.resourceMonitor.stop();
-    await this.resourceMonitor.start();
-
-    this.logger.info("Adaptive resource manager initialized", {
-      enabled: this.config.enabled,
-      strategy: this.config.loadBalancingStrategy,
-      enableFailover: this.config.enableAutoFailover,
-      enableCapacityPlanning: this.config.enableCapacityPlanning,
-    });
-  }
+  async initialize(): Promise<void> {}
 
   /**

[Killed] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:114:9
    * Start resource management
    */
   async start(): Promise<void> {
-    if (this.isRunning) {
+    if (true) {
       this.logger.warn("Resource manager already running");
       return;
killedBy: AdaptiveResourceManager Initialization should start and stop manager
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] BlockStatement
src/resources/AdaptiveResourceManager.ts:114:25
    * Start resource management
    */
   async start(): Promise<void> {
-    if (this.isRunning) {
-      this.logger.warn("Resource manager already running");
-      return;
-    }
+    if (this.isRunning) {}
 
     if (!this.config.enabled) {

[Killed] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:119:9
       return;
     }
 
-    if (!this.config.enabled) {
+    if (true) {
       this.logger.info("Resource manager disabled, not starting");
       return;
killedBy: AdaptiveResourceManager Initialization should start and stop manager
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/resources/AdaptiveResourceManager.ts:119:9
       return;
     }
 
-    if (!this.config.enabled) {
+    if (this.config.enabled) {
       this.logger.info("Resource manager disabled, not starting");
       return;
killedBy: AdaptiveResourceManager Initialization should start and stop manager
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/resources/AdaptiveResourceManager.ts:124:22
       return;
     }
 
-    this.isRunning = true;
+    this.isRunning = false;
 
     // Start capacity analysis if enabled
killedBy: AdaptiveResourceManager Initialization should start and stop manager
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BlockStatement
src/resources/AdaptiveResourceManager.ts:127:45
     this.isRunning = true;
 
     // Start capacity analysis if enabled
-    if (this.config.enableCapacityPlanning) {
-      this.capacityAnalysisTimer = setInterval(async () => {
-        try {
-          await this.analyzeCapacity();
-        } catch (error) {
-          this.logger.error("Capacity analysis failed", { error });
-        }
-      }, this.config.capacityAnalysisIntervalMs);
-    }
+    if (this.config.enableCapacityPlanning) {}
 
     this.logger.info("Adaptive resource manager started");

[Survived] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:127:9
     this.isRunning = true;
 
     // Start capacity analysis if enabled
-    if (this.config.enableCapacityPlanning) {
+    if (false) {
       this.capacityAnalysisTimer = setInterval(async () => {
         try {

[NoCoverage] BlockStatement
src/resources/AdaptiveResourceManager.ts:128:60
 
     // Start capacity analysis if enabled
     if (this.config.enableCapacityPlanning) {
-      this.capacityAnalysisTimer = setInterval(async () => {
-        try {
-          await this.analyzeCapacity();
-        } catch (error) {
-          this.logger.error("Capacity analysis failed", { error });
-        }
-      }, this.config.capacityAnalysisIntervalMs);
+      this.capacityAnalysisTimer = setInterval(async () => {}, this.config.capacityAnalysisIntervalMs);
     }
 

[NoCoverage] BlockStatement
src/resources/AdaptiveResourceManager.ts:129:13
     // Start capacity analysis if enabled
     if (this.config.enableCapacityPlanning) {
       this.capacityAnalysisTimer = setInterval(async () => {
-        try {
-          await this.analyzeCapacity();
-        } catch (error) {
+        try {} catch (error) {
           this.logger.error("Capacity analysis failed", { error });
         }

[NoCoverage] BlockStatement
src/resources/AdaptiveResourceManager.ts:131:25
       this.capacityAnalysisTimer = setInterval(async () => {
         try {
           await this.analyzeCapacity();
-        } catch (error) {
-          this.logger.error("Capacity analysis failed", { error });
-        }
+        } catch (error) {}
       }, this.config.capacityAnalysisIntervalMs);
     }

[Killed] BlockStatement
src/resources/AdaptiveResourceManager.ts:143:31
   /**
    * Stop resource management
    */
-  async stop(): Promise<void> {
-    if (!this.isRunning) {
-      return;
-    }
-
-    if (this.capacityAnalysisTimer) {
-      clearInterval(this.capacityAnalysisTimer);
-      this.capacityAnalysisTimer = undefined;
-    }
-
-    await this.resourceMonitor.stop();
-    this.isRunning = false;
-
-    this.logger.info("Adaptive resource manager stopped");
-  }
+  async stop(): Promise<void> {}
 
   /**
killedBy: AdaptiveResourceManager Initialization should start and stop manager
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:144:9
    * Stop resource management
    */
   async stop(): Promise<void> {
-    if (!this.isRunning) {
+    if (true) {
       return;
     }
killedBy: AdaptiveResourceManager Initialization should start and stop manager
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/resources/AdaptiveResourceManager.ts:144:9
    * Stop resource management
    */
   async stop(): Promise<void> {
-    if (!this.isRunning) {
+    if (this.isRunning) {
       return;
     }
killedBy: AdaptiveResourceManager Initialization should start and stop manager
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:148:9
       return;
     }
 
-    if (this.capacityAnalysisTimer) {
+    if (false) {
       clearInterval(this.capacityAnalysisTimer);
       this.capacityAnalysisTimer = undefined;

[Survived] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:148:9
       return;
     }
 
-    if (this.capacityAnalysisTimer) {
+    if (true) {
       clearInterval(this.capacityAnalysisTimer);
       this.capacityAnalysisTimer = undefined;

[Killed] BooleanLiteral
src/resources/AdaptiveResourceManager.ts:154:22
     }
 
     await this.resourceMonitor.stop();
-    this.isRunning = false;
+    this.isRunning = true;
 
     this.logger.info("Adaptive resource manager stopped");
killedBy: AdaptiveResourceManager Initialization should start and stop manager
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/resources/AdaptiveResourceManager.ts:167:40
    */
   async allocateResources(
     request: ResourceAllocationRequest
-  ): Promise<ResourceAllocationResult> {
-    const startTime = Date.now();
-
-    try {
-      const result = await this.resourceAllocator.allocate(request);
-
-      // Check if allocation took too long
-      const allocationTime = Date.now() - startTime;
-      if (allocationTime > this.config.maxAllocationDecisionMs) {
-        this.logger.warn("Allocation decision exceeded max time", {
-          allocationTime,
-          maxAllocationTime: this.config.maxAllocationDecisionMs,
-        });
-      }
-
-      return result;
-    } catch (error) {
-      this.logger.error("Resource allocation failed", {
-        requestId: request.requestId,
-        error,
-      });
-
-      throw error;
-    }
-  }
+  ): Promise<ResourceAllocationResult> {}
 
   /**
killedBy: AdaptiveResourceManager Resource Allocation should allocate resources
statusReason: TypeError: Cannot read properties of undefined (reading 'requestId')

[Killed] BlockStatement
src/resources/AdaptiveResourceManager.ts:170:9
   ): Promise<ResourceAllocationResult> {
     const startTime = Date.now();
 
-    try {
-      const result = await this.resourceAllocator.allocate(request);
-
-      // Check if allocation took too long
-      const allocationTime = Date.now() - startTime;
-      if (allocationTime > this.config.maxAllocationDecisionMs) {
-        this.logger.warn("Allocation decision exceeded max time", {
-          allocationTime,
-          maxAllocationTime: this.config.maxAllocationDecisionMs,
-        });
-      }
-
-      return result;
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error("Resource allocation failed", {
         requestId: request.requestId,
killedBy: AdaptiveResourceManager Resource Allocation should allocate resources
statusReason: TypeError: Cannot read properties of undefined (reading 'requestId')

[Survived] ArithmeticOperator
src/resources/AdaptiveResourceManager.ts:174:30
       const result = await this.resourceAllocator.allocate(request);
 
       // Check if allocation took too long
-      const allocationTime = Date.now() - startTime;
+      const allocationTime = Date.now() + startTime;
       if (allocationTime > this.config.maxAllocationDecisionMs) {
         this.logger.warn("Allocation decision exceeded max time", {

[Survived] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:175:11
 
       // Check if allocation took too long
       const allocationTime = Date.now() - startTime;
-      if (allocationTime > this.config.maxAllocationDecisionMs) {
+      if (false) {
         this.logger.warn("Allocation decision exceeded max time", {
           allocationTime,

[Survived] EqualityOperator
src/resources/AdaptiveResourceManager.ts:175:11
 
       // Check if allocation took too long
       const allocationTime = Date.now() - startTime;
-      if (allocationTime > this.config.maxAllocationDecisionMs) {
+      if (allocationTime <= this.config.maxAllocationDecisionMs) {
         this.logger.warn("Allocation decision exceeded max time", {
           allocationTime,

[NoCoverage] BlockStatement
src/resources/AdaptiveResourceManager.ts:183:21
       }
 
       return result;
-    } catch (error) {
-      this.logger.error("Resource allocation failed", {
-        requestId: request.requestId,
-        error,
-      });
-
-      throw error;
-    }
+    } catch (error) {}
   }
 

[Survived] BlockStatement
src/resources/AdaptiveResourceManager.ts:198:60
    *
    * @param requestId Request identifier
    */
-  async releaseResources(requestId: string): Promise<void> {
-    await this.resourceAllocator.release(requestId);
-  }
+  async releaseResources(requestId: string): Promise<void> {}
 
   /**

[Killed] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:212:7
 
     // Calculate utilization
     const cpuUtilization =
-      poolStats.totalCpuCapacity > 0
+      true
         ? (poolStats.usedCpuCapacity / poolStats.totalCpuCapacity) * 100
         : 0;
killedBy: AdaptiveResourceManager Capacity Analysis should analyze capacity
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 0
Received:    NaN

[Killed] EqualityOperator
src/resources/AdaptiveResourceManager.ts:212:7
 
     // Calculate utilization
     const cpuUtilization =
-      poolStats.totalCpuCapacity > 0
+      poolStats.totalCpuCapacity <= 0
         ? (poolStats.usedCpuCapacity / poolStats.totalCpuCapacity) * 100
         : 0;
killedBy: AdaptiveResourceManager Capacity Analysis should analyze capacity
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 0
Received:    NaN

[NoCoverage] ArithmeticOperator
src/resources/AdaptiveResourceManager.ts:213:12
     // Calculate utilization
     const cpuUtilization =
       poolStats.totalCpuCapacity > 0
-        ? (poolStats.usedCpuCapacity / poolStats.totalCpuCapacity) * 100
+        ? (poolStats.usedCpuCapacity * poolStats.totalCpuCapacity) * 100
         : 0;
 

[NoCoverage] ArithmeticOperator
src/resources/AdaptiveResourceManager.ts:213:11
     // Calculate utilization
     const cpuUtilization =
       poolStats.totalCpuCapacity > 0
-        ? (poolStats.usedCpuCapacity / poolStats.totalCpuCapacity) * 100
+        ? poolStats.usedCpuCapacity / poolStats.totalCpuCapacity / 100
         : 0;
 

[Killed] EqualityOperator
src/resources/AdaptiveResourceManager.ts:217:7
         : 0;
 
     const memoryUtilization =
-      poolStats.totalMemoryCapacity > 0
+      poolStats.totalMemoryCapacity <= 0
         ? (poolStats.usedMemoryCapacity / poolStats.totalMemoryCapacity) * 100
         : 0;
killedBy: AdaptiveResourceManager Capacity Analysis should analyze capacity
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 0
Received:    NaN

[Killed] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:217:7
         : 0;
 
     const memoryUtilization =
-      poolStats.totalMemoryCapacity > 0
+      true
         ? (poolStats.usedMemoryCapacity / poolStats.totalMemoryCapacity) * 100
         : 0;
killedBy: AdaptiveResourceManager Capacity Analysis should analyze capacity
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 0
Received:    NaN

[NoCoverage] ArithmeticOperator
src/resources/AdaptiveResourceManager.ts:218:12
 
     const memoryUtilization =
       poolStats.totalMemoryCapacity > 0
-        ? (poolStats.usedMemoryCapacity / poolStats.totalMemoryCapacity) * 100
+        ? (poolStats.usedMemoryCapacity * poolStats.totalMemoryCapacity) * 100
         : 0;
 

[NoCoverage] ArithmeticOperator
src/resources/AdaptiveResourceManager.ts:218:11
 
     const memoryUtilization =
       poolStats.totalMemoryCapacity > 0
-        ? (poolStats.usedMemoryCapacity / poolStats.totalMemoryCapacity) * 100
+        ? poolStats.usedMemoryCapacity / poolStats.totalMemoryCapacity / 100
         : 0;
 

[Survived] ArithmeticOperator
src/resources/AdaptiveResourceManager.ts:221:33
         ? (poolStats.usedMemoryCapacity / poolStats.totalMemoryCapacity) * 100
         : 0;
 
-    const utilizationPercent = (cpuUtilization + memoryUtilization) / 2;
+    const utilizationPercent = (cpuUtilization - memoryUtilization) / 2;
 
     // Determine scaling recommendation

[Survived] ArithmeticOperator
src/resources/AdaptiveResourceManager.ts:221:32
         ? (poolStats.usedMemoryCapacity / poolStats.totalMemoryCapacity) * 100
         : 0;
 
-    const utilizationPercent = (cpuUtilization + memoryUtilization) / 2;
+    const utilizationPercent = (cpuUtilization + memoryUtilization) * 2;
 
     // Determine scaling recommendation

[Survived] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:227:9
     let scalingRecommendation: "scale_up" | "scale_down" | "maintain";
     let recommendationRationale: string;
 
-    if (utilizationPercent >= 80) {
+    if (false) {
       scalingRecommendation = "scale_up";
       recommendationRationale = `High utilization (${utilizationPercent.toFixed(

[Survived] EqualityOperator
src/resources/AdaptiveResourceManager.ts:227:9
     let scalingRecommendation: "scale_up" | "scale_down" | "maintain";
     let recommendationRationale: string;
 
-    if (utilizationPercent >= 80) {
+    if (utilizationPercent < 80) {
       scalingRecommendation = "scale_up";
       recommendationRationale = `High utilization (${utilizationPercent.toFixed(

[Killed] BlockStatement
src/resources/AdaptiveResourceManager.ts:232:42
       recommendationRationale = `High utilization (${utilizationPercent.toFixed(
         1
       )}%), recommend scaling up`;
-    } else if (utilizationPercent <= 30) {
-      scalingRecommendation = "scale_down";
-      recommendationRationale = `Low utilization (${utilizationPercent.toFixed(
-        1
-      )}%), consider scaling down`;
-    } else {
+    } else if (utilizationPercent <= 30) {} else {
       scalingRecommendation = "maintain";
       recommendationRationale = `Utilization at ${utilizationPercent.toFixed(
killedBy: AdaptiveResourceManager Capacity Analysis should analyze capacity
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Survived] EqualityOperator
src/resources/AdaptiveResourceManager.ts:232:16
       recommendationRationale = `High utilization (${utilizationPercent.toFixed(
         1
       )}%), recommend scaling up`;
-    } else if (utilizationPercent <= 30) {
+    } else if (utilizationPercent < 30) {
       scalingRecommendation = "scale_down";
       recommendationRationale = `Low utilization (${utilizationPercent.toFixed(

[NoCoverage] BlockStatement
src/resources/AdaptiveResourceManager.ts:237:12
       recommendationRationale = `Low utilization (${utilizationPercent.toFixed(
         1
       )}%), consider scaling down`;
-    } else {
-      scalingRecommendation = "maintain";
-      recommendationRationale = `Utilization at ${utilizationPercent.toFixed(
-        1
-      )}%, current capacity is adequate`;
-    }
+    } else {}
 
     const analysis: CapacityAnalysis = {

[Survived] ArithmeticOperator
src/resources/AdaptiveResourceManager.ts:258:21
         activeAgents: poolStats.activeAgents,
       },
       availableCapacity: {
-        cpuPercent: poolStats.totalCpuCapacity - poolStats.usedCpuCapacity,
+        cpuPercent: poolStats.totalCpuCapacity + poolStats.usedCpuCapacity,
         memoryMb: poolStats.totalMemoryCapacity - poolStats.usedMemoryCapacity,
         idleAgents: poolStats.idleAgents,

[Survived] ArithmeticOperator
src/resources/AdaptiveResourceManager.ts:259:19
       },
       availableCapacity: {
         cpuPercent: poolStats.totalCpuCapacity - poolStats.usedCpuCapacity,
-        memoryMb: poolStats.totalMemoryCapacity - poolStats.usedMemoryCapacity,
+        memoryMb: poolStats.totalMemoryCapacity + poolStats.usedMemoryCapacity,
         idleAgents: poolStats.idleAgents,
       },

[Killed] BlockStatement
src/resources/AdaptiveResourceManager.ts:282:57
    *
    * @returns Resource pool statistics
    */
-  async getPoolStatistics(): Promise<ResourcePoolStats> {
-    return this.resourceMonitor.getPoolStats();
-  }
+  async getPoolStatistics(): Promise<ResourcePoolStats> {}
 
   /**
killedBy: AdaptiveResourceManager Statistics should get pool statistics
statusReason: TypeError: Cannot read properties of undefined (reading 'totalAgents')

[Killed] BlockStatement
src/resources/AdaptiveResourceManager.ts:291:46
    *
    * @returns Current configuration
    */
-  getConfig(): AdaptiveResourceManagerConfig {
-    return { ...this.config };
-  }
+  getConfig(): AdaptiveResourceManagerConfig {}
 
   /**
killedBy: AdaptiveResourceManager Configuration should get configuration
statusReason: TypeError: Cannot read properties of undefined (reading 'enabled')

[Survived] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:304:9
     const wasRunning = this.isRunning;
 
     // Stop if running
-    if (wasRunning) {
+    if (true) {
       this.stop();
     }

[Survived] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:304:9
     const wasRunning = this.isRunning;
 
     // Stop if running
-    if (wasRunning) {
+    if (false) {
       this.stop();
     }

[NoCoverage] BlockStatement
src/resources/AdaptiveResourceManager.ts:312:39
     this.config = { ...this.config, ...config };
 
     // Update sub-components
-    if (config.loadBalancingStrategy) {
-      this.loadBalancer.setStrategy(config.loadBalancingStrategy);
-    }
+    if (config.loadBalancingStrategy) {}
 
     if (config.thresholds) {

[Survived] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:312:9
     this.config = { ...this.config, ...config };
 
     // Update sub-components
-    if (config.loadBalancingStrategy) {
+    if (false) {
       this.loadBalancer.setStrategy(config.loadBalancingStrategy);
     }

[Killed] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:316:9
       this.loadBalancer.setStrategy(config.loadBalancingStrategy);
     }
 
-    if (config.thresholds) {
+    if (true) {
       this.resourceMonitor.updateConfig({
         cpuThresholds: {
killedBy: AdaptiveResourceManager Configuration should update configuration
statusReason: TypeError: Cannot read properties of undefined (reading 'cpuWarning')

[Survived] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:316:9
       this.loadBalancer.setStrategy(config.loadBalancingStrategy);
     }
 
-    if (config.thresholds) {
+    if (false) {
       this.resourceMonitor.updateConfig({
         cpuThresholds: {

[NoCoverage] ObjectLiteral
src/resources/AdaptiveResourceManager.ts:317:41
     }
 
     if (config.thresholds) {
-      this.resourceMonitor.updateConfig({
-        cpuThresholds: {
-          warning: config.thresholds.cpuWarning,
-          critical: config.thresholds.cpuCritical,
-        },
-        memoryThresholds: {
-          warning: config.thresholds.memoryWarning,
-          critical: config.thresholds.memoryCritical,
-        },
-      });
+      this.resourceMonitor.updateConfig({});
     }
 

[Survived] LogicalOperator
src/resources/AdaptiveResourceManager.ts:330:9
     }
 
     // Restart if was running
-    if (wasRunning && this.config.enabled) {
+    if (wasRunning || this.config.enabled) {
       this.start();
     }

[Survived] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:330:9
     }
 
     // Restart if was running
-    if (wasRunning && this.config.enabled) {
+    if (false) {
       this.start();
     }

[Killed] BlockStatement
src/resources/AdaptiveResourceManager.ts:347:5
     lastMonitoringTime?: Date;
     activeAllocations: number;
     failoverEvents: number;
-  } {
-    return {
-      isRunning: this.isRunning,
-      lastMonitoringTime: this.lastCapacityAnalysis?.timestamp,
-      activeAllocations: this.resourceAllocator.getActiveAllocationCount(),
-      failoverEvents: this.failoverEvents.length,
-    };
-  }
+  } {}
 
   /**
killedBy: AdaptiveResourceManager Initialization should initialize manager
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] OptionalChaining
src/resources/AdaptiveResourceManager.ts:350:27
   } {
     return {
       isRunning: this.isRunning,
-      lastMonitoringTime: this.lastCapacityAnalysis?.timestamp,
+      lastMonitoringTime: this.lastCapacityAnalysis.timestamp,
       activeAllocations: this.resourceAllocator.getActiveAllocationCount(),
       failoverEvents: this.failoverEvents.length,
killedBy: AdaptiveResourceManager Initialization should initialize manager
statusReason: TypeError: Cannot read properties of undefined (reading 'timestamp')

[Killed] BooleanLiteral
src/resources/AdaptiveResourceManager.ts:369:9
   ): Promise<FailoverEvent> {
     const startTime = Date.now();
 
-    if (!this.config.enableAutoFailover) {
+    if (this.config.enableAutoFailover) {
       throw new Error("Auto-failover is disabled");
     }
killedBy: AdaptiveResourceManager Failover should handle failover
statusReason: Error: Auto-failover is disabled

[Killed] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:369:9
   ): Promise<FailoverEvent> {
     const startTime = Date.now();
 
-    if (!this.config.enableAutoFailover) {
+    if (true) {
       throw new Error("Auto-failover is disabled");
     }
killedBy: AdaptiveResourceManager Failover should handle failover
statusReason: Error: Auto-failover is disabled

[Survived] ArithmeticOperator
src/resources/AdaptiveResourceManager.ts:392:21
         backupAgentId,
         tasksTransferred,
         timestamp: new Date(),
-        durationMs: Date.now() - startTime,
+        durationMs: Date.now() + startTime,
         failureReason: "Agent health check failed",
         success: true,

[Killed] BooleanLiteral
src/resources/AdaptiveResourceManager.ts:394:18
         timestamp: new Date(),
         durationMs: Date.now() - startTime,
         failureReason: "Agent health check failed",
-        success: true,
+        success: false,
       };
 
killedBy: AdaptiveResourceManager Performance Failover Performance should handle failover within reasonable time
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/resources/AdaptiveResourceManager.ts:400:11
       this.failoverEvents.push(failoverEvent);
 
       // Keep only last 100 failover events
-      if (this.failoverEvents.length > 100) {
+      if (this.failoverEvents.length <= 100) {
         this.failoverEvents.shift();
       }
killedBy: AdaptiveResourceManager Failover should track failover history
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] ConditionalExpression
src/resources/AdaptiveResourceManager.ts:400:11
       this.failoverEvents.push(failoverEvent);
 
       // Keep only last 100 failover events
-      if (this.failoverEvents.length > 100) {
+      if (true) {
         this.failoverEvents.shift();
       }
killedBy: AdaptiveResourceManager Failover should track failover history
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0
