[Survived] ArithmeticOperator
src/orchestrator/SecurityManager.ts:651:25
     }
 
     // Block for duration
-    this.blockedUntil = now + this.config.blockDurationMs;
+    this.blockedUntil = now - this.config.blockDurationMs;
     return false;
   }

[Killed] BooleanLiteral
src/orchestrator/SecurityManager.ts:652:12
 
     // Block for duration
     this.blockedUntil = now + this.config.blockDurationMs;
-    return false;
+    return true;
   }
 
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) A3: Rate Limiting and Load Testing should enforce rate limits per action type
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[NoCoverage] BlockStatement
src/orchestrator/SecurityManager.ts:655:34
     return false;
   }
 
-  getRemainingRequests(): number {
-    const now = Date.now();
-    this.requests = this.requests.filter(
-      (timestamp) => now - timestamp < this.config.windowMs
-    );
-    return Math.max(0, this.config.requestsPerWindow - this.requests.length);
-  }
+  getRemainingRequests(): number {}
 
   getBlockedUntil(): number {

[NoCoverage] MethodExpression
src/orchestrator/SecurityManager.ts:657:21
 
   getRemainingRequests(): number {
     const now = Date.now();
-    this.requests = this.requests.filter(
-      (timestamp) => now - timestamp < this.config.windowMs
-    );
+    this.requests = this.requests;
     return Math.max(0, this.config.requestsPerWindow - this.requests.length);
   }

[NoCoverage] ArrowFunction
src/orchestrator/SecurityManager.ts:658:7
   getRemainingRequests(): number {
     const now = Date.now();
     this.requests = this.requests.filter(
-      (timestamp) => now - timestamp < this.config.windowMs
+      () => undefined
     );
     return Math.max(0, this.config.requestsPerWindow - this.requests.length);

[NoCoverage] ConditionalExpression
src/orchestrator/SecurityManager.ts:658:22
   getRemainingRequests(): number {
     const now = Date.now();
     this.requests = this.requests.filter(
-      (timestamp) => now - timestamp < this.config.windowMs
+      (timestamp) => true
     );
     return Math.max(0, this.config.requestsPerWindow - this.requests.length);

[NoCoverage] MethodExpression
src/orchestrator/SecurityManager.ts:660:12
     this.requests = this.requests.filter(
       (timestamp) => now - timestamp < this.config.windowMs
     );
-    return Math.max(0, this.config.requestsPerWindow - this.requests.length);
+    return Math.min(0, this.config.requestsPerWindow - this.requests.length);
   }
 

[NoCoverage] ArithmeticOperator
src/orchestrator/SecurityManager.ts:660:24
     this.requests = this.requests.filter(
       (timestamp) => now - timestamp < this.config.windowMs
     );
-    return Math.max(0, this.config.requestsPerWindow - this.requests.length);
+    return Math.max(0, this.config.requestsPerWindow + this.requests.length);
   }
 

[NoCoverage] BlockStatement
src/orchestrator/SecurityManager.ts:663:29
     return Math.max(0, this.config.requestsPerWindow - this.requests.length);
   }
 
-  getBlockedUntil(): number {
-    return this.blockedUntil;
-  }
+  getBlockedUntil(): number {}
 }
 

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:684:49
 export class SecurityMiddleware {
   private securityManager: SecurityManager;
 
-  constructor(securityManager: SecurityManager) {
-    this.securityManager = securityManager;
-  }
+  constructor(securityManager: SecurityManager) {}
 
   /**
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) SecurityMiddleware Integration should protect operations end-to-end
statusReason: TypeError: Cannot read properties of undefined (reading 'authenticate')

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:699:19
   ): Promise<T> {
     // Authenticate
     const context = this.securityManager.authenticate(credentials);
-    if (!context) {
-      throw new SecurityError("Authentication failed", "AUTH_FAILED");
-    }
+    if (!context) {}
 
     // Authorize
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) SecurityMiddleware Integration should throw on authentication failure
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: SecurityError
Received constructor: TypeError

Received message: "Cannot read properties of null (reading 'expiresAt')"

      396 |

[Killed] ConditionalExpression
src/orchestrator/SecurityManager.ts:699:9
   ): Promise<T> {
     // Authenticate
     const context = this.securityManager.authenticate(credentials);
-    if (!context) {
+    if (true) {
       throw new SecurityError("Authentication failed", "AUTH_FAILED");
     }
killedBy: SecureTaskQueue enqueues task when credentials are valid
statusReason: SecurityError: Authentication failed

[Killed] BooleanLiteral
src/orchestrator/SecurityManager.ts:704:9
     }
 
     // Authorize
-    if (!this.securityManager.authorize(context, permission)) {
+    if (this.securityManager.authorize(context, permission)) {
       throw new SecurityError("Authorization failed", "AUTHZ_FAILED");
     }
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) SecurityMiddleware Integration should protect operations end-to-end
statusReason: SecurityError: Authorization failed

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:704:63
     }
 
     // Authorize
-    if (!this.securityManager.authorize(context, permission)) {
-      throw new SecurityError("Authorization failed", "AUTHZ_FAILED");
-    }
+    if (!this.securityManager.authorize(context, permission)) {}
 
     // Rate limit
killedBy: Security Policy Enforcer - Production Hardening (ARBITER-013) SecurityMiddleware Integration should throw on authorization failure
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"success": true}

[Killed] ConditionalExpression
src/orchestrator/SecurityManager.ts:709:9
     }
 
     // Rate limit
-    if (!this.securityManager.checkRateLimit(context, action)) {
+    if (false) {
       throw new SecurityError("Rate limit exceeded", "RATE_LIMITED");
     }
killedBy: SecureTaskQueue propagates rate-limit violations
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: [undefined, undefined, undefined, undefined, undefined, undefined, undefined, undefined, undefined, undefined, …]

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:709:64
     }
 
     // Rate limit
-    if (!this.securityManager.checkRateLimit(context, action)) {
-      throw new SecurityError("Rate limit exceeded", "RATE_LIMITED");
-    }
+    if (!this.securityManager.checkRateLimit(context, action)) {}
 
     // Execute operation
killedBy: SecureTaskQueue propagates rate-limit violations
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: [undefined, undefined, undefined, undefined, undefined, undefined, undefined, undefined, undefined, undefined, …]

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:714:9
     }
 
     // Execute operation
-    try {
-      return await operation(context);
-    } catch (error) {
+    try {} catch (error) {
       // Log operation failure
       console.error(`Operation failed for agent ${context.agentId}:`, error);
killedBy: SecureTaskQueue enqueues task when credentials are valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/orchestrator/SecurityManager.ts:716:21
     // Execute operation
     try {
       return await operation(context);
-    } catch (error) {
-      // Log operation failure
-      console.error(`Operation failed for agent ${context.agentId}:`, error);
-      throw error;
-    }
+    } catch (error) {}
   }
 }
killedBy: SecureTaskQueue enforces metadata size and description limits
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
