[Killed] BlockStatement
src/resources/LoadBalancer.ts:39:5
   constructor(
     resourceMonitor: ResourceMonitor,
     strategy: LoadBalancingStrategy = LoadBalancingStrategy.LEAST_LOADED
-  ) {
-    this.logger = new Logger("LoadBalancer");
-    this.resourceMonitor = resourceMonitor;
-    this.strategy = strategy;
-  }
+  ) {}
 
   /**
killedBy: ResourceAllocator Resource Allocation should successfully allocate resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/resources/LoadBalancer.ts:58:9
   ): Promise<LoadBalancingDecision> {
     const startTime = Date.now();
 
-    if (availableAgents.length === 0) {
+    if (true) {
       throw new Error("No available agents for task assignment");
     }
killedBy: ResourceAllocator Resource Allocation should successfully allocate resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/resources/LoadBalancer.ts:58:9
   ): Promise<LoadBalancingDecision> {
     const startTime = Date.now();
 
-    if (availableAgents.length === 0) {
+    if (availableAgents.length !== 0) {
       throw new Error("No available agents for task assignment");
     }
killedBy: LoadBalancer Agent Selection should select agent using least loaded strategy
statusReason: Error: No available agents for task assignment

[Survived] ConditionalExpression
src/resources/LoadBalancer.ts:71:7
     let alternativesConsidered: string[] = [];
 
     switch (this.strategy) {
-      case LoadBalancingStrategy.ROUND_ROBIN:
-        ({ selectedAgentId, rationale, alternativesConsidered } =
-          this.selectRoundRobin(availableAgents));
-        break;
+      case LoadBalancingStrategy.ROUND_ROBIN:
 
       case LoadBalancingStrategy.LEAST_LOADED:

[Survived] ConditionalExpression
src/resources/LoadBalancer.ts:76:7
           this.selectRoundRobin(availableAgents));
         break;
 
-      case LoadBalancingStrategy.LEAST_LOADED:
-        ({ selectedAgentId, rationale, alternativesConsidered } =
-          await this.selectLeastLoaded(agentProfiles));
-        break;
+      case LoadBalancingStrategy.LEAST_LOADED:
 
       case LoadBalancingStrategy.WEIGHTED:

[Survived] ConditionalExpression
src/resources/LoadBalancer.ts:81:7
           await this.selectLeastLoaded(agentProfiles));
         break;
 
-      case LoadBalancingStrategy.WEIGHTED:
-        ({ selectedAgentId, rationale, alternativesConsidered } =
-          await this.selectWeighted(agentProfiles));
-        break;
+      case LoadBalancingStrategy.WEIGHTED:
 
       case LoadBalancingStrategy.PRIORITY_BASED:

[Survived] ConditionalExpression
src/resources/LoadBalancer.ts:86:7
           await this.selectWeighted(agentProfiles));
         break;
 
-      case LoadBalancingStrategy.PRIORITY_BASED:
-        ({ selectedAgentId, rationale, alternativesConsidered } =
-          await this.selectPriorityBased(request, agentProfiles));
-        break;
+      case LoadBalancingStrategy.PRIORITY_BASED:
 
       case LoadBalancingStrategy.RANDOM:

[Killed] ConditionalExpression
src/resources/LoadBalancer.ts:91:7
           await this.selectPriorityBased(request, agentProfiles));
         break;
 
-      case LoadBalancingStrategy.RANDOM:
-        ({ selectedAgentId, rationale, alternativesConsidered } =
-          this.selectRandom(availableAgents));
-        break;
+      case LoadBalancingStrategy.RANDOM:
 
       default:
killedBy: LoadBalancer Agent Selection should select agent using random strategy
statusReason: Error: Unknown load balancing strategy: random

[Killed] ConditionalExpression
src/resources/LoadBalancer.ts:96:7
           this.selectRandom(availableAgents));
         break;
 
-      default:
-        throw new Error(`Unknown load balancing strategy: ${this.strategy}`);
+      default:
     }
 
killedBy: LoadBalancer Agent Selection should throw error for unknown strategy
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"agentLoad": 0, "alternativesConsidered": [], "decisionDurationMs": 0, "rationale": undefined, "selectedAgentId": undefined, "strategy": "INVALID_STRATEGY", "timestamp": 2025-10-15T08:03:57.045Z}

[Survived] ConditionalExpression
src/resources/LoadBalancer.ts:102:14
 
     // Get agent load
     const agentProfile = agentProfiles.find(
-      (p) => p.agentId === selectedAgentId
+      (p) => true
     );
     const agentLoad = agentProfile

[Survived] EqualityOperator
src/resources/LoadBalancer.ts:102:14
 
     // Get agent load
     const agentProfile = agentProfiles.find(
-      (p) => p.agentId === selectedAgentId
+      (p) => p.agentId !== selectedAgentId
     );
     const agentLoad = agentProfile

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:105:10
       (p) => p.agentId === selectedAgentId
     );
     const agentLoad = agentProfile
-      ? (agentProfile.currentTaskCount / agentProfile.maxTaskCapacity) * 100
+      ? (agentProfile.currentTaskCount * agentProfile.maxTaskCapacity) * 100
       : 0;
 

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:105:9
       (p) => p.agentId === selectedAgentId
     );
     const agentLoad = agentProfile
-      ? (agentProfile.currentTaskCount / agentProfile.maxTaskCapacity) * 100
+      ? agentProfile.currentTaskCount / agentProfile.maxTaskCapacity / 100
       : 0;
 

[Survived] LogicalOperator
src/resources/LoadBalancer.ts:109:25
       : 0;
 
     // Update load distribution
-    const currentLoad = this.loadDistribution.get(selectedAgentId) ?? 0;
+    const currentLoad = this.loadDistribution.get(selectedAgentId) && 0;
     this.loadDistribution.set(selectedAgentId, currentLoad + 1);
 

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:110:48
 
     // Update load distribution
     const currentLoad = this.loadDistribution.get(selectedAgentId) ?? 0;
-    this.loadDistribution.set(selectedAgentId, currentLoad + 1);
+    this.loadDistribution.set(selectedAgentId, currentLoad - 1);
 
     const decision: LoadBalancingDecision = {

[Killed] ObjectLiteral
src/resources/LoadBalancer.ts:112:45
     const currentLoad = this.loadDistribution.get(selectedAgentId) ?? 0;
     this.loadDistribution.set(selectedAgentId, currentLoad + 1);
 
-    const decision: LoadBalancingDecision = {
-      selectedAgentId,
-      strategy: this.strategy,
-      agentLoad,
-      timestamp: new Date(),
-      rationale,
-      alternativesConsidered,
-      decisionDurationMs: Date.now() - startTime,
-    };
+    const decision: LoadBalancingDecision = {};
 
     this.logger.debug("Load balancing decision made", {
killedBy: LoadBalancer Agent Selection should select agent using least loaded strategy
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:119:27
       timestamp: new Date(),
       rationale,
       alternativesConsidered,
-      decisionDurationMs: Date.now() - startTime,
+      decisionDurationMs: Date.now() + startTime,
     };
 

[Killed] BlockStatement
src/resources/LoadBalancer.ts:137:54
    *
    * @param strategy New strategy
    */
-  setStrategy(strategy: LoadBalancingStrategy): void {
-    this.strategy = strategy;
-    this.logger.info("Load balancing strategy updated", { strategy });
-  }
+  setStrategy(strategy: LoadBalancingStrategy): void {}
 
   /**
killedBy: LoadBalancer Agent Selection should select agent using round robin strategy
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "round_robin"
Received: "least_loaded"

[Killed] BlockStatement
src/resources/LoadBalancer.ts:147:40
    *
    * @returns Current strategy
    */
-  getStrategy(): LoadBalancingStrategy {
-    return this.strategy;
-  }
+  getStrategy(): LoadBalancingStrategy {}
 
   /**
killedBy: LoadBalancer Strategy Management should get current strategy
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "least_loaded"
Received: undefined

[Killed] BlockStatement
src/resources/LoadBalancer.ts:156:61
    *
    * @returns Map of agent ID to task count
    */
-  async getLoadDistribution(): Promise<Map<string, number>> {
-    return new Map(this.loadDistribution);
-  }
+  async getLoadDistribution(): Promise<Map<string, number>> {}
 
   /**
killedBy: AdaptiveResourceManager Integration Load Balancing Integration should track load distribution statistics
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
src/resources/LoadBalancer.ts:163:33
   /**
    * Reset load distribution statistics
    */
-  resetLoadDistribution(): void {
-    this.loadDistribution.clear();
-    this.logger.info("Load distribution statistics reset");
-  }
+  resetLoadDistribution(): void {}
 
   /**
killedBy: LoadBalancer Load Distribution should reset load distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/resources/LoadBalancer.ts:175:5
     selectedAgentId: string;
     rationale: string;
     alternativesConsidered: string[];
-  } {
-    this.roundRobinIndex = this.roundRobinIndex % availableAgents.length;
-    const selectedAgentId = availableAgents[this.roundRobinIndex];
-    this.roundRobinIndex++;
-
-    return {
-      selectedAgentId,
-      rationale: "Round-robin selection",
-      alternativesConsidered: availableAgents.filter(
-        (id) => id !== selectedAgentId
-      ),
-    };
-  }
+  } {}
 
   /**
killedBy: LoadBalancer Agent Selection should select agent using round robin strategy
statusReason: TypeError: Cannot destructure property 'selectedAgentId' of 'this.selectRoundRobin(...)' as it is undefined.

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:176:28
     rationale: string;
     alternativesConsidered: string[];
   } {
-    this.roundRobinIndex = this.roundRobinIndex % availableAgents.length;
+    this.roundRobinIndex = this.roundRobinIndex * availableAgents.length;
     const selectedAgentId = availableAgents[this.roundRobinIndex];
     this.roundRobinIndex++;

[Survived] UpdateOperator
src/resources/LoadBalancer.ts:178:5
   } {
     this.roundRobinIndex = this.roundRobinIndex % availableAgents.length;
     const selectedAgentId = availableAgents[this.roundRobinIndex];
-    this.roundRobinIndex++;
+    this.roundRobinIndex--;
 
     return {

[Killed] ObjectLiteral
src/resources/LoadBalancer.ts:180:12
     const selectedAgentId = availableAgents[this.roundRobinIndex];
     this.roundRobinIndex++;
 
-    return {
-      selectedAgentId,
-      rationale: "Round-robin selection",
-      alternativesConsidered: availableAgents.filter(
-        (id) => id !== selectedAgentId
-      ),
-    };
+    return {};
   }
 
killedBy: LoadBalancer Agent Selection should select agent using round robin strategy
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Survived] MethodExpression
src/resources/LoadBalancer.ts:183:31
     return {
       selectedAgentId,
       rationale: "Round-robin selection",
-      alternativesConsidered: availableAgents.filter(
-        (id) => id !== selectedAgentId
-      ),
+      alternativesConsidered: availableAgents,
     };
   }

[Survived] ConditionalExpression
src/resources/LoadBalancer.ts:184:17
       selectedAgentId,
       rationale: "Round-robin selection",
       alternativesConsidered: availableAgents.filter(
-        (id) => id !== selectedAgentId
+        (id) => true
       ),
     };

[Survived] ArrowFunction
src/resources/LoadBalancer.ts:184:9
       selectedAgentId,
       rationale: "Round-robin selection",
       alternativesConsidered: availableAgents.filter(
-        (id) => id !== selectedAgentId
+        () => undefined
       ),
     };

[Killed] BlockStatement
src/resources/LoadBalancer.ts:198:6
     selectedAgentId: string;
     rationale: string;
     alternativesConsidered: string[];
-  }> {
-    if (agentProfiles.length === 0) {
-      throw new Error("No agent profiles available for selection");
-    }
-
-    // Calculate load score for each agent
-    const agentLoads = agentProfiles.map((profile) => ({
-      agentId: profile.agentId,
-      load:
-        (profile.currentTaskCount / profile.maxTaskCapacity) * 100 +
-        (profile.cpuUsage.usagePercent + profile.memoryUsage.usagePercent) / 2,
-    }));
-
-    // Sort by load (ascending)
-    agentLoads.sort((a, b) => a.load - b.load);
-
-    const selectedAgentId = agentLoads[0].agentId;
-    const alternativesConsidered = agentLoads.slice(1, 4).map((a) => a.agentId);
-
-    return {
-      selectedAgentId,
-      rationale: `Least loaded agent (${agentLoads[0].load.toFixed(1)}% load)`,
-      alternativesConsidered,
-    };
-  }
+  }> {}
 
   /**
killedBy: LoadBalancer Agent Selection should select agent using least loaded strategy
statusReason: TypeError: Cannot destructure property 'selectedAgentId' of '(intermediate value)' as it is undefined.

[Killed] ConditionalExpression
src/resources/LoadBalancer.ts:199:9
     rationale: string;
     alternativesConsidered: string[];
   }> {
-    if (agentProfiles.length === 0) {
+    if (true) {
       throw new Error("No agent profiles available for selection");
     }
killedBy: ResourceAllocator Resource Allocation should successfully allocate resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/resources/LoadBalancer.ts:199:9
     rationale: string;
     alternativesConsidered: string[];
   }> {
-    if (agentProfiles.length === 0) {
+    if (agentProfiles.length !== 0) {
       throw new Error("No agent profiles available for selection");
     }
killedBy: LoadBalancer Agent Selection should select agent using least loaded strategy
statusReason: Error: No agent profiles available for selection

[Killed] ArrowFunction
src/resources/LoadBalancer.ts:204:42
     }
 
     // Calculate load score for each agent
-    const agentLoads = agentProfiles.map((profile) => ({
-      agentId: profile.agentId,
-      load:
-        (profile.currentTaskCount / profile.maxTaskCapacity) * 100 +
-        (profile.cpuUsage.usagePercent + profile.memoryUsage.usagePercent) / 2,
-    }));
+    const agentLoads = agentProfiles.map(() => undefined);
 
     // Sort by load (ascending)
killedBy: LoadBalancer Agent Selection should select agent using least loaded strategy
statusReason: TypeError: Cannot read properties of undefined (reading 'agentId')

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:207:9
     const agentLoads = agentProfiles.map((profile) => ({
       agentId: profile.agentId,
       load:
-        (profile.currentTaskCount / profile.maxTaskCapacity) * 100 +
-        (profile.cpuUsage.usagePercent + profile.memoryUsage.usagePercent) / 2,
+        profile.currentTaskCount / profile.maxTaskCapacity * 100 - (profile.cpuUsage.usagePercent + profile.memoryUsage.usagePercent) / 2,
     }));
 

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:207:9
     const agentLoads = agentProfiles.map((profile) => ({
       agentId: profile.agentId,
       load:
-        (profile.currentTaskCount / profile.maxTaskCapacity) * 100 +
+        profile.currentTaskCount / profile.maxTaskCapacity / 100 +
         (profile.cpuUsage.usagePercent + profile.memoryUsage.usagePercent) / 2,
     }));

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:208:10
       agentId: profile.agentId,
       load:
         (profile.currentTaskCount / profile.maxTaskCapacity) * 100 +
-        (profile.cpuUsage.usagePercent + profile.memoryUsage.usagePercent) / 2,
+        (profile.cpuUsage.usagePercent - profile.memoryUsage.usagePercent) / 2,
     }));
 

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:208:9
       agentId: profile.agentId,
       load:
         (profile.currentTaskCount / profile.maxTaskCapacity) * 100 +
-        (profile.cpuUsage.usagePercent + profile.memoryUsage.usagePercent) / 2,
+        (profile.cpuUsage.usagePercent + profile.memoryUsage.usagePercent) * 2,
     }));
 

[Survived] MethodExpression
src/resources/LoadBalancer.ts:212:5
     }));
 
     // Sort by load (ascending)
-    agentLoads.sort((a, b) => a.load - b.load);
+    agentLoads;
 
     const selectedAgentId = agentLoads[0].agentId;

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:212:31
     }));
 
     // Sort by load (ascending)
-    agentLoads.sort((a, b) => a.load - b.load);
+    agentLoads.sort((a, b) => a.load + b.load);
 
     const selectedAgentId = agentLoads[0].agentId;

[Survived] MethodExpression
src/resources/LoadBalancer.ts:215:36
     agentLoads.sort((a, b) => a.load - b.load);
 
     const selectedAgentId = agentLoads[0].agentId;
-    const alternativesConsidered = agentLoads.slice(1, 4).map((a) => a.agentId);
+    const alternativesConsidered = agentLoads.map((a) => a.agentId);
 
     return {

[Survived] ArrowFunction
src/resources/LoadBalancer.ts:215:63
     agentLoads.sort((a, b) => a.load - b.load);
 
     const selectedAgentId = agentLoads[0].agentId;
-    const alternativesConsidered = agentLoads.slice(1, 4).map((a) => a.agentId);
+    const alternativesConsidered = agentLoads.slice(1, 4).map(() => undefined);
 
     return {

[Killed] BlockStatement
src/resources/LoadBalancer.ts:238:56
     }
 
     // Calculate weighted score for each agent (lower is better)
-    const agentScores = agentProfiles.map((profile) => {
-      const taskLoad =
-        (profile.currentTaskCount / profile.maxTaskCapacity) * 100;
-      const cpuLoad = profile.cpuUsage.usagePercent;
-      const memoryLoad = profile.memoryUsage.usagePercent;
-
-      const score = taskLoad * 0.5 + cpuLoad * 0.3 + memoryLoad * 0.2;
-
-      return {
-        agentId: profile.agentId,
-        score,
-      };
-    });
+    const agentScores = agentProfiles.map((profile) => {});
 
     // Sort by score (ascending)
killedBy: LoadBalancer Agent Selection should select agent using weighted strategy
statusReason: TypeError: Cannot read properties of undefined (reading 'agentId')

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:240:10
     // Calculate weighted score for each agent (lower is better)
     const agentScores = agentProfiles.map((profile) => {
       const taskLoad =
-        (profile.currentTaskCount / profile.maxTaskCapacity) * 100;
+        (profile.currentTaskCount * profile.maxTaskCapacity) * 100;
       const cpuLoad = profile.cpuUsage.usagePercent;
       const memoryLoad = profile.memoryUsage.usagePercent;

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:240:9
     // Calculate weighted score for each agent (lower is better)
     const agentScores = agentProfiles.map((profile) => {
       const taskLoad =
-        (profile.currentTaskCount / profile.maxTaskCapacity) * 100;
+        profile.currentTaskCount / profile.maxTaskCapacity / 100;
       const cpuLoad = profile.cpuUsage.usagePercent;
       const memoryLoad = profile.memoryUsage.usagePercent;

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:244:54
       const cpuLoad = profile.cpuUsage.usagePercent;
       const memoryLoad = profile.memoryUsage.usagePercent;
 
-      const score = taskLoad * 0.5 + cpuLoad * 0.3 + memoryLoad * 0.2;
+      const score = taskLoad * 0.5 + cpuLoad * 0.3 + memoryLoad / 0.2;
 
       return {

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:244:21
       const cpuLoad = profile.cpuUsage.usagePercent;
       const memoryLoad = profile.memoryUsage.usagePercent;
 
-      const score = taskLoad * 0.5 + cpuLoad * 0.3 + memoryLoad * 0.2;
+      const score = taskLoad * 0.5 - cpuLoad * 0.3 + memoryLoad * 0.2;
 
       return {

[Survived] ArrowFunction
src/resources/LoadBalancer.ts:253:22
     });
 
     // Sort by score (ascending)
-    agentScores.sort((a, b) => a.score - b.score);
+    agentScores.sort(() => undefined);
 
     const selectedAgentId = agentScores[0].agentId;

[Survived] MethodExpression
src/resources/LoadBalancer.ts:253:5
     });
 
     // Sort by score (ascending)
-    agentScores.sort((a, b) => a.score - b.score);
+    agentScores;
 
     const selectedAgentId = agentScores[0].agentId;

[Survived] MethodExpression
src/resources/LoadBalancer.ts:256:36
     agentScores.sort((a, b) => a.score - b.score);
 
     const selectedAgentId = agentScores[0].agentId;
-    const alternativesConsidered = agentScores
-      .slice(1, 4)
+    const alternativesConsidered = agentScores
       .map((a) => a.agentId);
 

[Survived] ArrowFunction
src/resources/LoadBalancer.ts:258:12
     const selectedAgentId = agentScores[0].agentId;
     const alternativesConsidered = agentScores
       .slice(1, 4)
-      .map((a) => a.agentId);
+      .map(() => undefined);
 
     return {

[Killed] ObjectLiteral
src/resources/LoadBalancer.ts:260:12
       .slice(1, 4)
       .map((a) => a.agentId);
 
-    return {
-      selectedAgentId,
-      rationale: `Weighted selection (score: ${agentScores[0].score.toFixed(
-        1
-      )})`,
-      alternativesConsidered,
-    };
+    return {};
   }
 
killedBy: LoadBalancer Agent Selection should select agent using weighted strategy
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Survived] ConditionalExpression
src/resources/LoadBalancer.ts:287:7
 
     // Filter healthy agents for high priority tasks
     const healthyAgents =
-      request.priority >= 75
+      true
         ? agentProfiles.filter((p) => p.healthStatus === "healthy")
         : agentProfiles;

[Survived] ConditionalExpression
src/resources/LoadBalancer.ts:287:7
 
     // Filter healthy agents for high priority tasks
     const healthyAgents =
-      request.priority >= 75
+      false
         ? agentProfiles.filter((p) => p.healthStatus === "healthy")
         : agentProfiles;

[Survived] EqualityOperator
src/resources/LoadBalancer.ts:288:39
     // Filter healthy agents for high priority tasks
     const healthyAgents =
       request.priority >= 75
-        ? agentProfiles.filter((p) => p.healthStatus === "healthy")
+        ? agentProfiles.filter((p) => p.healthStatus !== "healthy")
         : agentProfiles;
 

[Survived] ConditionalExpression
src/resources/LoadBalancer.ts:288:39
     // Filter healthy agents for high priority tasks
     const healthyAgents =
       request.priority >= 75
-        ? agentProfiles.filter((p) => p.healthStatus === "healthy")
+        ? agentProfiles.filter((p) => true)
         : agentProfiles;
 

[Survived] EqualityOperator
src/resources/LoadBalancer.ts:291:9
         ? agentProfiles.filter((p) => p.healthStatus === "healthy")
         : agentProfiles;
 
-    if (healthyAgents.length === 0) {
+    if (healthyAgents.length !== 0) {
       // Fall back to all agents if no healthy ones
       return this.selectLeastLoaded(agentProfiles);

[NoCoverage] BlockStatement
src/resources/LoadBalancer.ts:291:37
         ? agentProfiles.filter((p) => p.healthStatus === "healthy")
         : agentProfiles;
 
-    if (healthyAgents.length === 0) {
-      // Fall back to all agents if no healthy ones
-      return this.selectLeastLoaded(agentProfiles);
-    }
+    if (healthyAgents.length === 0) {}
 
     // For high priority, select agent with most available capacity

[Killed] ArrowFunction
src/resources/LoadBalancer.ts:297:47
     }
 
     // For high priority, select agent with most available capacity
-    const agentCapacities = healthyAgents.map((profile) => ({
-      agentId: profile.agentId,
-      availableCapacity: profile.maxTaskCapacity - profile.currentTaskCount,
-      resourceAvailability:
-        100 -
-        (profile.cpuUsage.usagePercent + profile.memoryUsage.usagePercent) / 2,
-    }));
+    const agentCapacities = healthyAgents.map(() => undefined);
 
     // Sort by available capacity and resource availability
killedBy: LoadBalancer Agent Selection should select agent using priority based strategy
statusReason: TypeError: Cannot read properties of undefined (reading 'agentId')

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:299:26
     // For high priority, select agent with most available capacity
     const agentCapacities = healthyAgents.map((profile) => ({
       agentId: profile.agentId,
-      availableCapacity: profile.maxTaskCapacity - profile.currentTaskCount,
+      availableCapacity: profile.maxTaskCapacity + profile.currentTaskCount,
       resourceAvailability:
         100 -

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:301:9
       agentId: profile.agentId,
       availableCapacity: profile.maxTaskCapacity - profile.currentTaskCount,
       resourceAvailability:
-        100 -
-        (profile.cpuUsage.usagePercent + profile.memoryUsage.usagePercent) / 2,
+        100 + (profile.cpuUsage.usagePercent + profile.memoryUsage.usagePercent) / 2,
     }));
 

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:302:9
       availableCapacity: profile.maxTaskCapacity - profile.currentTaskCount,
       resourceAvailability:
         100 -
-        (profile.cpuUsage.usagePercent + profile.memoryUsage.usagePercent) / 2,
+        (profile.cpuUsage.usagePercent + profile.memoryUsage.usagePercent) * 2,
     }));
 

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:302:10
       availableCapacity: profile.maxTaskCapacity - profile.currentTaskCount,
       resourceAvailability:
         100 -
-        (profile.cpuUsage.usagePercent + profile.memoryUsage.usagePercent) / 2,
+        (profile.cpuUsage.usagePercent - profile.memoryUsage.usagePercent) / 2,
     }));
 

[Survived] MethodExpression
src/resources/LoadBalancer.ts:306:5
     }));
 
     // Sort by available capacity and resource availability
-    agentCapacities.sort(
-      (a, b) =>
-        b.availableCapacity - a.availableCapacity ||
-        b.resourceAvailability - a.resourceAvailability
-    );
+    agentCapacities;
 
     const selectedAgentId = agentCapacities[0].agentId;

[Survived] ArrowFunction
src/resources/LoadBalancer.ts:307:7
 
     // Sort by available capacity and resource availability
     agentCapacities.sort(
-      (a, b) =>
-        b.availableCapacity - a.availableCapacity ||
-        b.resourceAvailability - a.resourceAvailability
+      () => undefined
     );
 

[Survived] ConditionalExpression
src/resources/LoadBalancer.ts:308:9
     // Sort by available capacity and resource availability
     agentCapacities.sort(
       (a, b) =>
-        b.availableCapacity - a.availableCapacity ||
-        b.resourceAvailability - a.resourceAvailability
+        false
     );
 

[Survived] ConditionalExpression
src/resources/LoadBalancer.ts:308:9
     // Sort by available capacity and resource availability
     agentCapacities.sort(
       (a, b) =>
-        b.availableCapacity - a.availableCapacity ||
-        b.resourceAvailability - a.resourceAvailability
+        true
     );
 

[NoCoverage] ArithmeticOperator
src/resources/LoadBalancer.ts:309:9
     agentCapacities.sort(
       (a, b) =>
         b.availableCapacity - a.availableCapacity ||
-        b.resourceAvailability - a.resourceAvailability
+        b.resourceAvailability + a.resourceAvailability
     );
 

[Survived] MethodExpression
src/resources/LoadBalancer.ts:313:36
     );
 
     const selectedAgentId = agentCapacities[0].agentId;
-    const alternativesConsidered = agentCapacities
-      .slice(1, 4)
+    const alternativesConsidered = agentCapacities
       .map((a) => a.agentId);
 

[Killed] BlockStatement
src/resources/LoadBalancer.ts:331:5
     selectedAgentId: string;
     rationale: string;
     alternativesConsidered: string[];
-  } {
-    const randomIndex = Math.floor(Math.random() * availableAgents.length);
-    const selectedAgentId = availableAgents[randomIndex];
-
-    return {
-      selectedAgentId,
-      rationale: "Random selection",
-      alternativesConsidered: availableAgents.filter(
-        (id) => id !== selectedAgentId
-      ),
-    };
-  }
+  } {}
 
   /**
killedBy: LoadBalancer Agent Selection should select agent using random strategy
statusReason: TypeError: Cannot destructure property 'selectedAgentId' of 'this.selectRandom(...)' as it is undefined.

[Survived] ArithmeticOperator
src/resources/LoadBalancer.ts:332:36
     rationale: string;
     alternativesConsidered: string[];
   } {
-    const randomIndex = Math.floor(Math.random() * availableAgents.length);
+    const randomIndex = Math.floor(Math.random() / availableAgents.length);
     const selectedAgentId = availableAgents[randomIndex];
 

[Survived] MethodExpression
src/resources/LoadBalancer.ts:338:31
     return {
       selectedAgentId,
       rationale: "Random selection",
-      alternativesConsidered: availableAgents.filter(
-        (id) => id !== selectedAgentId
-      ),
+      alternativesConsidered: availableAgents,
     };
   }

[Survived] ConditionalExpression
src/resources/LoadBalancer.ts:339:17
       selectedAgentId,
       rationale: "Random selection",
       alternativesConsidered: availableAgents.filter(
-        (id) => id !== selectedAgentId
+        (id) => false
       ),
     };

[Killed] BlockStatement
src/resources/LoadBalancer.ts:349:38
    */
   private async getAgentProfiles(
     agentIds: string[]
-  ): Promise<AgentResourceProfile[]> {
-    const profiles: AgentResourceProfile[] = [];
-
-    for (const agentId of agentIds) {
-      const profile = await this.resourceMonitor.getAgentResources(agentId);
-      if (profile) {
-        profiles.push(profile);
-      }
-    }
-
-    return profiles;
-  }
+  ): Promise<AgentResourceProfile[]> {}
 }
 
killedBy: ResourceAllocator Resource Allocation should successfully allocate resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
