[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:95:23
  * Default security configuration
  */
 const DEFAULT_SECURITY_CONFIG: SecurityConfig = {
-  enableAuditLogging: true,
+  enableAuditLogging: false,
   enableInputValidation: true,
   enableAuthorization: true,
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Authorization Checks should log authorization failures
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BooleanLiteral
src/security/AgentRegistrySecurity.ts:96:26
  */
 const DEFAULT_SECURITY_CONFIG: SecurityConfig = {
   enableAuditLogging: true,
-  enableInputValidation: true,
+  enableInputValidation: false,
   enableAuthorization: true,
   maxAuditEvents: 10000,

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:97:24
 const DEFAULT_SECURITY_CONFIG: SecurityConfig = {
   enableAuditLogging: true,
   enableInputValidation: true,
-  enableAuthorization: true,
+  enableAuthorization: false,
   maxAuditEvents: 10000,
   auditRetentionDays: 90,
killedBy: Task Routing Manager (ARBITER-002) A1: Route to highest-scoring agent within 50ms should route TypeScript task to highest UCB scoring agent within 50ms
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "agent-1"
Received: "agent-4"

[Killed] LogicalOperator
src/security/AgentRegistrySecurity.ts:105:5
 
   // JWT Configuration
   jwtSecret:
-    process.env.JWT_SECRET || "default-jwt-secret-change-in-production",
+    process.env.JWT_SECRET && "default-jwt-secret-change-in-production",
   jwtIssuer: "agent-agency",
   jwtAudience: ["agent-registry", "arbiter-orchestrator"],
killedBy: Task Routing Manager (ARBITER-002) A2: 90% probability of selecting proven performer should exploit high-performing agent majority of time with epsilon=0.1
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 1
Received:   1

[Survived] ConditionalExpression
src/security/AgentRegistrySecurity.ts:105:5
 
   // JWT Configuration
   jwtSecret:
-    process.env.JWT_SECRET || "default-jwt-secret-change-in-production",
+    false,
   jwtIssuer: "agent-agency",
   jwtAudience: ["agent-registry", "arbiter-orchestrator"],

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:109:24
   jwtIssuer: "agent-agency",
   jwtAudience: ["agent-registry", "arbiter-orchestrator"],
   jwtExpirationTime: "24h",
-  enableJwtValidation: true,
+  enableJwtValidation: false,
 };
 
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Configuration and Edge Cases should handle disabled authorization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:142:21
   async authenticate(token: string): Promise<SecurityContext | null> {
     try {
       // Validate token format
-      if (!token || token.trim().length === 0) {
+      if (!token || token.trim().length !== 0) {
         await this.logAuditEvent({
           id: this.generateId(),
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:142:11
   async authenticate(token: string): Promise<SecurityContext | null> {
     try {
       // Validate token format
-      if (!token || token.trim().length === 0) {
+      if (false) {
         await this.logAuditEvent({
           id: this.generateId(),
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should reject empty token
statusReason: Error: expect(received).toBeNull()

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:162:11
       }
 
       // Check if JWT validation is enabled
-      if (!this.config.enableJwtValidation) {
+      if (false) {
         // Fallback to mock authentication for development
         console.warn("JWT validation disabled, using mock authentication");
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should authenticate valid token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:162:45
       }
 
       // Check if JWT validation is enabled
-      if (!this.config.enableJwtValidation) {
-        // Fallback to mock authentication for development
-        console.warn("JWT validation disabled, using mock authentication");
-        return this.createMockSecurityContext(token);
-      }
+      if (!this.config.enableJwtValidation) {}
 
       // Validate JWT token
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should authenticate valid token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ObjectLiteral
src/security/AgentRegistrySecurity.ts:172:40
       const decoded = await this.validateJwtToken(token);
 
       // Create security context from JWT payload
-      const context: SecurityContext = {
-        agentId: decoded.agentId || decoded.sub || "unknown-agent",
-        tenantId: decoded.tenantId || decoded.tid || "default-tenant",
-        userId: decoded.userId || decoded.sub || decoded.uid || "unknown-user",
-        roles: decoded.roles || ["agent-registry-user"],
-        permissions: decoded.permissions || [
-          "agent:read",
-          "agent:create",
-          "agent:update",
-        ],
-        sessionId: this.generateId(),
-        securityLevel: SecurityLevel.INTERNAL,
-        authenticatedAt: new Date(),
-        expiresAt: new Date(Date.now() + 3600000), // 1 hour
-        metadata: {
-          ipAddress: "unknown",
-          userAgent: "unknown",
-          source: "jwt",
-        },
-        ipAddress: "unknown",
-        userAgent: "unknown",
-      };
+      const context: SecurityContext = {};
 
       // Validate roles and permissions
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:173:18
 
       // Create security context from JWT payload
       const context: SecurityContext = {
-        agentId: decoded.agentId || decoded.sub || "unknown-agent",
+        agentId: false,
         tenantId: decoded.tenantId || decoded.tid || "default-tenant",
         userId: decoded.userId || decoded.sub || decoded.uid || "unknown-user",
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Survived] ConditionalExpression
src/security/AgentRegistrySecurity.ts:173:18
 
       // Create security context from JWT payload
       const context: SecurityContext = {
-        agentId: decoded.agentId || decoded.sub || "unknown-agent",
+        agentId: true,
         tenantId: decoded.tenantId || decoded.tid || "default-tenant",
         userId: decoded.userId || decoded.sub || decoded.uid || "unknown-user",

[Killed] LogicalOperator
src/security/AgentRegistrySecurity.ts:174:19
       // Create security context from JWT payload
       const context: SecurityContext = {
         agentId: decoded.agentId || decoded.sub || "unknown-agent",
-        tenantId: decoded.tenantId || decoded.tid || "default-tenant",
+        tenantId: decoded.tenantId && decoded.tid || "default-tenant",
         userId: decoded.userId || decoded.sub || decoded.uid || "unknown-user",
         roles: decoded.roles || ["agent-registry-user"],
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "tenant-abc"
Received: "default-tenant"

[Killed] LogicalOperator
src/security/AgentRegistrySecurity.ts:174:19
       // Create security context from JWT payload
       const context: SecurityContext = {
         agentId: decoded.agentId || decoded.sub || "unknown-agent",
-        tenantId: decoded.tenantId || decoded.tid || "default-tenant",
+        tenantId: (decoded.tenantId || decoded.tid) && "default-tenant",
         userId: decoded.userId || decoded.sub || decoded.uid || "unknown-user",
         roles: decoded.roles || ["agent-registry-user"],
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "tenant-abc"
Received: "default-tenant"

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:175:17
       const context: SecurityContext = {
         agentId: decoded.agentId || decoded.sub || "unknown-agent",
         tenantId: decoded.tenantId || decoded.tid || "default-tenant",
-        userId: decoded.userId || decoded.sub || decoded.uid || "unknown-user",
+        userId: false,
         roles: decoded.roles || ["agent-registry-user"],
         permissions: decoded.permissions || [
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:175:17
       const context: SecurityContext = {
         agentId: decoded.agentId || decoded.sub || "unknown-agent",
         tenantId: decoded.tenantId || decoded.tid || "default-tenant",
-        userId: decoded.userId || decoded.sub || decoded.uid || "unknown-user",
+        userId: false || "unknown-user",
         roles: decoded.roles || ["agent-registry-user"],
         permissions: decoded.permissions || [
killedBy: AgentRegistrySecurity JWT Token Validation should extract user ID from JWT token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-456"
Received: "unknown-user"

[Survived] ConditionalExpression
src/security/AgentRegistrySecurity.ts:176:16
         agentId: decoded.agentId || decoded.sub || "unknown-agent",
         tenantId: decoded.tenantId || decoded.tid || "default-tenant",
         userId: decoded.userId || decoded.sub || decoded.uid || "unknown-user",
-        roles: decoded.roles || ["agent-registry-user"],
+        roles: true,
         permissions: decoded.permissions || [
           "agent:read",

[Survived] ConditionalExpression
src/security/AgentRegistrySecurity.ts:176:16
         agentId: decoded.agentId || decoded.sub || "unknown-agent",
         tenantId: decoded.tenantId || decoded.tid || "default-tenant",
         userId: decoded.userId || decoded.sub || decoded.uid || "unknown-user",
-        roles: decoded.roles || ["agent-registry-user"],
+        roles: false,
         permissions: decoded.permissions || [
           "agent:read",

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:177:22
         tenantId: decoded.tenantId || decoded.tid || "default-tenant",
         userId: decoded.userId || decoded.sub || decoded.uid || "unknown-user",
         roles: decoded.roles || ["agent-registry-user"],
-        permissions: decoded.permissions || [
-          "agent:read",
-          "agent:create",
-          "agent:update",
-        ],
+        permissions: true,
         sessionId: this.generateId(),
         securityLevel: SecurityLevel.INTERNAL,
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:177:22
         tenantId: decoded.tenantId || decoded.tid || "default-tenant",
         userId: decoded.userId || decoded.sub || decoded.uid || "unknown-user",
         roles: decoded.roles || ["agent-registry-user"],
-        permissions: decoded.permissions || [
-          "agent:read",
-          "agent:create",
-          "agent:update",
-        ],
+        permissions: false,
         sessionId: this.generateId(),
         securityLevel: SecurityLevel.INTERNAL,
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ArithmeticOperator
src/security/AgentRegistrySecurity.ts:185:29
         sessionId: this.generateId(),
         securityLevel: SecurityLevel.INTERNAL,
         authenticatedAt: new Date(),
-        expiresAt: new Date(Date.now() + 3600000), // 1 hour
+        expiresAt: new Date(Date.now() - 3600000), // 1 hour
         metadata: {
           ipAddress: "unknown",
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:196:11
       };
 
       // Validate roles and permissions
-      if (!this.validateSecurityContext(context)) {
+      if (this.validateSecurityContext(context)) {
         await this.logAuditEvent({
           id: this.generateId(),
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:196:11
       };
 
       // Validate roles and permissions
-      if (!this.validateSecurityContext(context)) {
+      if (true) {
         await this.logAuditEvent({
           id: this.generateId(),
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[NoCoverage] ObjectLiteral
src/security/AgentRegistrySecurity.ts:197:34
 
       // Validate roles and permissions
       if (!this.validateSecurityContext(context)) {
-        await this.logAuditEvent({
-          id: this.generateId(),
-          timestamp: new Date(),
-          eventType: AuditEventType.AUTHENTICATION_FAILURE,
-          actor: {
-            tenantId: context.tenantId,
-            userId: context.userId,
-            sessionId: context.sessionId,
-          },
-          resource: { type: "agent", id: "unknown" },
-          action: AuditAction.READ,
-          details: { reason: "Invalid security context" },
-          result: "failure",
-          errorMessage: "Invalid roles or permissions in token",
-        });
+        await this.logAuditEvent({});
         return null;
       }

[Survived] ObjectLiteral
src/security/AgentRegistrySecurity.ts:216:32
       }
 
       // Log successful authentication
-      await this.logAuditEvent({
-        id: this.generateId(),
-        timestamp: new Date(),
-        eventType: AuditEventType.AUTHENTICATION_SUCCESS,
-        actor: {
-          tenantId: context.tenantId,
-          userId: context.userId,
-          sessionId: context.sessionId,
-        },
-        resource: { type: "agent", id: "unknown" },
-        action: AuditAction.READ,
-        details: { tokenType: "jwt" },
-        result: "success",
-      });
+      await this.logAuditEvent({});
 
       return context;

[Survived] ObjectLiteral
src/security/AgentRegistrySecurity.ts:220:16
         id: this.generateId(),
         timestamp: new Date(),
         eventType: AuditEventType.AUTHENTICATION_SUCCESS,
-        actor: {
-          tenantId: context.tenantId,
-          userId: context.userId,
-          sessionId: context.sessionId,
-        },
+        actor: {},
         resource: { type: "agent", id: "unknown" },
         action: AuditAction.READ,

[Survived] ObjectLiteral
src/security/AgentRegistrySecurity.ts:225:19
           userId: context.userId,
           sessionId: context.sessionId,
         },
-        resource: { type: "agent", id: "unknown" },
+        resource: {},
         action: AuditAction.READ,
         details: { tokenType: "jwt" },

[Survived] ObjectLiteral
src/security/AgentRegistrySecurity.ts:227:18
         },
         resource: { type: "agent", id: "unknown" },
         action: AuditAction.READ,
-        details: { tokenType: "jwt" },
+        details: {},
         result: "success",
       });

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:232:21
       });
 
       return context;
-    } catch (error) {
-      // Log authentication failure
-      await this.logAuditEvent({
-        id: this.generateId(),
-        timestamp: new Date(),
-        eventType: AuditEventType.AUTHENTICATION_FAILURE,
-        actor: {
-          tenantId: "unknown",
-          userId: "unknown",
-          sessionId: "unknown",
-        },
-        resource: { type: "agent", id: "unknown" },
-        action: AuditAction.READ,
-        details: { reason: "JWT validation failed" },
-        result: "failure",
-        errorMessage:
-          error instanceof Error
-            ? error.message
-            : "Unknown authentication error",
-      });
-
-      this.logger.error("Authentication failed:", error);
-      return null;
-    }
+    } catch (error) {}
   }
 
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Audit Logging should log authentication success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ObjectLiteral
src/security/AgentRegistrySecurity.ts:238:16
         id: this.generateId(),
         timestamp: new Date(),
         eventType: AuditEventType.AUTHENTICATION_FAILURE,
-        actor: {
-          tenantId: "unknown",
-          userId: "unknown",
-          sessionId: "unknown",
-        },
+        actor: {},
         resource: { type: "agent", id: "unknown" },
         action: AuditAction.READ,

[Survived] ObjectLiteral
src/security/AgentRegistrySecurity.ts:245:18
         },
         resource: { type: "agent", id: "unknown" },
         action: AuditAction.READ,
-        details: { reason: "JWT validation failed" },
+        details: {},
         result: "failure",
         errorMessage:

[Killed] OptionalChaining
src/security/AgentRegistrySecurity.ts:270:11
   ): Promise<boolean> {
     try {
       // Check if tenant is blocked
-      if (this.config.blockedUserIds?.includes(context.userId)) {
+      if (this.config.blockedUserIds.includes(context.userId)) {
         await this.logSecurityViolation(
           context,
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Multi-tenant Isolation should allow access to same tenant resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:270:65
   ): Promise<boolean> {
     try {
       // Check if tenant is blocked
-      if (this.config.blockedUserIds?.includes(context.userId)) {
-        await this.logSecurityViolation(
-          context,
-          action,
-          resourceType,
-          resourceId,
-          "User is blocked"
-        );
-        return false;
-      }
+      if (this.config.blockedUserIds?.includes(context.userId)) {}
 
       // Check tenant isolation - users can only access their own tenant's resources
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Authorization Checks should block blocked users
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:282:11
       }
 
       // Check tenant isolation - users can only access their own tenant's resources
-      if (resource && this.isCrossTenantAccess(context, resource)) {
+      if (true) {
         await this.logSecurityViolation(
           context,
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Multi-tenant Isolation should allow access to same tenant resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/security/AgentRegistrySecurity.ts:282:11
       }
 
       // Check tenant isolation - users can only access their own tenant's resources
-      if (resource && this.isCrossTenantAccess(context, resource)) {
+      if (resource || this.isCrossTenantAccess(context, resource)) {
         await this.logSecurityViolation(
           context,
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Multi-tenant Isolation should allow access to same tenant resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:294:11
       }
 
       // Check rate limiting
-      if (!this.checkRateLimit(context)) {
+      if (true) {
         await this.logSecurityViolation(
           context,
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Multi-tenant Isolation should allow access to same tenant resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:294:11
       }
 
       // Check rate limiting
-      if (!this.checkRateLimit(context)) {
+      if (this.checkRateLimit(context)) {
         await this.logSecurityViolation(
           context,
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Multi-tenant Isolation should allow access to same tenant resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:310:11
         action,
         resourceType
       );
-      if (!context.permissions.includes(requiredPermission)) {
+      if (context.permissions.includes(requiredPermission)) {
         await this.logAuthorizationFailure(
           context,
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Multi-tenant Isolation should allow access to same tenant resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:310:11
         action,
         resourceType
       );
-      if (!context.permissions.includes(requiredPermission)) {
+      if (false) {
         await this.logAuthorizationFailure(
           context,
killedBy: AgentRegistrySecurity Authorization should deny action without required permissions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:322:21
       }
 
       return true;
-    } catch (error) {
-      this.logger.error("Authorization failed:", error);
-      return false;
-    }
+    } catch (error) {}
   }
 
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Configuration and Edge Cases should handle disabled authorization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:324:14
       return true;
     } catch (error) {
       this.logger.error("Authorization failed:", error);
-      return false;
+      return true;
     }
   }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Configuration and Edge Cases should handle disabled authorization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] ObjectLiteral
src/security/AgentRegistrySecurity.ts:333:46
    */
   validateAgentData(data: Partial<AgentProfile>): ValidationResult {
     const errors: string[] = [];
-    const sanitized: Partial<AgentProfile> = { ...data };
+    const sanitized: Partial<AgentProfile> = {};
 
     // Validate required fields

[Killed] LogicalOperator
src/security/AgentRegistrySecurity.ts:336:9
     const sanitized: Partial<AgentProfile> = { ...data };
 
     // Validate required fields
-    if (!data.id || typeof data.id !== "string" || data.id.length === 0) {
+    if ((!data.id || typeof data.id !== "string") && data.id.length === 0) {
       errors.push("Agent ID is required and must be a non-empty string");
     } else if (data.id.length > 255) {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should reject missing agent ID
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:336:9
     const sanitized: Partial<AgentProfile> = { ...data };
 
     // Validate required fields
-    if (!data.id || typeof data.id !== "string" || data.id.length === 0) {
+    if (data.id || typeof data.id !== "string" || data.id.length === 0) {
       errors.push("Agent ID is required and must be a non-empty string");
     } else if (data.id.length > 255) {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:338:16
     // Validate required fields
     if (!data.id || typeof data.id !== "string" || data.id.length === 0) {
       errors.push("Agent ID is required and must be a non-empty string");
-    } else if (data.id.length > 255) {
+    } else if (data.id.length <= 255) {
       errors.push("Agent ID must be 255 characters or less");
     } else {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:338:16
     // Validate required fields
     if (!data.id || typeof data.id !== "string" || data.id.length === 0) {
       errors.push("Agent ID is required and must be a non-empty string");
-    } else if (data.id.length > 255) {
+    } else if (true) {
       errors.push("Agent ID must be 255 characters or less");
     } else {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:340:12
       errors.push("Agent ID is required and must be a non-empty string");
     } else if (data.id.length > 255) {
       errors.push("Agent ID must be 255 characters or less");
-    } else {
-      // Sanitize ID - only allow alphanumeric, dash, underscore
-      sanitized.id = data.id.replace(/[^a-zA-Z0-9_-]/g, "");
-    }
+    } else {}
 
     if (!data.name || typeof data.name !== "string" || data.name.length === 0) {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should reject agent ID with special characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "agent"
Received: "agent@#$%"

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:345:9
       sanitized.id = data.id.replace(/[^a-zA-Z0-9_-]/g, "");
     }
 
-    if (!data.name || typeof data.name !== "string" || data.name.length === 0) {
+    if (false) {
       errors.push("Agent name is required and must be a non-empty string");
     } else if (data.name.length > 255) {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should reject missing agent name
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:345:9
       sanitized.id = data.id.replace(/[^a-zA-Z0-9_-]/g, "");
     }
 
-    if (!data.name || typeof data.name !== "string" || data.name.length === 0) {
+    if (false || data.name.length === 0) {
       errors.push("Agent name is required and must be a non-empty string");
     } else if (data.name.length > 255) {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should reject missing agent name
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:347:16
 
     if (!data.name || typeof data.name !== "string" || data.name.length === 0) {
       errors.push("Agent name is required and must be a non-empty string");
-    } else if (data.name.length > 255) {
+    } else if (data.name.length <= 255) {
       errors.push("Agent name must be 255 characters or less");
     }
killedBy: AgentRegistrySecurity Input Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:347:16
 
     if (!data.name || typeof data.name !== "string" || data.name.length === 0) {
       errors.push("Agent name is required and must be a non-empty string");
-    } else if (data.name.length > 255) {
+    } else if (true) {
       errors.push("Agent name must be 255 characters or less");
     }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
