[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:351:9
       errors.push("Agent name must be 255 characters or less");
     }
 
-    if (!data.modelFamily || typeof data.modelFamily !== "string") {
+    if (data.modelFamily || typeof data.modelFamily !== "string") {
       errors.push("Model family is required and must be a string");
     } else {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:351:9
       errors.push("Agent name must be 255 characters or less");
     }
 
-    if (!data.modelFamily || typeof data.modelFamily !== "string") {
+    if (true) {
       errors.push("Model family is required and must be a string");
     } else {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:353:12
 
     if (!data.modelFamily || typeof data.modelFamily !== "string") {
       errors.push("Model family is required and must be a string");
-    } else {
-      // Validate against allowed model families
-      const allowedFamilies = [
-        "gpt-4",
-        "claude-3",
-        "claude-3.5",
-        "gemini-pro",
-        "llama-3",
-        "mixtral",
-      ];
-      if (!allowedFamilies.includes(data.modelFamily)) {
-        errors.push(
-          `Model family must be one of: ${allowedFamilies.join(", ")}`
-        );
-      }
-    }
+    } else {}
 
     // Validate capabilities structure
killedBy: AgentRegistrySecurity Input Validation should reject invalid model family
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:363:11
         "llama-3",
         "mixtral",
       ];
-      if (!allowedFamilies.includes(data.modelFamily)) {
+      if (false) {
         errors.push(
           `Model family must be one of: ${allowedFamilies.join(", ")}`
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should reject invalid model family
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:363:11
         "llama-3",
         "mixtral",
       ];
-      if (!allowedFamilies.includes(data.modelFamily)) {
+      if (true) {
         errors.push(
           `Model family must be one of: ${allowedFamilies.join(", ")}`
killedBy: AgentRegistrySecurity Input Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:371:9
     }
 
     // Validate capabilities structure
-    if (data.capabilities) {
+    if (false) {
       if (typeof data.capabilities !== "object") {
         errors.push("Capabilities must be an object");
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate capabilities structure
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:371:9
     }
 
     // Validate capabilities structure
-    if (data.capabilities) {
+    if (true) {
       if (typeof data.capabilities !== "object") {
         errors.push("Capabilities must be an object");
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should reject agent ID with special characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:372:11
 
     // Validate capabilities structure
     if (data.capabilities) {
-      if (typeof data.capabilities !== "object") {
+      if (typeof data.capabilities === "object") {
         errors.push("Capabilities must be an object");
       } else {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:372:11
 
     // Validate capabilities structure
     if (data.capabilities) {
-      if (typeof data.capabilities !== "object") {
+      if (true) {
         errors.push("Capabilities must be an object");
       } else {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:376:13
         errors.push("Capabilities must be an object");
       } else {
         const caps = data.capabilities as any;
-        if (!Array.isArray(caps.taskTypes)) {
+        if (true) {
           errors.push("Capabilities.taskTypes must be an array");
         }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:376:13
         errors.push("Capabilities must be an object");
       } else {
         const caps = data.capabilities as any;
-        if (!Array.isArray(caps.taskTypes)) {
+        if (Array.isArray(caps.taskTypes)) {
           errors.push("Capabilities.taskTypes must be an array");
         }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:379:13
         if (!Array.isArray(caps.taskTypes)) {
           errors.push("Capabilities.taskTypes must be an array");
         }
-        if (!Array.isArray(caps.languages)) {
+        if (Array.isArray(caps.languages)) {
           errors.push("Capabilities.languages must be an array");
         }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:379:13
         if (!Array.isArray(caps.taskTypes)) {
           errors.push("Capabilities.taskTypes must be an array");
         }
-        if (!Array.isArray(caps.languages)) {
+        if (true) {
           errors.push("Capabilities.languages must be an array");
         }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:382:13
         if (!Array.isArray(caps.languages)) {
           errors.push("Capabilities.languages must be an array");
         }
-        if (!Array.isArray(caps.specializations)) {
+        if (true) {
           errors.push("Capabilities.specializations must be an array");
         }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:382:13
         if (!Array.isArray(caps.languages)) {
           errors.push("Capabilities.languages must be an array");
         }
-        if (!Array.isArray(caps.specializations)) {
+        if (Array.isArray(caps.specializations)) {
           errors.push("Capabilities.specializations must be an array");
         }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:387:29
         }
 
         // Validate task types
-        if (caps.taskTypes) {
-          const validTaskTypes = [
-            "code-editing",
-            "research",
-            "code-review",
-            "documentation",
-            "testing",
-            "debugging",
-            "refactoring",
-            "api-design",
-          ];
-          for (const taskType of caps.taskTypes) {
-            if (!validTaskTypes.includes(taskType)) {
-              errors.push(`Invalid task type: ${taskType}`);
-            }
-          }
-        }
+        if (caps.taskTypes) {}
 
         // Validate languages
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate task types
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:387:13
         }
 
         // Validate task types
-        if (caps.taskTypes) {
+        if (false) {
           const validTaskTypes = [
             "code-editing",
killedBy: AgentRegistrySecurity Input Validation should reject invalid task types
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:398:50
             "refactoring",
             "api-design",
           ];
-          for (const taskType of caps.taskTypes) {
-            if (!validTaskTypes.includes(taskType)) {
-              errors.push(`Invalid task type: ${taskType}`);
-            }
-          }
+          for (const taskType of caps.taskTypes) {}
         }
 
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate task types
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:399:53
             "api-design",
           ];
           for (const taskType of caps.taskTypes) {
-            if (!validTaskTypes.includes(taskType)) {
-              errors.push(`Invalid task type: ${taskType}`);
-            }
+            if (!validTaskTypes.includes(taskType)) {}
           }
         }
killedBy: AgentRegistrySecurity Input Validation should reject invalid task types
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:399:17
             "api-design",
           ];
           for (const taskType of caps.taskTypes) {
-            if (!validTaskTypes.includes(taskType)) {
+            if (true) {
               errors.push(`Invalid task type: ${taskType}`);
             }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:406:29
         }
 
         // Validate languages
-        if (caps.languages) {
-          const validLanguages = [
-            "TypeScript",
-            "JavaScript",
-            "Python",
-            "Rust",
-            "Go",
-            "Java",
-            "C++",
-            "C#",
-          ];
-          for (const language of caps.languages) {
-            if (!validLanguages.includes(language)) {
-              errors.push(`Invalid language: ${language}`);
-            }
-          }
-        }
+        if (caps.languages) {}
       }
     }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate languages
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:406:13
         }
 
         // Validate languages
-        if (caps.languages) {
+        if (false) {
           const validLanguages = [
             "TypeScript",
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate languages
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:417:50
             "C++",
             "C#",
           ];
-          for (const language of caps.languages) {
-            if (!validLanguages.includes(language)) {
-              errors.push(`Invalid language: ${language}`);
-            }
-          }
+          for (const language of caps.languages) {}
         }
       }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate languages
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:418:17
             "C#",
           ];
           for (const language of caps.languages) {
-            if (!validLanguages.includes(language)) {
+            if (validLanguages.includes(language)) {
               errors.push(`Invalid language: ${language}`);
             }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:418:17
             "C#",
           ];
           for (const language of caps.languages) {
-            if (!validLanguages.includes(language)) {
+            if (true) {
               errors.push(`Invalid language: ${language}`);
             }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:429:18
     return {
       valid: errors.length === 0,
       errors,
-      sanitized: errors.length === 0 ? sanitized : undefined,
+      sanitized: errors.length !== 0 ? sanitized : undefined,
     };
   }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:429:18
     return {
       valid: errors.length === 0,
       errors,
-      sanitized: errors.length === 0 ? sanitized : undefined,
+      sanitized: false ? sanitized : undefined,
     };
   }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Agent Data Validation should validate valid agent data
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:439:9
   validatePerformanceMetrics(metrics: any): ValidationResult {
     const errors: string[] = [];
 
-    if (typeof metrics.success !== "boolean") {
+    if (typeof metrics.success === "boolean") {
       errors.push("Success must be a boolean");
     }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Performance Metrics Validation should validate valid performance metrics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:439:9
   validatePerformanceMetrics(metrics: any): ValidationResult {
     const errors: string[] = [];
 
-    if (typeof metrics.success !== "boolean") {
+    if (false) {
       errors.push("Success must be a boolean");
     }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Performance Metrics Validation should reject invalid success value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:444:7
     }
 
     if (
-      typeof metrics.qualityScore !== "number" ||
-      metrics.qualityScore < 0 ||
-      metrics.qualityScore > 1
+      true
     ) {
       errors.push("Quality score must be a number between 0 and 1");
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Performance Metrics Validation should validate valid performance metrics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:444:7
     }
 
     if (
-      typeof metrics.qualityScore !== "number" ||
-      metrics.qualityScore < 0 ||
-      metrics.qualityScore > 1
+      false
     ) {
       errors.push("Quality score must be a number between 0 and 1");
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Performance Metrics Validation should reject invalid quality score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:445:7
 
     if (
       typeof metrics.qualityScore !== "number" ||
-      metrics.qualityScore < 0 ||
+      metrics.qualityScore >= 0 ||
       metrics.qualityScore > 1
     ) {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Performance Metrics Validation should validate valid performance metrics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
src/security/AgentRegistrySecurity.ts:445:7
 
     if (
       typeof metrics.qualityScore !== "number" ||
-      metrics.qualityScore < 0 ||
+      false ||
       metrics.qualityScore > 1
     ) {

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:446:7
     if (
       typeof metrics.qualityScore !== "number" ||
       metrics.qualityScore < 0 ||
-      metrics.qualityScore > 1
+      metrics.qualityScore <= 1
     ) {
       errors.push("Quality score must be a number between 0 and 1");
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Performance Metrics Validation should validate valid performance metrics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:446:7
     if (
       typeof metrics.qualityScore !== "number" ||
       metrics.qualityScore < 0 ||
-      metrics.qualityScore > 1
+      false
     ) {
       errors.push("Quality score must be a number between 0 and 1");
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Performance Metrics Validation should reject invalid quality score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:447:7
       typeof metrics.qualityScore !== "number" ||
       metrics.qualityScore < 0 ||
       metrics.qualityScore > 1
-    ) {
-      errors.push("Quality score must be a number between 0 and 1");
-    }
+    ) {}
 
     if (typeof metrics.latencyMs !== "number" || metrics.latencyMs < 0) {
killedBy: AgentRegistrySecurity Performance Metrics Validation should reject invalid quality score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:451:9
       errors.push("Quality score must be a number between 0 and 1");
     }
 
-    if (typeof metrics.latencyMs !== "number" || metrics.latencyMs < 0) {
+    if (false) {
       errors.push("Latency must be a non-negative number");
     }
killedBy: AgentRegistrySecurity Performance Metrics Validation should reject negative latency
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:451:9
       errors.push("Quality score must be a number between 0 and 1");
     }
 
-    if (typeof metrics.latencyMs !== "number" || metrics.latencyMs < 0) {
+    if (typeof metrics.latencyMs === "number" || metrics.latencyMs < 0) {
       errors.push("Latency must be a non-negative number");
     }
killedBy: AgentRegistrySecurity Performance Metrics Validation should validate valid performance metrics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:455:9
       errors.push("Latency must be a non-negative number");
     }
 
-    if (metrics.taskType && typeof metrics.taskType !== "string") {
+    if (false) {
       errors.push("Task type must be a string");
     }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Performance Metrics Validation should reject invalid task type
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:455:9
       errors.push("Latency must be a non-negative number");
     }
 
-    if (metrics.taskType && typeof metrics.taskType !== "string") {
+    if (true) {
       errors.push("Task type must be a string");
     }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Performance Metrics Validation should validate valid performance metrics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:459:71
       errors.push("Task type must be a string");
     }
 
-    if (metrics.tokensUsed && typeof metrics.tokensUsed !== "number") {
-      errors.push("Tokens used must be a number");
-    }
+    if (metrics.tokensUsed && typeof metrics.tokensUsed !== "number") {}
 
     return {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Performance Metrics Validation should reject invalid tokens used
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:459:31
       errors.push("Task type must be a string");
     }
 
-    if (metrics.tokensUsed && typeof metrics.tokensUsed !== "number") {
+    if (metrics.tokensUsed && typeof metrics.tokensUsed === "number") {
       errors.push("Tokens used must be a number");
     }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Input Validation Performance Metrics Validation should validate valid performance metrics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:473:9
    * Log audit event
    */
   async logAuditEvent(event: AuditEvent): Promise<void> {
-    if (!this.config.enableAuditLogging) return;
+    if (this.config.enableAuditLogging) return;
 
     try {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should reject empty token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:473:9
    * Log audit event
    */
   async logAuditEvent(event: AuditEvent): Promise<void> {
-    if (!this.config.enableAuditLogging) return;
+    if (true) return;
 
     try {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should reject empty token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:475:9
   async logAuditEvent(event: AuditEvent): Promise<void> {
     if (!this.config.enableAuditLogging) return;
 
-    try {
-      this.auditEvents.push(event);
-
-      // Maintain audit event limit
-      if (this.auditEvents.length > this.config.maxAuditEvents) {
-        this.auditEvents = this.auditEvents.slice(-this.config.maxAuditEvents);
-      }
-
-      // Log security violations immediately
-      if (event.eventType === AuditEventType.SECURITY_VIOLATION) {
-        this.logger.warn("Security violation detected:", {
-          actor: event.actor,
-          action: event.action,
-          resource: event.resource,
-          details: event.details,
-          ipAddress: event.ipAddress,
-        });
-      }
-
-      this.logger.debug("Audit event logged", {
-        eventType: event.eventType,
-        result: event.result,
-      });
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error("Failed to log audit event:", error);
     }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should reject empty token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:479:11
       this.auditEvents.push(event);
 
       // Maintain audit event limit
-      if (this.auditEvents.length > this.config.maxAuditEvents) {
+      if (this.auditEvents.length <= this.config.maxAuditEvents) {
         this.auditEvents = this.auditEvents.slice(-this.config.maxAuditEvents);
       }
killedBy: AgentRegistrySecurity Audit Logging should maintain audit event limits
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 3
Received:    5

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:479:65
       this.auditEvents.push(event);
 
       // Maintain audit event limit
-      if (this.auditEvents.length > this.config.maxAuditEvents) {
-        this.auditEvents = this.auditEvents.slice(-this.config.maxAuditEvents);
-      }
+      if (this.auditEvents.length > this.config.maxAuditEvents) {}
 
       // Log security violations immediately
killedBy: AgentRegistrySecurity Audit Logging should maintain audit event limits
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 3
Received:    5

[Killed] MethodExpression
src/security/AgentRegistrySecurity.ts:480:28
 
       // Maintain audit event limit
       if (this.auditEvents.length > this.config.maxAuditEvents) {
-        this.auditEvents = this.auditEvents.slice(-this.config.maxAuditEvents);
+        this.auditEvents = this.auditEvents;
       }
 
killedBy: AgentRegistrySecurity Audit Logging should maintain audit event limits
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 3
Received:    5

[Survived] UnaryOperator
src/security/AgentRegistrySecurity.ts:480:51
 
       // Maintain audit event limit
       if (this.auditEvents.length > this.config.maxAuditEvents) {
-        this.auditEvents = this.auditEvents.slice(-this.config.maxAuditEvents);
+        this.auditEvents = this.auditEvents.slice(+this.config.maxAuditEvents);
       }
 

[Survived] ConditionalExpression
src/security/AgentRegistrySecurity.ts:484:11
       }
 
       // Log security violations immediately
-      if (event.eventType === AuditEventType.SECURITY_VIOLATION) {
+      if (false) {
         this.logger.warn("Security violation detected:", {
           actor: event.actor,

[Survived] ConditionalExpression
src/security/AgentRegistrySecurity.ts:484:11
       }
 
       // Log security violations immediately
-      if (event.eventType === AuditEventType.SECURITY_VIOLATION) {
+      if (true) {
         this.logger.warn("Security violation detected:", {
           actor: event.actor,

[Survived] ObjectLiteral
src/security/AgentRegistrySecurity.ts:485:58
 
       // Log security violations immediately
       if (event.eventType === AuditEventType.SECURITY_VIOLATION) {
-        this.logger.warn("Security violation detected:", {
-          actor: event.actor,
-          action: event.action,
-          resource: event.resource,
-          details: event.details,
-          ipAddress: event.ipAddress,
-        });
+        this.logger.warn("Security violation detected:", {});
       }
 
