[Killed] ObjectLiteral
src/resources/ResourceAllocator.ts:47:29
   private loadBalancer: LoadBalancer;
   private activeAllocations: Map<string, AllocationRecord> = new Map();
   private rateLimitConfig: RateLimitConfig;
-  private allocationStats = {
-    totalRequests: 0,
-    successfulAllocations: 0,
-    failedAllocations: 0,
-    totalAllocationTimeMs: 0,
-  };
+  private allocationStats = {};
 
   constructor(
killedBy: ResourceAllocator Statistics should track allocation statistics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] BlockStatement
src/resources/ResourceAllocator.ts:57:5
   constructor(
     loadBalancer: LoadBalancer,
     rateLimitConfig?: Partial<RateLimitConfig>
-  ) {
-    this.logger = new Logger("ResourceAllocator");
-    this.loadBalancer = loadBalancer;
-    this.rateLimitConfig = {
-      maxRequests: 1000,
-      windowMs: 60000, // 1 minute
-      currentCount: 0,
-      windowStart: new Date(),
-      dynamicAdjustment: true,
-      ...rateLimitConfig,
-    };
-  }
+  ) {}
 
   /**
killedBy: ResourceAllocator Resource Allocation should successfully allocate resources
statusReason: TypeError: Cannot read properties of undefined (reading 'error')

[Survived] BooleanLiteral
src/resources/ResourceAllocator.ts:65:26
       windowMs: 60000, // 1 minute
       currentCount: 0,
       windowStart: new Date(),
-      dynamicAdjustment: true,
+      dynamicAdjustment: false,
       ...rateLimitConfig,
     };

[Killed] UpdateOperator
src/resources/ResourceAllocator.ts:80:5
     request: ResourceAllocationRequest
   ): Promise<ResourceAllocationResult> {
     const startTime = Date.now();
-    this.allocationStats.totalRequests++;
+    this.allocationStats.totalRequests--;
 
     try {
killedBy: ResourceAllocator Statistics should track allocation statistics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/resources/ResourceAllocator.ts:84:35
 
     try {
       // Check rate limit
-      if (!this.checkRateLimit()) {
-        return this.createFailureResult(
-          request,
-          "Rate limit exceeded",
-          startTime
-        );
-      }
+      if (!this.checkRateLimit()) {}
 
       // Check timeout
killedBy: ResourceAllocator Resource Allocation should handle rate limit exceeded
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/resources/ResourceAllocator.ts:84:11
 
     try {
       // Check rate limit
-      if (!this.checkRateLimit()) {
+      if (this.checkRateLimit()) {
         return this.createFailureResult(
           request,
killedBy: ResourceAllocator Resource Allocation should successfully allocate resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/resources/ResourceAllocator.ts:93:27
       }
 
       // Check timeout
-      const timeoutTime = request.requestedAt.getTime() + request.timeoutMs;
+      const timeoutTime = request.requestedAt.getTime() - request.timeoutMs;
       if (Date.now() > timeoutTime) {
         return this.createFailureResult(request, "Request timeout", startTime);
killedBy: ResourceAllocator Resource Allocation should successfully allocate resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/resources/ResourceAllocator.ts:94:11
 
       // Check timeout
       const timeoutTime = request.requestedAt.getTime() + request.timeoutMs;
-      if (Date.now() > timeoutTime) {
+      if (Date.now() <= timeoutTime) {
         return this.createFailureResult(request, "Request timeout", startTime);
       }
killedBy: ResourceAllocator Resource Allocation should successfully allocate resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/resources/ResourceAllocator.ts:94:11
 
       // Check timeout
       const timeoutTime = request.requestedAt.getTime() + request.timeoutMs;
-      if (Date.now() > timeoutTime) {
+      if (false) {
         return this.createFailureResult(request, "Request timeout", startTime);
       }
killedBy: ResourceAllocator Resource Allocation should handle request timeout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/resources/ResourceAllocator.ts:100:11
 
       // Get available agents
       const availableAgents = await this.getAvailableAgents();
-      if (availableAgents.length === 0) {
+      if (false) {
         return this.createFailureResult(
           request,
killedBy: ResourceAllocator Resource Allocation should handle no available agents
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "No available agents"
Received: "No available agents for task assignment"

[Killed] BlockStatement
src/resources/ResourceAllocator.ts:100:41
 
       // Get available agents
       const availableAgents = await this.getAvailableAgents();
-      if (availableAgents.length === 0) {
-        return this.createFailureResult(
-          request,
-          "No available agents",
-          startTime
-        );
-      }
+      if (availableAgents.length === 0) {}
 
       // Select agent using load balancer
killedBy: ResourceAllocator Resource Allocation should handle no available agents
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "No available agents"
Received: "No available agents for task assignment"

[Survived] ObjectLiteral
src/resources/ResourceAllocator.ts:115:34
       );
 
       // Allocate resources
-      const allocatedResources = {
-        cpuPercent: request.requiredResources.cpuPercent ?? 10,
-        memoryMb: request.requiredResources.memoryMb ?? 128,
-        networkMbps: request.requiredResources.networkMbps ?? 10,
-      };
+      const allocatedResources = {};
 
       // Record allocation

[Survived] LogicalOperator
src/resources/ResourceAllocator.ts:116:21
 
       // Allocate resources
       const allocatedResources = {
-        cpuPercent: request.requiredResources.cpuPercent ?? 10,
+        cpuPercent: request.requiredResources.cpuPercent && 10,
         memoryMb: request.requiredResources.memoryMb ?? 128,
         networkMbps: request.requiredResources.networkMbps ?? 10,

[Survived] LogicalOperator
src/resources/ResourceAllocator.ts:117:19
       // Allocate resources
       const allocatedResources = {
         cpuPercent: request.requiredResources.cpuPercent ?? 10,
-        memoryMb: request.requiredResources.memoryMb ?? 128,
+        memoryMb: request.requiredResources.memoryMb && 128,
         networkMbps: request.requiredResources.networkMbps ?? 10,
       };

[Survived] LogicalOperator
src/resources/ResourceAllocator.ts:118:22
       const allocatedResources = {
         cpuPercent: request.requiredResources.cpuPercent ?? 10,
         memoryMb: request.requiredResources.memoryMb ?? 128,
-        networkMbps: request.requiredResources.networkMbps ?? 10,
+        networkMbps: request.requiredResources.networkMbps && 10,
       };
 

[Killed] UpdateOperator
src/resources/ResourceAllocator.ts:132:7
       this.activeAllocations.set(request.requestId, allocationRecord);
 
       // Update stats
-      this.allocationStats.successfulAllocations++;
+      this.allocationStats.successfulAllocations--;
       const allocationTime = Date.now() - startTime;
       this.allocationStats.totalAllocationTimeMs += allocationTime;
killedBy: ResourceAllocator Statistics should track allocation statistics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Survived] ArithmeticOperator
src/resources/ResourceAllocator.ts:133:30
 
       // Update stats
       this.allocationStats.successfulAllocations++;
-      const allocationTime = Date.now() - startTime;
+      const allocationTime = Date.now() + startTime;
       this.allocationStats.totalAllocationTimeMs += allocationTime;
 

[Survived] AssignmentOperator
src/resources/ResourceAllocator.ts:134:7
       // Update stats
       this.allocationStats.successfulAllocations++;
       const allocationTime = Date.now() - startTime;
-      this.allocationStats.totalAllocationTimeMs += allocationTime;
+      this.allocationStats.totalAllocationTimeMs -= allocationTime;
 
       // Increment rate limit counter

[Killed] UpdateOperator
src/resources/ResourceAllocator.ts:137:7
       this.allocationStats.totalAllocationTimeMs += allocationTime;
 
       // Increment rate limit counter
-      this.rateLimitConfig.currentCount++;
+      this.rateLimitConfig.currentCount--;
 
       this.logger.debug("Resource allocation successful", {
killedBy: ResourceAllocator Rate Limiting should respect rate limits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] ObjectLiteral
src/resources/ResourceAllocator.ts:139:59
       // Increment rate limit counter
       this.rateLimitConfig.currentCount++;
 
-      this.logger.debug("Resource allocation successful", {
-        requestId: request.requestId,
-        taskId: request.taskId,
-        agentId: decision.selectedAgentId,
-        priority: request.priority,
-        allocationTimeMs: allocationTime,
-      });
+      this.logger.debug("Resource allocation successful", {});
 
       return {

[Killed] ObjectLiteral
src/resources/ResourceAllocator.ts:147:14
         allocationTimeMs: allocationTime,
       });
 
-      return {
-        requestId: request.requestId,
-        success: true,
-        assignedAgentId: decision.selectedAgentId,
-        allocatedResources,
-        allocatedAt: new Date(),
-        waitTimeMs: Date.now() - request.requestedAt.getTime(),
-      };
+      return {};
     } catch (error) {
       this.logger.error("Resource allocation failed", {
killedBy: ResourceAllocator Resource Allocation should successfully allocate resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
src/resources/ResourceAllocator.ts:149:18
 
       return {
         requestId: request.requestId,
-        success: true,
+        success: false,
         assignedAgentId: decision.selectedAgentId,
         allocatedResources,
killedBy: ResourceAllocator Resource Allocation should successfully allocate resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ArithmeticOperator
src/resources/ResourceAllocator.ts:153:21
         assignedAgentId: decision.selectedAgentId,
         allocatedResources,
         allocatedAt: new Date(),
-        waitTimeMs: Date.now() - request.requestedAt.getTime(),
+        waitTimeMs: Date.now() + request.requestedAt.getTime(),
       };
     } catch (error) {

[Killed] BlockStatement
src/resources/ResourceAllocator.ts:155:21
         allocatedAt: new Date(),
         waitTimeMs: Date.now() - request.requestedAt.getTime(),
       };
-    } catch (error) {
-      this.logger.error("Resource allocation failed", {
-        requestId: request.requestId,
-        error,
-      });
-
-      return this.createFailureResult(
-        request,
-        error instanceof Error ? error.message : "Unknown error",
-        startTime
-      );
-    }
+    } catch (error) {}
   }
 
killedBy: ResourceAllocator Resource Allocation should handle load balancer selection failure
statusReason: TypeError: Cannot read properties of undefined (reading 'success')

[Survived] ObjectLiteral
src/resources/ResourceAllocator.ts:156:55
         waitTimeMs: Date.now() - request.requestedAt.getTime(),
       };
     } catch (error) {
-      this.logger.error("Resource allocation failed", {
-        requestId: request.requestId,
-        error,
-      });
+      this.logger.error("Resource allocation failed", {});
 
       return this.createFailureResult(

[Survived] BlockStatement
src/resources/ResourceAllocator.ts:174:51
    *
    * @param requestId Request identifier
    */
-  async release(requestId: string): Promise<void> {
-    const allocation = this.activeAllocations.get(requestId);
-
-    if (!allocation) {
-      this.logger.warn("Attempted to release unknown allocation", {
-        requestId,
-      });
-      return;
-    }
-
-    this.activeAllocations.delete(requestId);
-
-    this.logger.debug("Resources released", {
-      requestId,
-      agentId: allocation.agentId,
-      durationMs: Date.now() - allocation.allocatedAt.getTime(),
-    });
-  }
+  async release(requestId: string): Promise<void> {}
 
   /**

[Killed] BooleanLiteral
src/resources/ResourceAllocator.ts:177:9
   async release(requestId: string): Promise<void> {
     const allocation = this.activeAllocations.get(requestId);
 
-    if (!allocation) {
+    if (allocation) {
       this.logger.warn("Attempted to release unknown allocation", {
         requestId,
killedBy: ResourceAllocator Resource Release should handle release of unknown allocation
statusReason: Error: expect(received).resolves.not.toThrow()

Received promise rejected instead of resolved
Rejected to value: [TypeError: Cannot read properties of undefined (reading 'agentId')]

[Killed] BlockStatement
src/resources/ResourceAllocator.ts:177:22
   async release(requestId: string): Promise<void> {
     const allocation = this.activeAllocations.get(requestId);
 
-    if (!allocation) {
-      this.logger.warn("Attempted to release unknown allocation", {
-        requestId,
-      });
-      return;
-    }
+    if (!allocation) {}
 
     this.activeAllocations.delete(requestId);
killedBy: ResourceAllocator Resource Release should handle release of unknown allocation
statusReason: Error: expect(received).resolves.not.toThrow()

Received promise rejected instead of resolved
Rejected to value: [TypeError: Cannot read properties of undefined (reading 'agentId')]

[Survived] ArithmeticOperator
src/resources/ResourceAllocator.ts:189:19
     this.logger.debug("Resources released", {
       requestId,
       agentId: allocation.agentId,
-      durationMs: Date.now() - allocation.allocatedAt.getTime(),
+      durationMs: Date.now() + allocation.allocatedAt.getTime(),
     });
   }

[Killed] BlockStatement
src/resources/ResourceAllocator.ts:203:5
     successfulAllocations: number;
     failedAllocations: number;
     avgAllocationTimeMs: number;
-  } {
-    const avgAllocationTimeMs =
-      this.allocationStats.successfulAllocations > 0
-        ? this.allocationStats.totalAllocationTimeMs /
-          this.allocationStats.successfulAllocations
-        : 0;
-
-    return {
-      totalRequests: this.allocationStats.totalRequests,
-      successfulAllocations: this.allocationStats.successfulAllocations,
-      failedAllocations: this.allocationStats.failedAllocations,
-      avgAllocationTimeMs,
-    };
-  }
+  } {}
 
   /**
killedBy: ResourceAllocator Statistics should track allocation statistics
statusReason: TypeError: Cannot read properties of undefined (reading 'totalRequests')

[Survived] EqualityOperator
src/resources/ResourceAllocator.ts:205:7
     avgAllocationTimeMs: number;
   } {
     const avgAllocationTimeMs =
-      this.allocationStats.successfulAllocations > 0
+      this.allocationStats.successfulAllocations >= 0
         ? this.allocationStats.totalAllocationTimeMs /
           this.allocationStats.successfulAllocations

[Survived] EqualityOperator
src/resources/ResourceAllocator.ts:205:7
     avgAllocationTimeMs: number;
   } {
     const avgAllocationTimeMs =
-      this.allocationStats.successfulAllocations > 0
+      this.allocationStats.successfulAllocations <= 0
         ? this.allocationStats.totalAllocationTimeMs /
           this.allocationStats.successfulAllocations

[Survived] ArithmeticOperator
src/resources/ResourceAllocator.ts:206:11
   } {
     const avgAllocationTimeMs =
       this.allocationStats.successfulAllocations > 0
-        ? this.allocationStats.totalAllocationTimeMs /
-          this.allocationStats.successfulAllocations
+        ? this.allocationStats.totalAllocationTimeMs * this.allocationStats.successfulAllocations
         : 0;
 

[NoCoverage] BlockStatement
src/resources/ResourceAllocator.ts:223:51
    *
    * @param config New rate limit configuration
    */
-  updateRateLimits(config: RateLimitConfig): void {
-    this.rateLimitConfig = { ...config };
-    this.logger.info("Rate limits updated", config);
-  }
+  updateRateLimits(config: RateLimitConfig): void {}
 
   /**

[NoCoverage] ObjectLiteral
src/resources/ResourceAllocator.ts:224:28
    * @param config New rate limit configuration
    */
   updateRateLimits(config: RateLimitConfig): void {
-    this.rateLimitConfig = { ...config };
+    this.rateLimitConfig = {};
     this.logger.info("Rate limits updated", config);
   }

[Survived] BlockStatement
src/resources/ResourceAllocator.ts:233:38
    *
    * @returns Active allocation count
    */
-  getActiveAllocationCount(): number {
-    return this.activeAllocations.size;
-  }
+  getActiveAllocationCount(): number {}
 
   /**

[Killed] BlockStatement
src/resources/ResourceAllocator.ts:243:52
    * @param agentId Agent identifier
    * @returns Allocation count for agent
    */
-  getAgentAllocationCount(agentId: string): number {
-    return Array.from(this.activeAllocations.values()).filter(
-      (a) => a.agentId === agentId
-    ).length;
-  }
+  getAgentAllocationCount(agentId: string): number {}
 
   /**
killedBy: AdaptiveResourceManager Integration End-to-End Resource Management Flow should handle agent failover scenarios
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Matcher error: received value must be a number or bigint

Received has value: undefined

[Survived] MethodExpression
src/resources/ResourceAllocator.ts:244:12
    * @returns Allocation count for agent
    */
   getAgentAllocationCount(agentId: string): number {
-    return Array.from(this.activeAllocations.values()).filter(
-      (a) => a.agentId === agentId
-    ).length;
+    return Array.from(this.activeAllocations.values()).length;
   }
 

[NoCoverage] ConditionalExpression
src/resources/ResourceAllocator.ts:245:14
    */
   getAgentAllocationCount(agentId: string): number {
     return Array.from(this.activeAllocations.values()).filter(
-      (a) => a.agentId === agentId
+      (a) => true
     ).length;
   }

[Survived] ArrowFunction
src/resources/ResourceAllocator.ts:245:7
    */
   getAgentAllocationCount(agentId: string): number {
     return Array.from(this.activeAllocations.values()).filter(
-      (a) => a.agentId === agentId
+      () => undefined
     ).length;
   }

[NoCoverage] BlockStatement
src/resources/ResourceAllocator.ts:252:22
   /**
    * Reset statistics
    */
-  resetStats(): void {
-    this.allocationStats = {
-      totalRequests: 0,
-      successfulAllocations: 0,
-      failedAllocations: 0,
-      totalAllocationTimeMs: 0,
-    };
-    this.logger.info("Allocation statistics reset");
-  }
+  resetStats(): void {}
 
   /**

[Killed] BlockStatement
src/resources/ResourceAllocator.ts:267:37
    *
    * @returns True if within rate limit
    */
-  private checkRateLimit(): boolean {
-    const now = new Date();
-    const windowElapsed =
-      now.getTime() - this.rateLimitConfig.windowStart.getTime();
-
-    // Reset window if expired
-    if (windowElapsed >= this.rateLimitConfig.windowMs) {
-      this.rateLimitConfig.currentCount = 0;
-      this.rateLimitConfig.windowStart = now;
-      return true;
-    }
-
-    // Check if within limit
-    return this.rateLimitConfig.currentCount < this.rateLimitConfig.maxRequests;
-  }
+  private checkRateLimit(): boolean {}
 
   /**
killedBy: ResourceAllocator Resource Allocation should successfully allocate resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/resources/ResourceAllocator.ts:270:7
   private checkRateLimit(): boolean {
     const now = new Date();
     const windowElapsed =
-      now.getTime() - this.rateLimitConfig.windowStart.getTime();
+      now.getTime() + this.rateLimitConfig.windowStart.getTime();
 
     // Reset window if expired
killedBy: ResourceAllocator Statistics should track failed allocation statistics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/resources/ResourceAllocator.ts:273:9
       now.getTime() - this.rateLimitConfig.windowStart.getTime();
 
     // Reset window if expired
-    if (windowElapsed >= this.rateLimitConfig.windowMs) {
+    if (true) {
       this.rateLimitConfig.currentCount = 0;
       this.rateLimitConfig.windowStart = now;
killedBy: ResourceAllocator Statistics should track failed allocation statistics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
src/resources/ResourceAllocator.ts:273:9
       now.getTime() - this.rateLimitConfig.windowStart.getTime();
 
     // Reset window if expired
-    if (windowElapsed >= this.rateLimitConfig.windowMs) {
+    if (windowElapsed < this.rateLimitConfig.windowMs) {
       this.rateLimitConfig.currentCount = 0;
       this.rateLimitConfig.windowStart = now;
killedBy: ResourceAllocator Statistics should track failed allocation statistics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[NoCoverage] BooleanLiteral
src/resources/ResourceAllocator.ts:276:14
     if (windowElapsed >= this.rateLimitConfig.windowMs) {
       this.rateLimitConfig.currentCount = 0;
       this.rateLimitConfig.windowStart = now;
-      return true;
+      return false;
     }
 

[Killed] ConditionalExpression
src/resources/ResourceAllocator.ts:280:12
     }
 
     // Check if within limit
-    return this.rateLimitConfig.currentCount < this.rateLimitConfig.maxRequests;
+    return false;
   }
 
killedBy: ResourceAllocator Resource Allocation should successfully allocate resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/resources/ResourceAllocator.ts:280:12
     }
 
     // Check if within limit
-    return this.rateLimitConfig.currentCount < this.rateLimitConfig.maxRequests;
+    return true;
   }
 
killedBy: ResourceAllocator Statistics should track failed allocation statistics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/resources/ResourceAllocator.ts:289:57
    *
    * @returns List of available agent IDs
    */
-  private async getAvailableAgents(): Promise<string[]> {
-    // Placeholder: return mock agents
-    // In real implementation, query agent registry for healthy agents
-    return ["agent-1", "agent-2", "agent-3"];
-  }
+  private async getAvailableAgents(): Promise<string[]> {}
 
   /**
killedBy: ResourceAllocator Resource Allocation should successfully allocate resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/resources/ResourceAllocator.ts:302:31
     request: ResourceAllocationRequest,
     reason: string,
     startTime: number
-  ): ResourceAllocationResult {
-    this.allocationStats.failedAllocations++;
-    return {
-      requestId: request.requestId,
-      success: false,
-      failureReason: reason,
-      waitTimeMs: Date.now() - startTime,
-    };
-  }
+  ): ResourceAllocationResult {}
 }
 
killedBy: ResourceAllocator Resource Allocation should handle rate limit exceeded
statusReason: TypeError: Cannot read properties of undefined (reading 'success')

[Killed] UpdateOperator
src/resources/ResourceAllocator.ts:303:5
     reason: string,
     startTime: number
   ): ResourceAllocationResult {
-    this.allocationStats.failedAllocations++;
+    this.allocationStats.failedAllocations--;
     return {
       requestId: request.requestId,
killedBy: ResourceAllocator Statistics should track failed allocation statistics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BooleanLiteral
src/resources/ResourceAllocator.ts:306:16
     this.allocationStats.failedAllocations++;
     return {
       requestId: request.requestId,
-      success: false,
+      success: true,
       failureReason: reason,
       waitTimeMs: Date.now() - startTime,
killedBy: ResourceAllocator Resource Allocation should handle rate limit exceeded
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] ArithmeticOperator
src/resources/ResourceAllocator.ts:308:19
       requestId: request.requestId,
       success: false,
       failureReason: reason,
-      waitTimeMs: Date.now() - startTime,
+      waitTimeMs: Date.now() + startTime,
     };
   }
