[NoCoverage] BlockStatement
src/security/AgentRegistrySecurity.ts:498:21
         eventType: event.eventType,
         result: event.result,
       });
-    } catch (error) {
-      this.logger.error("Failed to log audit event:", error);
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:506:72
   /**
    * Get audit events for a resource
    */
-  getAuditEvents(resourceId: string, limit: number = 50): AuditEvent[] {
-    return this.auditEvents
-      .filter((event) => event.resource.id === resourceId)
-      .sort((a, b) => b.timestamp.getTime() - a.timestamp.getTime())
-      .slice(0, limit);
-  }
+  getAuditEvents(resourceId: string, limit: number = 50): AuditEvent[] {}
 
   /**
killedBy: AgentRegistrySecurity Audit Logging should log successful events
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] MethodExpression
src/security/AgentRegistrySecurity.ts:507:12
    * Get audit events for a resource
    */
   getAuditEvents(resourceId: string, limit: number = 50): AuditEvent[] {
-    return this.auditEvents
-      .filter((event) => event.resource.id === resourceId)
-      .sort((a, b) => b.timestamp.getTime() - a.timestamp.getTime())
-      .slice(0, limit);
+    return this.auditEvents.filter(event => event.resource.id === resourceId).sort((a, b) => b.timestamp.getTime() - a.timestamp.getTime());
   }
 
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Audit Logging should return limited number of events
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 3
Received:    10

[Killed] MethodExpression
src/security/AgentRegistrySecurity.ts:507:12
    * Get audit events for a resource
    */
   getAuditEvents(resourceId: string, limit: number = 50): AuditEvent[] {
-    return this.auditEvents
-      .filter((event) => event.resource.id === resourceId)
-      .sort((a, b) => b.timestamp.getTime() - a.timestamp.getTime())
+    return this.auditEvents.filter(event => event.resource.id === resourceId)
       .slice(0, limit);
   }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Audit Logging should sort events by timestamp descending
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

- 2025-10-16T05:10:53.007Z
+ 2025-10-16T05:10:52.007Z

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:508:26
    */
   getAuditEvents(resourceId: string, limit: number = 50): AuditEvent[] {
     return this.auditEvents
-      .filter((event) => event.resource.id === resourceId)
+      .filter((event) => event.resource.id !== resourceId)
       .sort((a, b) => b.timestamp.getTime() - a.timestamp.getTime())
       .slice(0, limit);
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should reject empty token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/security/AgentRegistrySecurity.ts:508:15
    */
   getAuditEvents(resourceId: string, limit: number = 50): AuditEvent[] {
     return this.auditEvents
-      .filter((event) => event.resource.id === resourceId)
+      .filter(() => undefined)
       .sort((a, b) => b.timestamp.getTime() - a.timestamp.getTime())
       .slice(0, limit);
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should reject empty token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/security/AgentRegistrySecurity.ts:509:13
   getAuditEvents(resourceId: string, limit: number = 50): AuditEvent[] {
     return this.auditEvents
       .filter((event) => event.resource.id === resourceId)
-      .sort((a, b) => b.timestamp.getTime() - a.timestamp.getTime())
+      .sort(() => undefined)
       .slice(0, limit);
   }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Audit Logging should sort events by timestamp descending
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

- 2025-10-16T05:10:57.524Z
+ 2025-10-16T05:10:56.524Z

[Killed] ArithmeticOperator
src/security/AgentRegistrySecurity.ts:509:23
   getAuditEvents(resourceId: string, limit: number = 50): AuditEvent[] {
     return this.auditEvents
       .filter((event) => event.resource.id === resourceId)
-      .sort((a, b) => b.timestamp.getTime() - a.timestamp.getTime())
+      .sort((a, b) => b.timestamp.getTime() + a.timestamp.getTime())
       .slice(0, limit);
   }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Audit Logging should sort events by timestamp descending
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

- 2025-10-16T05:10:58.228Z
+ 2025-10-16T05:10:57.228Z

[Survived] BlockStatement
src/security/AgentRegistrySecurity.ts:522:14
   private isCrossTenantAccess(
     context: SecurityContext,
     resource: Partial<AgentProfile>
-  ): boolean {
-    // Extract tenant ID from resource (if it has one)
-    const resourceTenantId = (resource as any).tenantId;
-
-    // If resource doesn't have tenant ID, allow access (legacy resources)
-    if (!resourceTenantId) {
-      return false;
-    }
-
-    // Check if context tenant matches resource tenant
-    return context.tenantId !== resourceTenantId;
-  }
+  ): boolean {}
 
   /**

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:527:9
     const resourceTenantId = (resource as any).tenantId;
 
     // If resource doesn't have tenant ID, allow access (legacy resources)
-    if (!resourceTenantId) {
+    if (false) {
       return false;
     }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Multi-tenant Isolation should allow access to same tenant resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:527:9
     const resourceTenantId = (resource as any).tenantId;
 
     // If resource doesn't have tenant ID, allow access (legacy resources)
-    if (!resourceTenantId) {
+    if (resourceTenantId) {
       return false;
     }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Multi-tenant Isolation should allow access to same tenant resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:528:14
 
     // If resource doesn't have tenant ID, allow access (legacy resources)
     if (!resourceTenantId) {
-      return false;
+      return true;
     }
 
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Multi-tenant Isolation should allow access to same tenant resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] EqualityOperator
src/security/AgentRegistrySecurity.ts:532:12
     }
 
     // Check if context tenant matches resource tenant
-    return context.tenantId !== resourceTenantId;
+    return context.tenantId === resourceTenantId;
   }
 

[NoCoverage] ConditionalExpression
src/security/AgentRegistrySecurity.ts:532:12
     }
 
     // Check if context tenant matches resource tenant
-    return context.tenantId !== resourceTenantId;
+    return true;
   }
 

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:538:61
   /**
    * Check rate limiting
    */
-  private checkRateLimit(context: SecurityContext): boolean {
-    const key = `${context.tenantId}:${context.userId}`;
-    const now = Date.now();
-    const windowData = this.rateLimitCache.get(key);
-
-    if (!windowData || now > windowData.resetTime) {
-      // New window
-      this.rateLimitCache.set(key, {
-        count: 1,
-        resetTime: now + this.config.rateLimitWindowMs,
-      });
-      return true;
-    }
-
-    if (windowData.count >= this.config.rateLimitMaxRequests) {
-      return false;
-    }
-
-    windowData.count++;
-    return true;
-  }
+  private checkRateLimit(context: SecurityContext): boolean {}
 
   /**
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Multi-tenant Isolation should allow access to same tenant resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:543:9
     const now = Date.now();
     const windowData = this.rateLimitCache.get(key);
 
-    if (!windowData || now > windowData.resetTime) {
+    if (false) {
       // New window
       this.rateLimitCache.set(key, {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Multi-tenant Isolation should allow access to same tenant resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:543:24
     const now = Date.now();
     const windowData = this.rateLimitCache.get(key);
 
-    if (!windowData || now > windowData.resetTime) {
+    if (!windowData || now <= windowData.resetTime) {
       // New window
       this.rateLimitCache.set(key, {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Authorization Checks should enforce rate limits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ObjectLiteral
src/security/AgentRegistrySecurity.ts:545:36
 
     if (!windowData || now > windowData.resetTime) {
       // New window
-      this.rateLimitCache.set(key, {
-        count: 1,
-        resetTime: now + this.config.rateLimitWindowMs,
-      });
+      this.rateLimitCache.set(key, {});
       return true;
     }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Authorization Checks should enforce rate limits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArithmeticOperator
src/security/AgentRegistrySecurity.ts:547:20
       // New window
       this.rateLimitCache.set(key, {
         count: 1,
-        resetTime: now + this.config.rateLimitWindowMs,
+        resetTime: now - this.config.rateLimitWindowMs,
       });
       return true;
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Authorization Checks should enforce rate limits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:552:9
       return true;
     }
 
-    if (windowData.count >= this.config.rateLimitMaxRequests) {
+    if (false) {
       return false;
     }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Authorization Checks should enforce rate limits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:552:63
       return true;
     }
 
-    if (windowData.count >= this.config.rateLimitMaxRequests) {
-      return false;
-    }
+    if (windowData.count >= this.config.rateLimitMaxRequests) {}
 
     windowData.count++;
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Authorization Checks should enforce rate limits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:553:14
     }
 
     if (windowData.count >= this.config.rateLimitMaxRequests) {
-      return false;
+      return true;
     }
 
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Authorization Checks should enforce rate limits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] UpdateOperator
src/security/AgentRegistrySecurity.ts:556:5
       return false;
     }
 
-    windowData.count++;
+    windowData.count--;
     return true;
   }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Rate Limiting should block requests over rate limit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:557:12
     }
 
     windowData.count++;
-    return true;
+    return false;
   }
 
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Rate Limiting should allow requests within rate limit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:566:13
   private getRequiredPermission(
     action: AuditAction,
     resourceType: string
-  ): string {
-    const permissionMap: Record<AuditAction, string> = {
-      [AuditAction.CREATE]: `${resourceType}:create`,
-      [AuditAction.READ]: `${resourceType}:read`,
-      [AuditAction.UPDATE]: `${resourceType}:update`,
-      [AuditAction.DELETE]: `${resourceType}:delete`,
-      [AuditAction.QUERY]: `${resourceType}:read`,
-    };
-
-    return permissionMap[action] || `${resourceType}:read`;
-  }
+  ): string {}
 
   /**
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Multi-tenant Isolation should allow access to same tenant resources
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
src/security/AgentRegistrySecurity.ts:567:56
     action: AuditAction,
     resourceType: string
   ): string {
-    const permissionMap: Record<AuditAction, string> = {
-      [AuditAction.CREATE]: `${resourceType}:create`,
-      [AuditAction.READ]: `${resourceType}:read`,
-      [AuditAction.UPDATE]: `${resourceType}:update`,
-      [AuditAction.DELETE]: `${resourceType}:delete`,
-      [AuditAction.QUERY]: `${resourceType}:read`,
-    };
+    const permissionMap: Record<AuditAction, string> = {};
 
     return permissionMap[action] || `${resourceType}:read`;
killedBy: AgentRegistrySecurity Authorization should deny action without required permissions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:575:12
       [AuditAction.QUERY]: `${resourceType}:read`,
     };
 
-    return permissionMap[action] || `${resourceType}:read`;
+    return true;
   }
 
killedBy: AgentRegistrySecurity Authorization should authorize valid action with proper permissions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:575:12
       [AuditAction.QUERY]: `${resourceType}:read`,
     };
 
-    return permissionMap[action] || `${resourceType}:read`;
+    return false;
   }
 
killedBy: AgentRegistrySecurity Authorization should authorize valid action with proper permissions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:587:20
     resourceType: string,
     resourceId: string,
     reason: string
-  ): Promise<void> {
-    await this.logAuditEvent({
-      id: this.generateId(),
-      timestamp: new Date(),
-      eventType: AuditEventType.SECURITY_VIOLATION,
-      actor: {
-        tenantId: context.tenantId,
-        userId: context.userId,
-        sessionId: context.sessionId,
-      },
-      resource: { type: resourceType as "agent", id: resourceId },
-      action,
-      details: { reason, securityViolation: true },
-      result: "failure",
-      errorMessage: reason,
-      ipAddress: context.ipAddress,
-      userAgent: context.userAgent,
-    });
-  }
+  ): Promise<void> {}
 
   /**
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Authorization Checks should log authorization failures
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BooleanLiteral
src/security/AgentRegistrySecurity.ts:599:45
       },
       resource: { type: resourceType as "agent", id: resourceId },
       action,
-      details: { reason, securityViolation: true },
+      details: { reason, securityViolation: false },
       result: "failure",
       errorMessage: reason,

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:616:20
     resourceType: string,
     resourceId: string,
     requiredPermission: string
-  ): Promise<void> {
-    await this.logAuditEvent({
-      id: this.generateId(),
-      timestamp: new Date(),
-      eventType: AuditEventType.AUTHORIZATION_FAILURE,
-      actor: {
-        tenantId: context.tenantId,
-        userId: context.userId,
-        sessionId: context.sessionId,
-      },
-      resource: { type: resourceType as "agent", id: resourceId },
-      action,
-      details: { requiredPermission, missingPermission: true },
-      result: "failure",
-      errorMessage: `Missing required permission: ${requiredPermission}`,
-      ipAddress: context.ipAddress,
-      userAgent: context.userAgent,
-    });
-  }
+  ): Promise<void> {}
 
   /**
killedBy: AgentRegistrySecurity Audit Logging should log security violations
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Survived] ObjectLiteral
src/security/AgentRegistrySecurity.ts:621:14
       id: this.generateId(),
       timestamp: new Date(),
       eventType: AuditEventType.AUTHORIZATION_FAILURE,
-      actor: {
-        tenantId: context.tenantId,
-        userId: context.userId,
-        sessionId: context.sessionId,
-      },
+      actor: {},
       resource: { type: resourceType as "agent", id: resourceId },
       action,

[Survived] BooleanLiteral
src/security/AgentRegistrySecurity.ts:628:57
       },
       resource: { type: resourceType as "agent", id: resourceId },
       action,
-      details: { requiredPermission, missingPermission: true },
+      details: { requiredPermission, missingPermission: false },
       result: "failure",
       errorMessage: `Missing required permission: ${requiredPermission}`,

[Survived] ObjectLiteral
src/security/AgentRegistrySecurity.ts:628:16
       },
       resource: { type: resourceType as "agent", id: resourceId },
       action,
-      details: { requiredPermission, missingPermission: true },
+      details: {},
       result: "failure",
       errorMessage: `Missing required permission: ${requiredPermission}`,

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:641:64
    * @param token - JWT token string
    * @returns Tenant ID from token claims, or null if not found
    */
-  private extractTenantFromToken(token: string): string | null {
-    try {
-      // Decode JWT without verification (verification done in validateJwtToken)
-      const decoded = jwt.decode(token) as any;
-
-      if (!decoded || typeof decoded !== "object") {
-        return null;
-      }
-
-      // Check standard tenant claim locations
-      return decoded.tenantId || decoded.tenant || decoded.tid || null;
-    } catch (error) {
-      return null;
-    }
-  }
+  private extractTenantFromToken(token: string): string | null {}
 
   /**
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should extract tenant and user from token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-tenant"
Received: "default-tenant"

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:642:9
    * @returns Tenant ID from token claims, or null if not found
    */
   private extractTenantFromToken(token: string): string | null {
-    try {
-      // Decode JWT without verification (verification done in validateJwtToken)
-      const decoded = jwt.decode(token) as any;
-
-      if (!decoded || typeof decoded !== "object") {
-        return null;
-      }
-
-      // Check standard tenant claim locations
-      return decoded.tenantId || decoded.tenant || decoded.tid || null;
-    } catch (error) {
+    try {} catch (error) {
       return null;
     }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should extract tenant and user from token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-tenant"
Received: "default-tenant"

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:646:11
       // Decode JWT without verification (verification done in validateJwtToken)
       const decoded = jwt.decode(token) as any;
 
-      if (!decoded || typeof decoded !== "object") {
+      if (decoded || typeof decoded !== "object") {
         return null;
       }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should extract tenant and user from token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-tenant"
Received: "default-tenant"

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:646:11
       // Decode JWT without verification (verification done in validateJwtToken)
       const decoded = jwt.decode(token) as any;
 
-      if (!decoded || typeof decoded !== "object") {
+      if (true) {
         return null;
       }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should extract tenant and user from token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-tenant"
Received: "default-tenant"

[Killed] LogicalOperator
src/security/AgentRegistrySecurity.ts:651:14
       }
 
       // Check standard tenant claim locations
-      return decoded.tenantId || decoded.tenant || decoded.tid || null;
+      return (decoded.tenantId || decoded.tenant) && decoded.tid || null;
     } catch (error) {
       return null;
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should extract tenant and user from token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-tenant"
Received: "default-tenant"

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:651:14
       }
 
       // Check standard tenant claim locations
-      return decoded.tenantId || decoded.tenant || decoded.tid || null;
+      return true;
     } catch (error) {
       return null;
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should extract tenant and user from token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-tenant"
Received: true

[NoCoverage] BlockStatement
src/security/AgentRegistrySecurity.ts:652:21
 
       // Check standard tenant claim locations
       return decoded.tenantId || decoded.tenant || decoded.tid || null;
-    } catch (error) {
-      return null;
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:662:62
    * @param token - JWT token string
    * @returns User ID from token claims, or null if not found
    */
-  private extractUserFromToken(token: string): string | null {
-    try {
-      // Decode JWT without verification (verification done in validateJwtToken)
-      const decoded = jwt.decode(token) as any;
-
-      if (!decoded || typeof decoded !== "object") {
-        return null;
-      }
-
-      // Check standard user claim locations (JWT standards: sub, userId, user, uid)
-      return (
-        decoded.sub || decoded.userId || decoded.user || decoded.uid || null
-      );
-    } catch (error) {
-      return null;
-    }
-  }
+  private extractUserFromToken(token: string): string | null {}
 
   /**
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should extract tenant and user from token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-user"
Received: "mock-user"

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:663:9
    * @returns User ID from token claims, or null if not found
    */
   private extractUserFromToken(token: string): string | null {
-    try {
-      // Decode JWT without verification (verification done in validateJwtToken)
-      const decoded = jwt.decode(token) as any;
-
-      if (!decoded || typeof decoded !== "object") {
-        return null;
-      }
-
-      // Check standard user claim locations (JWT standards: sub, userId, user, uid)
-      return (
-        decoded.sub || decoded.userId || decoded.user || decoded.uid || null
-      );
-    } catch (error) {
+    try {} catch (error) {
       return null;
     }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should extract tenant and user from token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-user"
Received: "mock-user"

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:667:23
       // Decode JWT without verification (verification done in validateJwtToken)
       const decoded = jwt.decode(token) as any;
 
-      if (!decoded || typeof decoded !== "object") {
+      if (!decoded || typeof decoded === "object") {
         return null;
       }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should extract tenant and user from token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-user"
Received: "mock-user"

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:673:9
 
       // Check standard user claim locations (JWT standards: sub, userId, user, uid)
       return (
-        decoded.sub || decoded.userId || decoded.user || decoded.uid || null
+        true
       );
     } catch (error) {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should extract tenant and user from token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-user"
Received: true

[Killed] LogicalOperator
src/security/AgentRegistrySecurity.ts:673:9
 
       // Check standard user claim locations (JWT standards: sub, userId, user, uid)
       return (
-        decoded.sub || decoded.userId || decoded.user || decoded.uid || null
+        decoded.sub && decoded.userId || decoded.user || decoded.uid || null
       );
     } catch (error) {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should extract tenant and user from token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-user"
Received: "mock-user"

[NoCoverage] BlockStatement
src/security/AgentRegistrySecurity.ts:675:21
       return (
         decoded.sub || decoded.userId || decoded.user || decoded.uid || null
       );
-    } catch (error) {
-      return null;
-    }
+    } catch (error) {}
   }
 

[Survived] BlockStatement
src/security/AgentRegistrySecurity.ts:683:32
   /**
    * Generate unique ID for audit events
    */
-  private generateId(): string {
-    return `audit_${Date.now()}_${Math.random().toString(36).substring(2, 9)}`;
-  }
+  private generateId(): string {}
 
   /**

[Survived] MethodExpression
src/security/AgentRegistrySecurity.ts:684:35
    * Generate unique ID for audit events
    */
   private generateId(): string {
-    return `audit_${Date.now()}_${Math.random().toString(36).substring(2, 9)}`;
+    return `audit_${Date.now()}_${Math.random().toString(36)}`;
   }
 

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:690:30
   /**
    * Clean up old audit events
    */
-  cleanupAuditEvents(): void {
-    const cutoffDate = new Date();
-    cutoffDate.setDate(cutoffDate.getDate() - this.config.auditRetentionDays);
-
-    this.auditEvents = this.auditEvents.filter(
-      (event) => event.timestamp >= cutoffDate
-    );
-  }
+  cleanupAuditEvents(): void {}
 
   /**
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Configuration and Edge Cases should handle cleanup of old audit events
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
src/security/AgentRegistrySecurity.ts:692:5
    */
   cleanupAuditEvents(): void {
     const cutoffDate = new Date();
-    cutoffDate.setDate(cutoffDate.getDate() - this.config.auditRetentionDays);
+    cutoffDate.setTime(cutoffDate.getDate() - this.config.auditRetentionDays);
 
     this.auditEvents = this.auditEvents.filter(
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Configuration and Edge Cases should handle cleanup of old audit events
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArithmeticOperator
src/security/AgentRegistrySecurity.ts:692:24
    */
   cleanupAuditEvents(): void {
     const cutoffDate = new Date();
-    cutoffDate.setDate(cutoffDate.getDate() - this.config.auditRetentionDays);
+    cutoffDate.setDate(cutoffDate.getDate() + this.config.auditRetentionDays);
 
     this.auditEvents = this.auditEvents.filter(
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Configuration and Edge Cases should handle cleanup of old audit events
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
