[Killed] BooleanLiteral
src/resources/ResourceMonitor.ts:50:25
  */
 const DEFAULT_CONFIG: ResourceMonitorConfig = {
   intervalMs: 5000, // 5 seconds
-  enableHealthTracking: true,
+  enableHealthTracking: false,
   cpuThresholds: {
     warning: 70,
killedBy: ResourceMonitor Health Status should detect degraded status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "degraded"
Received: "healthy"

[Survived] ObjectLiteral
src/resources/ResourceMonitor.ts:55:21
     warning: 70,
     critical: 85,
   },
-  memoryThresholds: {
-    warning: 75,
-    critical: 90,
-  },
+  memoryThresholds: {},
   defaultMaxTaskCapacity: 10,
 };

[Survived] BooleanLiteral
src/resources/ResourceMonitor.ts:75:23
   private logger: Logger;
   private config: ResourceMonitorConfig;
   private agentProfiles: Map<string, AgentResourceProfile> = new Map();
-  private isRunning = false;
+  private isRunning = true;
   private monitoringTimer?: ReturnType<typeof setInterval>;
 

[Killed] BlockStatement
src/resources/ResourceMonitor.ts:78:60
   private isRunning = false;
   private monitoringTimer?: ReturnType<typeof setInterval>;
 
-  constructor(config: Partial<ResourceMonitorConfig> = {}) {
-    this.logger = new Logger("ResourceMonitor");
-    this.config = { ...DEFAULT_CONFIG, ...config };
-  }
+  constructor(config: Partial<ResourceMonitorConfig> = {}) {}
 
   /**
killedBy: ResourceAllocator Resource Allocation should successfully allocate resources
statusReason: TypeError: Cannot read properties of undefined (reading 'defaultMaxTaskCapacity')

[Survived] ConditionalExpression
src/resources/ResourceMonitor.ts:87:9
    * Start resource monitoring
    */
   async start(): Promise<void> {
-    if (this.isRunning) {
+    if (false) {
       this.logger.warn("Resource monitor already running");
       return;

[NoCoverage] BlockStatement
src/resources/ResourceMonitor.ts:95:31
     this.isRunning = true;
 
     // Clear any existing timer first to prevent multiple timers
-    if (this.monitoringTimer) {
-      clearInterval(this.monitoringTimer);
-      this.monitoringTimer = undefined;
-    }
+    if (this.monitoringTimer) {}
 
     // Start periodic health updates

[Survived] ConditionalExpression
src/resources/ResourceMonitor.ts:95:9
     this.isRunning = true;
 
     // Clear any existing timer first to prevent multiple timers
-    if (this.monitoringTimer) {
+    if (true) {
       clearInterval(this.monitoringTimer);
       this.monitoringTimer = undefined;

[Survived] ConditionalExpression
src/resources/ResourceMonitor.ts:101:9
     }
 
     // Start periodic health updates
-    if (this.config.enableHealthTracking) {
+    if (false) {
       this.monitoringTimer = setInterval(async () => {
         await this.updateAgentHealth();

[Survived] ConditionalExpression
src/resources/ResourceMonitor.ts:101:9
     }
 
     // Start periodic health updates
-    if (this.config.enableHealthTracking) {
+    if (true) {
       this.monitoringTimer = setInterval(async () => {
         await this.updateAgentHealth();

[NoCoverage] BlockStatement
src/resources/ResourceMonitor.ts:102:54
 
     // Start periodic health updates
     if (this.config.enableHealthTracking) {
-      this.monitoringTimer = setInterval(async () => {
-        await this.updateAgentHealth();
-      }, this.config.intervalMs);
+      this.monitoringTimer = setInterval(async () => {}, this.config.intervalMs);
     }
 

[Survived] BlockStatement
src/resources/ResourceMonitor.ts:116:31
   /**
    * Stop resource monitoring
    */
-  async stop(): Promise<void> {
-    if (!this.isRunning) {
-      return;
-    }
-
-    if (this.monitoringTimer) {
-      clearInterval(this.monitoringTimer);
-      this.monitoringTimer = undefined;
-    }
-
-    this.isRunning = false;
-    this.logger.info("Resource monitor stopped");
-  }
+  async stop(): Promise<void> {}
 
   /**

[Survived] ConditionalExpression
src/resources/ResourceMonitor.ts:121:9
       return;
     }
 
-    if (this.monitoringTimer) {
+    if (true) {
       clearInterval(this.monitoringTimer);
       this.monitoringTimer = undefined;

[Survived] BlockStatement
src/resources/ResourceMonitor.ts:121:31
       return;
     }
 
-    if (this.monitoringTimer) {
-      clearInterval(this.monitoringTimer);
-      this.monitoringTimer = undefined;
-    }
+    if (this.monitoringTimer) {}
 
     this.isRunning = false;

[Survived] BooleanLiteral
src/resources/ResourceMonitor.ts:126:22
       this.monitoringTimer = undefined;
     }
 
-    this.isRunning = false;
+    this.isRunning = true;
     this.logger.info("Resource monitor stopped");
   }

[Killed] BlockStatement
src/resources/ResourceMonitor.ts:138:43
    */
   async getAgentResources(
     agentId: string
-  ): Promise<AgentResourceProfile | null> {
-    return this.agentProfiles.get(agentId) ?? null;
-  }
+  ): Promise<AgentResourceProfile | null> {}
 
   /**
killedBy: LoadBalancer Agent Selection should select agent using least loaded strategy
statusReason: Error: No agent profiles available for selection

[Killed] LogicalOperator
src/resources/ResourceMonitor.ts:139:12
   async getAgentResources(
     agentId: string
   ): Promise<AgentResourceProfile | null> {
-    return this.agentProfiles.get(agentId) ?? null;
+    return this.agentProfiles.get(agentId) && null;
   }
 
killedBy: LoadBalancer Agent Selection should select agent using least loaded strategy
statusReason: Error: No agent profiles available for selection

[Killed] BlockStatement
src/resources/ResourceMonitor.ts:147:65
    *
    * @returns All agent resource profiles
    */
-  async getAllAgentResources(): Promise<AgentResourceProfile[]> {
-    return Array.from(this.agentProfiles.values());
-  }
+  async getAllAgentResources(): Promise<AgentResourceProfile[]> {}
 
   /**
killedBy: ResourceMonitor Agent Management should get all agent resources
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BooleanLiteral
src/resources/ResourceMonitor.ts:160:9
   async recordUsage(agentId: string, usage: ResourceUsage): Promise<void> {
     let profile = this.agentProfiles.get(agentId);
 
-    if (!profile) {
+    if (profile) {
       // Create new profile
       profile = this.createInitialProfile(agentId);
killedBy: ResourceMonitor Resource Tracking should record resource usage
statusReason: TypeError: Cannot set properties of undefined (setting 'cpuUsage')

[Killed] ConditionalExpression
src/resources/ResourceMonitor.ts:160:9
   async recordUsage(agentId: string, usage: ResourceUsage): Promise<void> {
     let profile = this.agentProfiles.get(agentId);
 
-    if (!profile) {
+    if (false) {
       // Create new profile
       profile = this.createInitialProfile(agentId);
killedBy: LoadBalancer Agent Selection should select agent using least loaded strategy
statusReason: TypeError: Cannot set properties of undefined (setting 'cpuUsage')

[Killed] ConditionalExpression
src/resources/ResourceMonitor.ts:168:7
 
     // Update resource usage
     switch (usage.type) {
-      case ResourceType.CPU:
-        profile.cpuUsage = usage;
-        break;
+      case ResourceType.CPU:
       case ResourceType.MEMORY:
         profile.memoryUsage = usage;
killedBy: ResourceMonitor Resource Tracking should record resource usage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 0

[Killed] ConditionalExpression
src/resources/ResourceMonitor.ts:171:7
       case ResourceType.CPU:
         profile.cpuUsage = usage;
         break;
-      case ResourceType.MEMORY:
-        profile.memoryUsage = usage;
-        break;
+      case ResourceType.MEMORY:
       case ResourceType.NETWORK:
         profile.networkUsage = usage;
killedBy: ResourceMonitor Resource Tracking should track multiple resource types
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 0

[NoCoverage] ConditionalExpression
src/resources/ResourceMonitor.ts:174:7
       case ResourceType.MEMORY:
         profile.memoryUsage = usage;
         break;
-      case ResourceType.NETWORK:
-        profile.networkUsage = usage;
-        break;
+      case ResourceType.NETWORK:
     }
 

[Killed] BlockStatement
src/resources/ResourceMonitor.ts:182:43
     profile.lastUpdated = new Date();
 
     // Update health status
-    if (this.config.enableHealthTracking) {
-      profile.healthStatus = this.computeHealthStatus(profile);
-    }
+    if (this.config.enableHealthTracking) {}
 
     this.logger.debug("Recorded resource usage", {
killedBy: ResourceMonitor Health Status should detect degraded status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "degraded"
Received: "healthy"

[Killed] ConditionalExpression
src/resources/ResourceMonitor.ts:182:9
     profile.lastUpdated = new Date();
 
     // Update health status
-    if (this.config.enableHealthTracking) {
+    if (false) {
       profile.healthStatus = this.computeHealthStatus(profile);
     }
killedBy: ResourceMonitor Health Status should detect degraded status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "degraded"
Received: "healthy"

[Survived] MethodExpression
src/resources/ResourceMonitor.ts:202:26
   async getPoolStats(): Promise<ResourcePoolStats> {
     const allProfiles = Array.from(this.agentProfiles.values());
 
-    const activeAgents = allProfiles.filter(
-      (p) => p.currentTaskCount > 0
-    ).length;
+    const activeAgents = allProfiles.length;
     const idleAgents = allProfiles.filter(
       (p) => p.currentTaskCount === 0

[Killed] EqualityOperator
src/resources/ResourceMonitor.ts:203:14
     const allProfiles = Array.from(this.agentProfiles.values());
 
     const activeAgents = allProfiles.filter(
-      (p) => p.currentTaskCount > 0
+      (p) => p.currentTaskCount <= 0
     ).length;
     const idleAgents = allProfiles.filter(
killedBy: ResourceMonitor Pool Statistics should get pool statistics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArrowFunction
src/resources/ResourceMonitor.ts:203:7
     const allProfiles = Array.from(this.agentProfiles.values());
 
     const activeAgents = allProfiles.filter(
-      (p) => p.currentTaskCount > 0
+      () => undefined
     ).length;
     const idleAgents = allProfiles.filter(
killedBy: ResourceMonitor Pool Statistics should get pool statistics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] MethodExpression
src/resources/ResourceMonitor.ts:205:24
     const activeAgents = allProfiles.filter(
       (p) => p.currentTaskCount > 0
     ).length;
-    const idleAgents = allProfiles.filter(
-      (p) => p.currentTaskCount === 0
-    ).length;
+    const idleAgents = allProfiles.length;
     const unhealthyAgents = allProfiles.filter(
       (p) => p.healthStatus === "unhealthy"

[Killed] ArrowFunction
src/resources/ResourceMonitor.ts:206:7
       (p) => p.currentTaskCount > 0
     ).length;
     const idleAgents = allProfiles.filter(
-      (p) => p.currentTaskCount === 0
+      () => undefined
     ).length;
     const unhealthyAgents = allProfiles.filter(
killedBy: ResourceMonitor Pool Statistics should track idle agents
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/resources/ResourceMonitor.ts:206:14
       (p) => p.currentTaskCount > 0
     ).length;
     const idleAgents = allProfiles.filter(
-      (p) => p.currentTaskCount === 0
+      (p) => false
     ).length;
     const unhealthyAgents = allProfiles.filter(
killedBy: ResourceMonitor Pool Statistics should track idle agents
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] MethodExpression
src/resources/ResourceMonitor.ts:208:29
     const idleAgents = allProfiles.filter(
       (p) => p.currentTaskCount === 0
     ).length;
-    const unhealthyAgents = allProfiles.filter(
-      (p) => p.healthStatus === "unhealthy"
-    ).length;
+    const unhealthyAgents = allProfiles.length;
 
     const totalCpu = allProfiles.reduce(

[Survived] ArrowFunction
src/resources/ResourceMonitor.ts:209:7
       (p) => p.currentTaskCount === 0
     ).length;
     const unhealthyAgents = allProfiles.filter(
-      (p) => p.healthStatus === "unhealthy"
+      () => undefined
     ).length;
 

[Survived] ConditionalExpression
src/resources/ResourceMonitor.ts:209:14
       (p) => p.currentTaskCount === 0
     ).length;
     const unhealthyAgents = allProfiles.filter(
-      (p) => p.healthStatus === "unhealthy"
+      (p) => true
     ).length;
 

[Survived] ArrowFunction
src/resources/ResourceMonitor.ts:213:7
     ).length;
 
     const totalCpu = allProfiles.reduce(
-      (sum, p) => sum + p.cpuUsage.maximum,
+      () => undefined,
       0
     );

[Survived] ArithmeticOperator
src/resources/ResourceMonitor.ts:213:19
     ).length;
 
     const totalCpu = allProfiles.reduce(
-      (sum, p) => sum + p.cpuUsage.maximum,
+      (sum, p) => sum - p.cpuUsage.maximum,
       0
     );

[Survived] ArithmeticOperator
src/resources/ResourceMonitor.ts:216:52
       (sum, p) => sum + p.cpuUsage.maximum,
       0
     );
-    const usedCpu = allProfiles.reduce((sum, p) => sum + p.cpuUsage.current, 0);
+    const usedCpu = allProfiles.reduce((sum, p) => sum - p.cpuUsage.current, 0);
 
     const totalMemory = allProfiles.reduce(

[Survived] ArrowFunction
src/resources/ResourceMonitor.ts:216:40
       (sum, p) => sum + p.cpuUsage.maximum,
       0
     );
-    const usedCpu = allProfiles.reduce((sum, p) => sum + p.cpuUsage.current, 0);
+    const usedCpu = allProfiles.reduce(() => undefined, 0);
 
     const totalMemory = allProfiles.reduce(

[Survived] ArrowFunction
src/resources/ResourceMonitor.ts:219:7
     const usedCpu = allProfiles.reduce((sum, p) => sum + p.cpuUsage.current, 0);
 
     const totalMemory = allProfiles.reduce(
-      (sum, p) => sum + p.memoryUsage.maximum,
+      () => undefined,
       0
     );

[Survived] ArithmeticOperator
src/resources/ResourceMonitor.ts:219:19
     const usedCpu = allProfiles.reduce((sum, p) => sum + p.cpuUsage.current, 0);
 
     const totalMemory = allProfiles.reduce(
-      (sum, p) => sum + p.memoryUsage.maximum,
+      (sum, p) => sum - p.memoryUsage.maximum,
       0
     );

[Survived] ArithmeticOperator
src/resources/ResourceMonitor.ts:223:19
       0
     );
     const usedMemory = allProfiles.reduce(
-      (sum, p) => sum + p.memoryUsage.current,
+      (sum, p) => sum - p.memoryUsage.current,
       0
     );

[Survived] ArrowFunction
src/resources/ResourceMonitor.ts:223:7
       0
     );
     const usedMemory = allProfiles.reduce(
-      (sum, p) => sum + p.memoryUsage.current,
+      () => undefined,
       0
     );

[Killed] ArrowFunction
src/resources/ResourceMonitor.ts:228:7
     );
 
     const totalTasks = allProfiles.reduce(
-      (sum, p) => sum + p.currentTaskCount,
+      () => undefined,
       0
     );
killedBy: ResourceMonitor Pool Statistics should get pool statistics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ArithmeticOperator
src/resources/ResourceMonitor.ts:228:19
     );
 
     const totalTasks = allProfiles.reduce(
-      (sum, p) => sum + p.currentTaskCount,
+      (sum, p) => sum - p.currentTaskCount,
       0
     );
killedBy: ResourceMonitor Pool Statistics should get pool statistics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -3

[Survived] EqualityOperator
src/resources/ResourceMonitor.ts:236:7
       .map((p) => p.avgTaskCompletionMs)
       .filter((t) => t !== undefined) as number[];
     const avgCompletion =
-      completionTimes.length > 0
+      completionTimes.length <= 0
         ? completionTimes.reduce((sum, t) => sum + t, 0) /
           completionTimes.length

[Survived] ConditionalExpression
src/resources/ResourceMonitor.ts:236:7
       .map((p) => p.avgTaskCompletionMs)
       .filter((t) => t !== undefined) as number[];
     const avgCompletion =
-      completionTimes.length > 0
+      false
         ? completionTimes.reduce((sum, t) => sum + t, 0) /
           completionTimes.length

[NoCoverage] ArithmeticOperator
src/resources/ResourceMonitor.ts:237:46
       .filter((t) => t !== undefined) as number[];
     const avgCompletion =
       completionTimes.length > 0
-        ? completionTimes.reduce((sum, t) => sum + t, 0) /
+        ? completionTimes.reduce((sum, t) => sum - t, 0) /
           completionTimes.length
         : 0;

[NoCoverage] ArrowFunction
src/resources/ResourceMonitor.ts:237:34
       .filter((t) => t !== undefined) as number[];
     const avgCompletion =
       completionTimes.length > 0
-        ? completionTimes.reduce((sum, t) => sum + t, 0) /
+        ? completionTimes.reduce(() => undefined, 0) /
           completionTimes.length
         : 0;

[Killed] ObjectLiteral
src/resources/ResourceMonitor.ts:241:12
           completionTimes.length
         : 0;
 
-    return {
-      totalAgents: allProfiles.length,
-      activeAgents,
-      idleAgents,
-      unhealthyAgents,
-      totalCpuCapacity: totalCpu,
-      usedCpuCapacity: usedCpu,
-      totalMemoryCapacity: totalMemory,
-      usedMemoryCapacity: usedMemory,
-      tasksInProgress: totalTasks,
-      avgTaskCompletionMs: avgCompletion,
-      lastUpdated: new Date(),
-    };
+    return {};
   }
 
killedBy: AdaptiveResourceManager Statistics should get pool statistics
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Matcher error: received value must be a number or bigint

Received has value: undefined

[Killed] BlockStatement
src/resources/ResourceMonitor.ts:262:76
    * @param agentId Agent identifier
    * @param taskCount Current task count
    */
-  async updateTaskCount(agentId: string, taskCount: number): Promise<void> {
-    const profile = this.agentProfiles.get(agentId);
-    if (profile) {
-      profile.currentTaskCount = taskCount;
-      profile.lastUpdated = new Date();
-    }
-  }
+  async updateTaskCount(agentId: string, taskCount: number): Promise<void> {}
 
   /**
killedBy: ResourceMonitor Resource Tracking should update task count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/resources/ResourceMonitor.ts:264:9
    */
   async updateTaskCount(agentId: string, taskCount: number): Promise<void> {
     const profile = this.agentProfiles.get(agentId);
-    if (profile) {
+    if (false) {
       profile.currentTaskCount = taskCount;
       profile.lastUpdated = new Date();
killedBy: ResourceMonitor Resource Tracking should update task count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/resources/ResourceMonitor.ts:264:18
    */
   async updateTaskCount(agentId: string, taskCount: number): Promise<void> {
     const profile = this.agentProfiles.get(agentId);
-    if (profile) {
-      profile.currentTaskCount = taskCount;
-      profile.lastUpdated = new Date();
-    }
+    if (profile) {}
   }
 
killedBy: ResourceMonitor Resource Tracking should update task count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[NoCoverage] BlockStatement
src/resources/ResourceMonitor.ts:279:20
   async updateTaskCompletionTime(
     agentId: string,
     completionMs: number
-  ): Promise<void> {
-    const profile = this.agentProfiles.get(agentId);
-    if (profile) {
-      profile.avgTaskCompletionMs = completionMs;
-      profile.lastUpdated = new Date();
-    }
-  }
+  ): Promise<void> {}
 
   /**

[NoCoverage] ConditionalExpression
src/resources/ResourceMonitor.ts:281:9
     completionMs: number
   ): Promise<void> {
     const profile = this.agentProfiles.get(agentId);
-    if (profile) {
+    if (true) {
       profile.avgTaskCompletionMs = completionMs;
       profile.lastUpdated = new Date();

[Killed] BlockStatement
src/resources/ResourceMonitor.ts:292:53
    *
    * @param agentId Agent identifier
    */
-  async removeAgent(agentId: string): Promise<void> {
-    this.agentProfiles.delete(agentId);
-    this.logger.info("Agent removed from monitoring", { agentId });
-  }
+  async removeAgent(agentId: string): Promise<void> {}
 
   /**
killedBy: ResourceMonitor Agent Management should remove agent
statusReason: Error: expect(received).toBeNull()

[NoCoverage] BlockStatement
src/resources/ResourceMonitor.ts:300:38
   /**
    * Get configuration
    */
-  getConfig(): ResourceMonitorConfig {
-    return { ...this.config };
-  }
+  getConfig(): ResourceMonitorConfig {}
 
   /**

[NoCoverage] BlockStatement
src/resources/ResourceMonitor.ts:307:62
   /**
    * Update configuration
    */
-  updateConfig(config: Partial<ResourceMonitorConfig>): void {
-    this.config = { ...this.config, ...config };
-    this.logger.info("Configuration updated", this.config);
-  }
+  updateConfig(config: Partial<ResourceMonitorConfig>): void {}
 
   /**

[NoCoverage] ObjectLiteral
src/resources/ResourceMonitor.ts:308:19
    * Update configuration
    */
   updateConfig(config: Partial<ResourceMonitorConfig>): void {
-    this.config = { ...this.config, ...config };
+    this.config = {};
     this.logger.info("Configuration updated", this.config);
   }

[Killed] BlockStatement
src/resources/ResourceMonitor.ts:357:43
    */
   private computeHealthStatus(
     profile: AgentResourceProfile
-  ): "healthy" | "degraded" | "unhealthy" {
-    const cpuPercent = profile.cpuUsage.usagePercent;
-    const memoryPercent = profile.memoryUsage.usagePercent;
-
-    // Check critical thresholds
-    if (
-      cpuPercent >= this.config.cpuThresholds.critical ||
-      memoryPercent >= this.config.memoryThresholds.critical
-    ) {
-      return "unhealthy";
-    }
-
-    // Check warning thresholds
-    if (
-      cpuPercent >= this.config.cpuThresholds.warning ||
-      memoryPercent >= this.config.memoryThresholds.warning
-    ) {
-      return "degraded";
-    }
-
-    return "healthy";
-  }
+  ): "healthy" | "degraded" | "unhealthy" {}
 
   /**
killedBy: ResourceMonitor Health Status should compute healthy status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "healthy"
Received: undefined

[Killed] ConditionalExpression
src/resources/ResourceMonitor.ts:363:7
 
     // Check critical thresholds
     if (
-      cpuPercent >= this.config.cpuThresholds.critical ||
-      memoryPercent >= this.config.memoryThresholds.critical
+      false
     ) {
       return "unhealthy";
killedBy: ResourceMonitor Health Status should detect unhealthy status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "unhealthy"
Received: "degraded"

[Killed] ConditionalExpression
src/resources/ResourceMonitor.ts:363:7
 
     // Check critical thresholds
     if (
-      cpuPercent >= this.config.cpuThresholds.critical ||
+      false ||
       memoryPercent >= this.config.memoryThresholds.critical
     ) {
killedBy: ResourceMonitor Health Status should detect unhealthy status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "unhealthy"
Received: "degraded"

[Killed] EqualityOperator
src/resources/ResourceMonitor.ts:364:7
     // Check critical thresholds
     if (
       cpuPercent >= this.config.cpuThresholds.critical ||
-      memoryPercent >= this.config.memoryThresholds.critical
+      memoryPercent < this.config.memoryThresholds.critical
     ) {
       return "unhealthy";
killedBy: ResourceMonitor Health Status should compute healthy status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "healthy"
Received: "unhealthy"

[Survived] ConditionalExpression
src/resources/ResourceMonitor.ts:364:7
     // Check critical thresholds
     if (
       cpuPercent >= this.config.cpuThresholds.critical ||
-      memoryPercent >= this.config.memoryThresholds.critical
+      false
     ) {
       return "unhealthy";

[Killed] BlockStatement
src/resources/ResourceMonitor.ts:365:7
     if (
       cpuPercent >= this.config.cpuThresholds.critical ||
       memoryPercent >= this.config.memoryThresholds.critical
-    ) {
-      return "unhealthy";
-    }
+    ) {}
 
     // Check warning thresholds
killedBy: ResourceMonitor Health Status should detect unhealthy status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "unhealthy"
Received: "degraded"

[Killed] LogicalOperator
src/resources/ResourceMonitor.ts:371:7
 
     // Check warning thresholds
     if (
-      cpuPercent >= this.config.cpuThresholds.warning ||
-      memoryPercent >= this.config.memoryThresholds.warning
+      cpuPercent >= this.config.cpuThresholds.warning && memoryPercent >= this.config.memoryThresholds.warning
     ) {
       return "degraded";
killedBy: ResourceMonitor Health Status should detect degraded status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "degraded"
Received: "healthy"

[Killed] ConditionalExpression
src/resources/ResourceMonitor.ts:371:7
 
     // Check warning thresholds
     if (
-      cpuPercent >= this.config.cpuThresholds.warning ||
-      memoryPercent >= this.config.memoryThresholds.warning
+      true
     ) {
       return "degraded";
killedBy: ResourceMonitor Health Status should compute healthy status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "healthy"
Received: "degraded"

[Killed] EqualityOperator
src/resources/ResourceMonitor.ts:372:7
     // Check warning thresholds
     if (
       cpuPercent >= this.config.cpuThresholds.warning ||
-      memoryPercent >= this.config.memoryThresholds.warning
+      memoryPercent < this.config.memoryThresholds.warning
     ) {
       return "degraded";
killedBy: ResourceMonitor Health Status should compute healthy status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "healthy"
Received: "degraded"

[Survived] ConditionalExpression
src/resources/ResourceMonitor.ts:372:7
     // Check warning thresholds
     if (
       cpuPercent >= this.config.cpuThresholds.warning ||
-      memoryPercent >= this.config.memoryThresholds.warning
+      false
     ) {
       return "degraded";

[Killed] BlockStatement
src/resources/ResourceMonitor.ts:373:7
     if (
       cpuPercent >= this.config.cpuThresholds.warning ||
       memoryPercent >= this.config.memoryThresholds.warning
-    ) {
-      return "degraded";
-    }
+    ) {}
 
     return "healthy";
killedBy: ResourceMonitor Health Status should detect degraded status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "degraded"
Received: "healthy"

[NoCoverage] BlockStatement
src/resources/ResourceMonitor.ts:383:52
   /**
    * Update health status for all agents
    */
-  private async updateAgentHealth(): Promise<void> {
-    for (const profile of this.agentProfiles.values()) {
-      profile.healthStatus = this.computeHealthStatus(profile);
-    }
-  }
+  private async updateAgentHealth(): Promise<void> {}
 }
 

[NoCoverage] BlockStatement
src/resources/ResourceMonitor.ts:384:56
    * Update health status for all agents
    */
   private async updateAgentHealth(): Promise<void> {
-    for (const profile of this.agentProfiles.values()) {
-      profile.healthStatus = this.computeHealthStatus(profile);
-    }
+    for (const profile of this.agentProfiles.values()) {}
   }
 }
