[Killed] ObjectLiteral
src/optimization/BottleneckDetector.ts:23:56
 /**
  * Default thresholds for bottleneck detection
  */
-const DEFAULT_THRESHOLDS: Record<MetricType, number> = {
-  [MetricType.CPU]: 80, // 80% CPU usage
-  [MetricType.MEMORY]: 85, // 85% memory usage
-  [MetricType.NETWORK]: 75, // 75% network utilization
-  [MetricType.LATENCY]: 1000, // 1000ms latency
-  [MetricType.THROUGHPUT]: 100, // 100 requests/sec minimum
-  [MetricType.ERROR_RATE]: 5, // 5% error rate
-  [MetricType.CACHE_HIT_RATE]: 70, // 70% cache hit rate minimum
-};
+const DEFAULT_THRESHOLDS: Record<MetricType, number> = {};
 
 /**
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   62.94727966872033

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:48:69
   private activeBottlenecks: Map<string, Bottleneck> = new Map();
   private bottleneckHistory: Map<string, Bottleneck[]> = new Map();
 
-  constructor(thresholds: Partial<Record<MetricType, number>> = {}) {
-    this.logger = new Logger("BottleneckDetector");
-    this.thresholds = { ...DEFAULT_THRESHOLDS, ...thresholds };
-  }
+  constructor(thresholds: Partial<Record<MetricType, number>> = {}) {}
 
   /**
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should integrate with SystemHealthMonitor for health metrics
statusReason: TypeError: Cannot read properties of undefined (reading 'debug')

[Killed] ObjectLiteral
src/optimization/BottleneckDetector.ts:50:23
 
   constructor(thresholds: Partial<Record<MetricType, number>> = {}) {
     this.logger = new Logger("BottleneckDetector");
-    this.thresholds = { ...DEFAULT_THRESHOLDS, ...thresholds };
+    this.thresholds = {};
   }
 
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should detect performance bottlenecks from system metrics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:59:80
    * @param metrics Performance metrics to analyze
    * @returns Detected bottlenecks
    */
-  async detectBottlenecks(metrics: PerformanceMetric[]): Promise<Bottleneck[]> {
-    const detectedBottlenecks: Bottleneck[] = [];
-
-    // Group metrics by component and type
-    const metricsByComponent = this.groupMetricsByComponent(metrics);
-
-    for (const [component, componentMetrics] of metricsByComponent) {
-      for (const metric of componentMetrics) {
-        const bottleneck = await this.checkMetricThreshold(component, metric);
-        if (bottleneck) {
-          detectedBottlenecks.push(bottleneck);
-        }
-      }
-    }
-
-    this.logger.debug("Bottleneck detection completed", {
-      metricsAnalyzed: metrics.length,
-      bottlenecksDetected: detectedBottlenecks.length,
-    });
-
-    return detectedBottlenecks;
-  }
+  async detectBottlenecks(metrics: PerformanceMetric[]): Promise<Bottleneck[]> {}
 
   /**
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should integrate with SystemHealthMonitor for health metrics
statusReason: TypeError: bottlenecks is not iterable

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:65:69
     // Group metrics by component and type
     const metricsByComponent = this.groupMetricsByComponent(metrics);
 
-    for (const [component, componentMetrics] of metricsByComponent) {
-      for (const metric of componentMetrics) {
-        const bottleneck = await this.checkMetricThreshold(component, metric);
-        if (bottleneck) {
-          detectedBottlenecks.push(bottleneck);
-        }
-      }
-    }
+    for (const [component, componentMetrics] of metricsByComponent) {}
 
     this.logger.debug("Bottleneck detection completed", {
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should detect performance bottlenecks from system metrics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:66:46
     const metricsByComponent = this.groupMetricsByComponent(metrics);
 
     for (const [component, componentMetrics] of metricsByComponent) {
-      for (const metric of componentMetrics) {
-        const bottleneck = await this.checkMetricThreshold(component, metric);
-        if (bottleneck) {
-          detectedBottlenecks.push(bottleneck);
-        }
-      }
+      for (const metric of componentMetrics) {}
     }
 
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should detect performance bottlenecks from system metrics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/optimization/BottleneckDetector.ts:68:13
     for (const [component, componentMetrics] of metricsByComponent) {
       for (const metric of componentMetrics) {
         const bottleneck = await this.checkMetricThreshold(component, metric);
-        if (bottleneck) {
+        if (false) {
           detectedBottlenecks.push(bottleneck);
         }
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should detect performance bottlenecks from system metrics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/optimization/BottleneckDetector.ts:68:13
     for (const [component, componentMetrics] of metricsByComponent) {
       for (const metric of componentMetrics) {
         const bottleneck = await this.checkMetricThreshold(component, metric);
-        if (bottleneck) {
+        if (true) {
           detectedBottlenecks.push(bottleneck);
         }
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should provide optimization recommendations based on system health
statusReason: TypeError: Cannot read properties of null (reading 'component')

[Survived] ObjectLiteral
src/optimization/BottleneckDetector.ts:74:57
       }
     }
 
-    this.logger.debug("Bottleneck detection completed", {
-      metricsAnalyzed: metrics.length,
-      bottlenecksDetected: detectedBottlenecks.length,
-    });
+    this.logger.debug("Bottleneck detection completed", {});
 
     return detectedBottlenecks;

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:87:75
    *
    * @param thresholds New threshold values
    */
-  updateThresholds(thresholds: Partial<Record<MetricType, number>>): void {
-    this.thresholds = { ...this.thresholds, ...thresholds };
-    this.logger.info("Thresholds updated", this.thresholds);
-  }
+  updateThresholds(thresholds: Partial<Record<MetricType, number>>): void {}
 
   /**
killedBy: BottleneckDetector Threshold Management should update thresholds
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1

[Survived] ObjectLiteral
src/optimization/BottleneckDetector.ts:88:23
    * @param thresholds New threshold values
    */
   updateThresholds(thresholds: Partial<Record<MetricType, number>>): void {
-    this.thresholds = { ...this.thresholds, ...thresholds };
+    this.thresholds = {};
     this.logger.info("Thresholds updated", this.thresholds);
   }

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:97:40
    *
    * @returns Currently active bottlenecks
    */
-  getActiveBottlenecks(): Bottleneck[] {
-    return Array.from(this.activeBottlenecks.values());
-  }
+  getActiveBottlenecks(): Bottleneck[] {}
 
   /**
killedBy: RuntimeOptimizer Integration Error Handling and Graceful Degradation should continue operating when optimization engine is disabled
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:106:66
    *
    * @param olderThan Clear bottlenecks older than this date
    */
-  async clearResolvedBottlenecks(olderThan: Date): Promise<void> {
-    const beforeCount = this.activeBottlenecks.size;
-
-    for (const [key, bottleneck] of this.activeBottlenecks) {
-      if (bottleneck.lastObservedAt < olderThan) {
-        // Move to history before removing
-        const history = this.bottleneckHistory.get(bottleneck.component) ?? [];
-        history.push(bottleneck);
-        this.bottleneckHistory.set(bottleneck.component, history);
-
-        this.activeBottlenecks.delete(key);
-      }
-    }
-
-    const clearedCount = beforeCount - this.activeBottlenecks.size;
-
-    if (clearedCount > 0) {
-      this.logger.debug("Cleared resolved bottlenecks", {
-        clearedCount,
-        remainingCount: this.activeBottlenecks.size,
-      });
-    }
-  }
+  async clearResolvedBottlenecks(olderThan: Date): Promise<void> {}
 
   /**
killedBy: BottleneckDetector Active Bottleneck Management should clear resolved bottlenecks
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:109:61
   async clearResolvedBottlenecks(olderThan: Date): Promise<void> {
     const beforeCount = this.activeBottlenecks.size;
 
-    for (const [key, bottleneck] of this.activeBottlenecks) {
-      if (bottleneck.lastObservedAt < olderThan) {
-        // Move to history before removing
-        const history = this.bottleneckHistory.get(bottleneck.component) ?? [];
-        history.push(bottleneck);
-        this.bottleneckHistory.set(bottleneck.component, history);
-
-        this.activeBottlenecks.delete(key);
-      }
-    }
+    for (const [key, bottleneck] of this.activeBottlenecks) {}
 
     const clearedCount = beforeCount - this.activeBottlenecks.size;
killedBy: BottleneckDetector Active Bottleneck Management should clear resolved bottlenecks
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1

[Killed] ConditionalExpression
src/optimization/BottleneckDetector.ts:110:11
     const beforeCount = this.activeBottlenecks.size;
 
     for (const [key, bottleneck] of this.activeBottlenecks) {
-      if (bottleneck.lastObservedAt < olderThan) {
+      if (false) {
         // Move to history before removing
         const history = this.bottleneckHistory.get(bottleneck.component) ?? [];
killedBy: BottleneckDetector Active Bottleneck Management should clear resolved bottlenecks
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:110:50
     const beforeCount = this.activeBottlenecks.size;
 
     for (const [key, bottleneck] of this.activeBottlenecks) {
-      if (bottleneck.lastObservedAt < olderThan) {
-        // Move to history before removing
-        const history = this.bottleneckHistory.get(bottleneck.component) ?? [];
-        history.push(bottleneck);
-        this.bottleneckHistory.set(bottleneck.component, history);
-
-        this.activeBottlenecks.delete(key);
-      }
+      if (bottleneck.lastObservedAt < olderThan) {}
     }
 
killedBy: BottleneckDetector Active Bottleneck Management should clear resolved bottlenecks
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1

[Killed] LogicalOperator
src/optimization/BottleneckDetector.ts:112:25
     for (const [key, bottleneck] of this.activeBottlenecks) {
       if (bottleneck.lastObservedAt < olderThan) {
         // Move to history before removing
-        const history = this.bottleneckHistory.get(bottleneck.component) ?? [];
+        const history = this.bottleneckHistory.get(bottleneck.component) && [];
         history.push(bottleneck);
         this.bottleneckHistory.set(bottleneck.component, history);
killedBy: BottleneckDetector Active Bottleneck Management should clear resolved bottlenecks
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Survived] ArithmeticOperator
src/optimization/BottleneckDetector.ts:120:26
       }
     }
 
-    const clearedCount = beforeCount - this.activeBottlenecks.size;
+    const clearedCount = beforeCount + this.activeBottlenecks.size;
 
     if (clearedCount > 0) {

[Survived] BlockStatement
src/optimization/BottleneckDetector.ts:122:27
 
     const clearedCount = beforeCount - this.activeBottlenecks.size;
 
-    if (clearedCount > 0) {
-      this.logger.debug("Cleared resolved bottlenecks", {
-        clearedCount,
-        remainingCount: this.activeBottlenecks.size,
-      });
-    }
+    if (clearedCount > 0) {}
   }
 

[Survived] ConditionalExpression
src/optimization/BottleneckDetector.ts:122:9
 
     const clearedCount = beforeCount - this.activeBottlenecks.size;
 
-    if (clearedCount > 0) {
+    if (true) {
       this.logger.debug("Cleared resolved bottlenecks", {
         clearedCount,

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:136:57
    * @param component Component name
    * @returns Historical bottlenecks
    */
-  getBottleneckHistory(component: string): Bottleneck[] {
-    return this.bottleneckHistory.get(component) ?? [];
-  }
+  getBottleneckHistory(component: string): Bottleneck[] {}
 
   /**
killedBy: BottleneckDetector Edge Cases should handle bottleneck history
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] LogicalOperator
src/optimization/BottleneckDetector.ts:137:12
    * @returns Historical bottlenecks
    */
   getBottleneckHistory(component: string): Bottleneck[] {
-    return this.bottleneckHistory.get(component) ?? [];
+    return this.bottleneckHistory.get(component) && [];
   }
 
killedBy: BottleneckDetector Edge Cases should handle bottleneck history
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] EqualityOperator
src/optimization/BottleneckDetector.ts:152:9
     metric: PerformanceMetric
   ): Promise<Bottleneck | null> {
     const threshold = this.thresholds[metric.type];
-    if (threshold === undefined) {
+    if (threshold !== undefined) {
       return null;
     }
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should detect performance bottlenecks from system metrics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/optimization/BottleneckDetector.ts:152:9
     metric: PerformanceMetric
   ): Promise<Bottleneck | null> {
     const threshold = this.thresholds[metric.type];
-    if (threshold === undefined) {
+    if (true) {
       return null;
     }
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should detect performance bottlenecks from system metrics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:158:28
 
     // Check if metric exceeds threshold
     const exceedsThreshold = this.metricsExceedsThreshold(metric, threshold);
-    if (!exceedsThreshold) {
-      return null;
-    }
+    if (!exceedsThreshold) {}
 
     // Generate bottleneck key
killedBy: RuntimeOptimizer Integration End-to-End Optimization Flow should complete full optimization cycle
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 80
Received:   50

[Killed] ConditionalExpression
src/optimization/BottleneckDetector.ts:158:9
 
     // Check if metric exceeds threshold
     const exceedsThreshold = this.metricsExceedsThreshold(metric, threshold);
-    if (!exceedsThreshold) {
+    if (false) {
       return null;
     }
killedBy: RuntimeOptimizer Integration End-to-End Optimization Flow should complete full optimization cycle
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 80
Received:   50

[Killed] ConditionalExpression
src/optimization/BottleneckDetector.ts:168:9
     // Check if bottleneck already exists
     const existingBottleneck = this.activeBottlenecks.get(bottleneckKey);
 
-    if (existingBottleneck) {
+    if (true) {
       // Update existing bottleneck
       existingBottleneck.currentValue = metric.value;
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should detect performance bottlenecks from system metrics
statusReason: TypeError: Cannot set properties of undefined (setting 'currentValue')

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:168:29
     // Check if bottleneck already exists
     const existingBottleneck = this.activeBottlenecks.get(bottleneckKey);
 
-    if (existingBottleneck) {
-      // Update existing bottleneck
-      existingBottleneck.currentValue = metric.value;
-      existingBottleneck.lastObservedAt = metric.timestamp;
-      existingBottleneck.occurrenceCount += 1;
-
-      // Update severity based on occurrence count and value
-      existingBottleneck.severity = this.calculateSeverity(
-        metric,
-        threshold,
-        existingBottleneck.occurrenceCount
-      );
-
-      return existingBottleneck;
-    }
+    if (existingBottleneck) {}
 
     // Create new bottleneck
killedBy: BottleneckDetector Severity Classification should increase severity with occurrence count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "critical"
Received: "low"

[Killed] AssignmentOperator
src/optimization/BottleneckDetector.ts:172:7
       // Update existing bottleneck
       existingBottleneck.currentValue = metric.value;
       existingBottleneck.lastObservedAt = metric.timestamp;
-      existingBottleneck.occurrenceCount += 1;
+      existingBottleneck.occurrenceCount -= 1;
 
       // Update severity based on occurrence count and value
killedBy: BottleneckDetector Severity Classification should increase severity with occurrence count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "critical"
Received: "low"

[Survived] ObjectLiteral
src/optimization/BottleneckDetector.ts:201:49
 
     this.activeBottlenecks.set(bottleneckKey, bottleneck);
 
-    this.logger.warn("New bottleneck detected", {
-      component,
-      metricType: metric.type,
-      severity,
-      currentValue: metric.value,
-      threshold,
-    });
+    this.logger.warn("New bottleneck detected", {});
 
     return bottleneck;

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:222:14
   private metricsExceedsThreshold(
     metric: PerformanceMetric,
     threshold: number
-  ): boolean {
-    // For some metrics, lower is better (e.g., throughput, cache hit rate)
-    if (
-      metric.type === MetricType.THROUGHPUT ||
-      metric.type === MetricType.CACHE_HIT_RATE
-    ) {
-      return metric.value < threshold;
-    }
-
-    // For most metrics, higher is worse (e.g., CPU, memory, latency, error rate)
-    return metric.value > threshold;
-  }
+  ): boolean {}
 
   /**
killedBy: BottleneckDetector Bottleneck Detection should detect CPU bottleneck
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/optimization/BottleneckDetector.ts:225:7
   ): boolean {
     // For some metrics, lower is better (e.g., throughput, cache hit rate)
     if (
-      metric.type === MetricType.THROUGHPUT ||
-      metric.type === MetricType.CACHE_HIT_RATE
+      true
     ) {
       return metric.value < threshold;
killedBy: BottleneckDetector Bottleneck Detection should detect CPU bottleneck
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/optimization/BottleneckDetector.ts:225:7
   ): boolean {
     // For some metrics, lower is better (e.g., throughput, cache hit rate)
     if (
-      metric.type === MetricType.THROUGHPUT ||
-      metric.type === MetricType.CACHE_HIT_RATE
+      false
     ) {
       return metric.value < threshold;
killedBy: BottleneckDetector Bottleneck Detection should detect low throughput bottleneck
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] EqualityOperator
src/optimization/BottleneckDetector.ts:226:7
     // For some metrics, lower is better (e.g., throughput, cache hit rate)
     if (
       metric.type === MetricType.THROUGHPUT ||
-      metric.type === MetricType.CACHE_HIT_RATE
+      metric.type !== MetricType.CACHE_HIT_RATE
     ) {
       return metric.value < threshold;
killedBy: BottleneckDetector Bottleneck Detection should detect CPU bottleneck
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/optimization/BottleneckDetector.ts:226:7
     // For some metrics, lower is better (e.g., throughput, cache hit rate)
     if (
       metric.type === MetricType.THROUGHPUT ||
-      metric.type === MetricType.CACHE_HIT_RATE
+      false
     ) {
       return metric.value < threshold;
killedBy: BottleneckDetector Bottleneck Detection should detect low cache hit rate
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:227:7
     if (
       metric.type === MetricType.THROUGHPUT ||
       metric.type === MetricType.CACHE_HIT_RATE
-    ) {
-      return metric.value < threshold;
-    }
+    ) {}
 
     // For most metrics, higher is worse (e.g., CPU, memory, latency, error rate)
killedBy: BottleneckDetector Bottleneck Detection should detect low throughput bottleneck
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/optimization/BottleneckDetector.ts:228:14
       metric.type === MetricType.THROUGHPUT ||
       metric.type === MetricType.CACHE_HIT_RATE
     ) {
-      return metric.value < threshold;
+      return false;
     }
 
killedBy: BottleneckDetector Bottleneck Detection should detect low throughput bottleneck
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] EqualityOperator
src/optimization/BottleneckDetector.ts:228:14
       metric.type === MetricType.THROUGHPUT ||
       metric.type === MetricType.CACHE_HIT_RATE
     ) {
-      return metric.value < threshold;
+      return metric.value >= threshold;
     }
 
killedBy: BottleneckDetector Bottleneck Detection should detect low throughput bottleneck
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/optimization/BottleneckDetector.ts:232:12
     }
 
     // For most metrics, higher is worse (e.g., CPU, memory, latency, error rate)
-    return metric.value > threshold;
+    return true;
   }
 
killedBy: BottleneckDetector Bottleneck Detection should not detect bottleneck when below threshold
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1

[Killed] EqualityOperator
src/optimization/BottleneckDetector.ts:232:12
     }
 
     // For most metrics, higher is worse (e.g., CPU, memory, latency, error rate)
-    return metric.value > threshold;
+    return metric.value <= threshold;
   }
 
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should detect performance bottlenecks from system metrics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:247:25
     metric: PerformanceMetric,
     threshold: number,
     occurrenceCount: number
-  ): BottleneckSeverity {
-    const deviation = Math.abs((metric.value - threshold) / threshold);
-
-    // Adjust severity based on deviation and occurrence frequency
-    if (deviation >= 0.5 || occurrenceCount >= 10) {
-      return BottleneckSeverity.CRITICAL;
-    } else if (deviation >= 0.3 || occurrenceCount >= 5) {
-      return BottleneckSeverity.HIGH;
-    } else if (deviation >= 0.15 || occurrenceCount >= 3) {
-      return BottleneckSeverity.MEDIUM;
-    } else {
-      return BottleneckSeverity.LOW;
-    }
-  }
+  ): BottleneckSeverity {}
 
   /**
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should detect performance bottlenecks from system metrics
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ArithmeticOperator
src/optimization/BottleneckDetector.ts:248:32
     threshold: number,
     occurrenceCount: number
   ): BottleneckSeverity {
-    const deviation = Math.abs((metric.value - threshold) / threshold);
+    const deviation = Math.abs((metric.value - threshold) * threshold);
 
     // Adjust severity based on deviation and occurrence frequency
killedBy: BottleneckDetector Severity Classification should classify high severity for moderate deviation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "high"
Received: "critical"

[Killed] ArithmeticOperator
src/optimization/BottleneckDetector.ts:248:33
     threshold: number,
     occurrenceCount: number
   ): BottleneckSeverity {
-    const deviation = Math.abs((metric.value - threshold) / threshold);
+    const deviation = Math.abs((metric.value + threshold) / threshold);
 
     // Adjust severity based on deviation and occurrence frequency
killedBy: BottleneckDetector Severity Classification should classify high severity for moderate deviation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "high"
Received: "critical"

[Killed] ConditionalExpression
src/optimization/BottleneckDetector.ts:251:29
     const deviation = Math.abs((metric.value - threshold) / threshold);
 
     // Adjust severity based on deviation and occurrence frequency
-    if (deviation >= 0.5 || occurrenceCount >= 10) {
+    if (deviation >= 0.5 || false) {
       return BottleneckSeverity.CRITICAL;
     } else if (deviation >= 0.3 || occurrenceCount >= 5) {
killedBy: BottleneckDetector Severity Classification should increase severity with occurrence count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "critical"
Received: "high"

[Killed] EqualityOperator
src/optimization/BottleneckDetector.ts:251:9
     const deviation = Math.abs((metric.value - threshold) / threshold);
 
     // Adjust severity based on deviation and occurrence frequency
-    if (deviation >= 0.5 || occurrenceCount >= 10) {
+    if (deviation < 0.5 || occurrenceCount >= 10) {
       return BottleneckSeverity.CRITICAL;
     } else if (deviation >= 0.3 || occurrenceCount >= 5) {
killedBy: BottleneckDetector Severity Classification should classify critical severity for high deviation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "critical"
Received: "high"

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:253:58
     // Adjust severity based on deviation and occurrence frequency
     if (deviation >= 0.5 || occurrenceCount >= 10) {
       return BottleneckSeverity.CRITICAL;
-    } else if (deviation >= 0.3 || occurrenceCount >= 5) {
-      return BottleneckSeverity.HIGH;
-    } else if (deviation >= 0.15 || occurrenceCount >= 3) {
+    } else if (deviation >= 0.3 || occurrenceCount >= 5) {} else if (deviation >= 0.15 || occurrenceCount >= 3) {
       return BottleneckSeverity.MEDIUM;
     } else {
killedBy: BottleneckDetector Severity Classification should classify high severity for moderate deviation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "high"
Received: undefined

[Killed] ConditionalExpression
src/optimization/BottleneckDetector.ts:253:16
     // Adjust severity based on deviation and occurrence frequency
     if (deviation >= 0.5 || occurrenceCount >= 10) {
       return BottleneckSeverity.CRITICAL;
-    } else if (deviation >= 0.3 || occurrenceCount >= 5) {
+    } else if (true) {
       return BottleneckSeverity.HIGH;
     } else if (deviation >= 0.15 || occurrenceCount >= 3) {
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   43.52936402704767

[Killed] EqualityOperator
src/optimization/BottleneckDetector.ts:255:37
       return BottleneckSeverity.CRITICAL;
     } else if (deviation >= 0.3 || occurrenceCount >= 5) {
       return BottleneckSeverity.HIGH;
-    } else if (deviation >= 0.15 || occurrenceCount >= 3) {
+    } else if (deviation >= 0.15 || occurrenceCount > 3) {
       return BottleneckSeverity.MEDIUM;
     } else {
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   30.828198142414863

[Killed] EqualityOperator
src/optimization/BottleneckDetector.ts:255:37
       return BottleneckSeverity.CRITICAL;
     } else if (deviation >= 0.3 || occurrenceCount >= 5) {
       return BottleneckSeverity.HIGH;
-    } else if (deviation >= 0.15 || occurrenceCount >= 3) {
+    } else if (deviation >= 0.15 || occurrenceCount < 3) {
       return BottleneckSeverity.MEDIUM;
     } else {
killedBy: BottleneckDetector Severity Classification should increase severity with occurrence count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "low"
Received: "medium"

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:257:12
       return BottleneckSeverity.HIGH;
     } else if (deviation >= 0.15 || occurrenceCount >= 3) {
       return BottleneckSeverity.MEDIUM;
-    } else {
-      return BottleneckSeverity.LOW;
-    }
+    } else {}
   }
 
killedBy: BottleneckDetector Bottleneck Detection should detect memory bottleneck
statusReason: Error: expect(received).toBeDefined()

Received: undefined
