[Killed] MethodExpression
src/security/AgentRegistrySecurity.ts:694:24
     const cutoffDate = new Date();
     cutoffDate.setDate(cutoffDate.getDate() - this.config.auditRetentionDays);
 
-    this.auditEvents = this.auditEvents.filter(
-      (event) => event.timestamp >= cutoffDate
-    );
+    this.auditEvents = this.auditEvents;
   }
 
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Configuration and Edge Cases should handle cleanup of old audit events
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:695:18
     cutoffDate.setDate(cutoffDate.getDate() - this.config.auditRetentionDays);
 
     this.auditEvents = this.auditEvents.filter(
-      (event) => event.timestamp >= cutoffDate
+      (event) => true
     );
   }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Configuration and Edge Cases should handle cleanup of old audit events
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/security/AgentRegistrySecurity.ts:695:7
     cutoffDate.setDate(cutoffDate.getDate() - this.config.auditRetentionDays);
 
     this.auditEvents = this.auditEvents.filter(
-      (event) => event.timestamp >= cutoffDate
+      () => undefined
     );
   }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Configuration and Edge Cases should handle cleanup of old audit events
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] MethodExpression
src/security/AgentRegistrySecurity.ts:709:24
     authzFailures: number;
     rateLimitHits: number;
   } {
-    const violations = this.auditEvents.filter(
-      (e) => e.eventType === AuditEventType.SECURITY_VIOLATION
-    ).length;
+    const violations = this.auditEvents.length;
     const authFailures = this.auditEvents.filter(
       (e) => e.eventType === AuditEventType.AUTHENTICATION_FAILURE

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:710:14
     rateLimitHits: number;
   } {
     const violations = this.auditEvents.filter(
-      (e) => e.eventType === AuditEventType.SECURITY_VIOLATION
+      (e) => false
     ).length;
     const authFailures = this.auditEvents.filter(
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Security Statistics should track security statistics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ArrowFunction
src/security/AgentRegistrySecurity.ts:710:7
     rateLimitHits: number;
   } {
     const violations = this.auditEvents.filter(
-      (e) => e.eventType === AuditEventType.SECURITY_VIOLATION
+      () => undefined
     ).length;
     const authFailures = this.auditEvents.filter(
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Security Statistics should track security statistics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] MethodExpression
src/security/AgentRegistrySecurity.ts:712:26
     const violations = this.auditEvents.filter(
       (e) => e.eventType === AuditEventType.SECURITY_VIOLATION
     ).length;
-    const authFailures = this.auditEvents.filter(
-      (e) => e.eventType === AuditEventType.AUTHENTICATION_FAILURE
-    ).length;
+    const authFailures = this.auditEvents.length;
     const authzFailures = this.auditEvents.filter(
       (e) => e.eventType === AuditEventType.AUTHORIZATION_FAILURE

[Killed] ArrowFunction
src/security/AgentRegistrySecurity.ts:713:7
       (e) => e.eventType === AuditEventType.SECURITY_VIOLATION
     ).length;
     const authFailures = this.auditEvents.filter(
-      (e) => e.eventType === AuditEventType.AUTHENTICATION_FAILURE
+      () => undefined
     ).length;
     const authzFailures = this.auditEvents.filter(
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Security Statistics should track security statistics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:713:14
       (e) => e.eventType === AuditEventType.SECURITY_VIOLATION
     ).length;
     const authFailures = this.auditEvents.filter(
-      (e) => e.eventType === AuditEventType.AUTHENTICATION_FAILURE
+      (e) => false
     ).length;
     const authzFailures = this.auditEvents.filter(
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Security Statistics should track security statistics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] MethodExpression
src/security/AgentRegistrySecurity.ts:715:27
     const authFailures = this.auditEvents.filter(
       (e) => e.eventType === AuditEventType.AUTHENTICATION_FAILURE
     ).length;
-    const authzFailures = this.auditEvents.filter(
-      (e) => e.eventType === AuditEventType.AUTHORIZATION_FAILURE
-    ).length;
+    const authzFailures = this.auditEvents.length;
 
     // Count rate limit hits from cache (simplified)

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:716:14
       (e) => e.eventType === AuditEventType.AUTHENTICATION_FAILURE
     ).length;
     const authzFailures = this.auditEvents.filter(
-      (e) => e.eventType === AuditEventType.AUTHORIZATION_FAILURE
+      (e) => e.eventType !== AuditEventType.AUTHORIZATION_FAILURE
     ).length;
 
killedBy: AgentRegistrySecurity Security Statistics should provide security statistics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ArrowFunction
src/security/AgentRegistrySecurity.ts:716:7
       (e) => e.eventType === AuditEventType.AUTHENTICATION_FAILURE
     ).length;
     const authzFailures = this.auditEvents.filter(
-      (e) => e.eventType === AuditEventType.AUTHORIZATION_FAILURE
+      () => undefined
     ).length;
 
killedBy: AgentRegistrySecurity Security Statistics should provide security statistics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:721:49
 
     // Count rate limit hits from cache (simplified)
     let rateLimitHits = 0;
-    for (const [, data] of this.rateLimitCache) {
-      if (data.count >= this.config.rateLimitMaxRequests) {
-        rateLimitHits++;
-      }
-    }
+    for (const [, data] of this.rateLimitCache) {}
 
     return {
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Security Statistics should track rate limit hits
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:722:11
     // Count rate limit hits from cache (simplified)
     let rateLimitHits = 0;
     for (const [, data] of this.rateLimitCache) {
-      if (data.count >= this.config.rateLimitMaxRequests) {
+      if (data.count > this.config.rateLimitMaxRequests) {
         rateLimitHits++;
       }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Security Statistics should track rate limit hits
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:722:11
     // Count rate limit hits from cache (simplified)
     let rateLimitHits = 0;
     for (const [, data] of this.rateLimitCache) {
-      if (data.count >= this.config.rateLimitMaxRequests) {
+      if (data.count < this.config.rateLimitMaxRequests) {
         rateLimitHits++;
       }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Security Statistics should track rate limit hits
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] UpdateOperator
src/security/AgentRegistrySecurity.ts:723:9
     let rateLimitHits = 0;
     for (const [, data] of this.rateLimitCache) {
       if (data.count >= this.config.rateLimitMaxRequests) {
-        rateLimitHits++;
+        rateLimitHits--;
       }
     }
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Security Statistics should track rate limit hits
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   -1

[Killed] ObjectLiteral
src/security/AgentRegistrySecurity.ts:727:12
       }
     }
 
-    return {
-      totalAuditEvents: this.auditEvents.length,
-      securityViolations: violations,
-      authFailures,
-      authzFailures,
-      rateLimitHits,
-    };
+    return {};
   }
 
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) Security Statistics should track security statistics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Matcher error: received value must be a number or bigint

Received has value: undefined

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:740:9
    * Validate JWT token and return decoded payload
    */
   private async validateJwtToken(token: string): Promise<any> {
-    try {
-      // Verify JWT token
-      // Note: JWT library expects single string or specific tuple format for audience
-      const verifyOptions: jwt.VerifyOptions = {
-        issuer: this.config.jwtIssuer,
-        algorithms: ["HS256"], // Use HS256 for HMAC
-      };
-
-      // Add audience if configured - convert array to proper format
-      if (this.config.jwtAudience && this.config.jwtAudience.length > 0) {
-        // For single audience, pass as string
-        // For multiple audiences, pass first one (JWT library validates against any match)
-        verifyOptions.audience =
-          this.config.jwtAudience.length === 1
-            ? this.config.jwtAudience[0]
-            : (this.config.jwtAudience as any); // Type assertion for array validation
-      }
-
-      const decoded = jwt.verify(token, this.config.jwtSecret!, verifyOptions);
-
-      return decoded;
-    } catch (error) {
+    try {} catch (error) {
       if (error instanceof jwt.JsonWebTokenError) {
         throw new Error(`Invalid JWT token: ${error.message}`);
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ObjectLiteral
src/security/AgentRegistrySecurity.ts:743:48
     try {
       // Verify JWT token
       // Note: JWT library expects single string or specific tuple format for audience
-      const verifyOptions: jwt.VerifyOptions = {
-        issuer: this.config.jwtIssuer,
-        algorithms: ["HS256"], // Use HS256 for HMAC
-      };
+      const verifyOptions: jwt.VerifyOptions = {};
 
       // Add audience if configured - convert array to proper format
killedBy: AgentRegistrySecurity JWT Token Validation should reject token with invalid issuer
statusReason: Error: expect(received).toBeNull()

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:749:74
       };
 
       // Add audience if configured - convert array to proper format
-      if (this.config.jwtAudience && this.config.jwtAudience.length > 0) {
-        // For single audience, pass as string
-        // For multiple audiences, pass first one (JWT library validates against any match)
-        verifyOptions.audience =
-          this.config.jwtAudience.length === 1
-            ? this.config.jwtAudience[0]
-            : (this.config.jwtAudience as any); // Type assertion for array validation
-      }
+      if (this.config.jwtAudience && this.config.jwtAudience.length > 0) {}
 
       const decoded = jwt.verify(token, this.config.jwtSecret!, verifyOptions);
killedBy: AgentRegistrySecurity JWT Token Validation should reject token with invalid audience
statusReason: Error: expect(received).toBeNull()

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:749:38
       };
 
       // Add audience if configured - convert array to proper format
-      if (this.config.jwtAudience && this.config.jwtAudience.length > 0) {
+      if (this.config.jwtAudience && this.config.jwtAudience.length <= 0) {
         // For single audience, pass as string
         // For multiple audiences, pass first one (JWT library validates against any match)
killedBy: AgentRegistrySecurity JWT Token Validation should reject token with invalid audience
statusReason: Error: expect(received).toBeNull()

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:753:11
         // For single audience, pass as string
         // For multiple audiences, pass first one (JWT library validates against any match)
         verifyOptions.audience =
-          this.config.jwtAudience.length === 1
+          this.config.jwtAudience.length !== 1
             ? this.config.jwtAudience[0]
             : (this.config.jwtAudience as any); // Type assertion for array validation
killedBy: AgentRegistrySecurity JWT Token Validation should handle multiple valid audiences
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:753:11
         // For single audience, pass as string
         // For multiple audiences, pass first one (JWT library validates against any match)
         verifyOptions.audience =
-          this.config.jwtAudience.length === 1
+          true
             ? this.config.jwtAudience[0]
             : (this.config.jwtAudience as any); // Type assertion for array validation
killedBy: AgentRegistrySecurity JWT Token Validation should handle multiple valid audiences
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Survived] BlockStatement
src/security/AgentRegistrySecurity.ts:761:21
       const decoded = jwt.verify(token, this.config.jwtSecret!, verifyOptions);
 
       return decoded;
-    } catch (error) {
-      if (error instanceof jwt.JsonWebTokenError) {
-        throw new Error(`Invalid JWT token: ${error.message}`);
-      } else if (error instanceof jwt.TokenExpiredError) {
-        throw new Error("JWT token has expired");
-      } else if (error instanceof jwt.NotBeforeError) {
-        throw new Error("JWT token not yet valid");
-      } else {
-        throw new Error(
-          `JWT validation failed: ${
-            error instanceof Error ? error.message : "Unknown error"
-          }`
-        );
-      }
-    }
+    } catch (error) {}
   }
 

[Survived] ConditionalExpression
src/security/AgentRegistrySecurity.ts:762:11
 
       return decoded;
     } catch (error) {
-      if (error instanceof jwt.JsonWebTokenError) {
+      if (false) {
         throw new Error(`Invalid JWT token: ${error.message}`);
       } else if (error instanceof jwt.TokenExpiredError) {

[Survived] BlockStatement
src/security/AgentRegistrySecurity.ts:762:51
 
       return decoded;
     } catch (error) {
-      if (error instanceof jwt.JsonWebTokenError) {
-        throw new Error(`Invalid JWT token: ${error.message}`);
-      } else if (error instanceof jwt.TokenExpiredError) {
+      if (error instanceof jwt.JsonWebTokenError) {} else if (error instanceof jwt.TokenExpiredError) {
         throw new Error("JWT token has expired");
       } else if (error instanceof jwt.NotBeforeError) {

[NoCoverage] ConditionalExpression
src/security/AgentRegistrySecurity.ts:764:18
     } catch (error) {
       if (error instanceof jwt.JsonWebTokenError) {
         throw new Error(`Invalid JWT token: ${error.message}`);
-      } else if (error instanceof jwt.TokenExpiredError) {
+      } else if (true) {
         throw new Error("JWT token has expired");
       } else if (error instanceof jwt.NotBeforeError) {

[NoCoverage] ConditionalExpression
src/security/AgentRegistrySecurity.ts:764:18
     } catch (error) {
       if (error instanceof jwt.JsonWebTokenError) {
         throw new Error(`Invalid JWT token: ${error.message}`);
-      } else if (error instanceof jwt.TokenExpiredError) {
+      } else if (false) {
         throw new Error("JWT token has expired");
       } else if (error instanceof jwt.NotBeforeError) {

[NoCoverage] ConditionalExpression
src/security/AgentRegistrySecurity.ts:766:18
         throw new Error(`Invalid JWT token: ${error.message}`);
       } else if (error instanceof jwt.TokenExpiredError) {
         throw new Error("JWT token has expired");
-      } else if (error instanceof jwt.NotBeforeError) {
+      } else if (true) {
         throw new Error("JWT token not yet valid");
       } else {

[NoCoverage] BlockStatement
src/security/AgentRegistrySecurity.ts:766:55
         throw new Error(`Invalid JWT token: ${error.message}`);
       } else if (error instanceof jwt.TokenExpiredError) {
         throw new Error("JWT token has expired");
-      } else if (error instanceof jwt.NotBeforeError) {
-        throw new Error("JWT token not yet valid");
-      } else {
+      } else if (error instanceof jwt.NotBeforeError) {} else {
         throw new Error(
           `JWT validation failed: ${

[NoCoverage] BlockStatement
src/security/AgentRegistrySecurity.ts:768:14
         throw new Error("JWT token has expired");
       } else if (error instanceof jwt.NotBeforeError) {
         throw new Error("JWT token not yet valid");
-      } else {
-        throw new Error(
-          `JWT validation failed: ${
-            error instanceof Error ? error.message : "Unknown error"
-          }`
-        );
-      }
+      } else {}
     }
   }

[Killed] BlockStatement
src/security/AgentRegistrySecurity.ts:781:69
   /**
    * Create mock security context for development/testing
    */
-  private createMockSecurityContext(token: string): SecurityContext {
-    return {
-      agentId: "mock-agent",
-      userId: this.extractUserFromToken(token) || "mock-user",
-      tenantId: this.extractTenantFromToken(token) || "default-tenant",
-      sessionId: this.generateId(),
-      permissions: ["agent:read", "agent:create", "agent:update"],
-      roles: ["mock-role"],
-      securityLevel: SecurityLevel.INTERNAL,
-      authenticatedAt: new Date(),
-      expiresAt: new Date(Date.now() + 3600000), // 1 hour
-      metadata: {
-        ipAddress: "127.0.0.1",
-        userAgent: "MockAgent/1.0",
-        source: "test",
-      },
-      ipAddress: "127.0.0.1",
-      userAgent: "MockAgent/1.0",
-    };
-  }
+  private createMockSecurityContext(token: string): SecurityContext {}
 
   /**
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should authenticate valid token
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ObjectLiteral
src/security/AgentRegistrySecurity.ts:782:12
    * Create mock security context for development/testing
    */
   private createMockSecurityContext(token: string): SecurityContext {
-    return {
-      agentId: "mock-agent",
-      userId: this.extractUserFromToken(token) || "mock-user",
-      tenantId: this.extractTenantFromToken(token) || "default-tenant",
-      sessionId: this.generateId(),
-      permissions: ["agent:read", "agent:create", "agent:update"],
-      roles: ["mock-role"],
-      securityLevel: SecurityLevel.INTERNAL,
-      authenticatedAt: new Date(),
-      expiresAt: new Date(Date.now() + 3600000), // 1 hour
-      metadata: {
-        ipAddress: "127.0.0.1",
-        userAgent: "MockAgent/1.0",
-        source: "test",
-      },
-      ipAddress: "127.0.0.1",
-      userAgent: "MockAgent/1.0",
-    };
+    return {};
   }
 
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should authenticate valid token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mock-agent"
Received: undefined

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:784:15
   private createMockSecurityContext(token: string): SecurityContext {
     return {
       agentId: "mock-agent",
-      userId: this.extractUserFromToken(token) || "mock-user",
+      userId: true,
       tenantId: this.extractTenantFromToken(token) || "default-tenant",
       sessionId: this.generateId(),
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should authenticate valid token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mock-user"
Received: true

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:784:15
   private createMockSecurityContext(token: string): SecurityContext {
     return {
       agentId: "mock-agent",
-      userId: this.extractUserFromToken(token) || "mock-user",
+      userId: false,
       tenantId: this.extractTenantFromToken(token) || "default-tenant",
       sessionId: this.generateId(),
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should authenticate valid token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mock-user"
Received: false

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:785:17
     return {
       agentId: "mock-agent",
       userId: this.extractUserFromToken(token) || "mock-user",
-      tenantId: this.extractTenantFromToken(token) || "default-tenant",
+      tenantId: true,
       sessionId: this.generateId(),
       permissions: ["agent:read", "agent:create", "agent:update"],
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should authenticate valid token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "default-tenant"
Received: true

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:785:17
     return {
       agentId: "mock-agent",
       userId: this.extractUserFromToken(token) || "mock-user",
-      tenantId: this.extractTenantFromToken(token) || "default-tenant",
+      tenantId: false,
       sessionId: this.generateId(),
       permissions: ["agent:read", "agent:create", "agent:update"],
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should authenticate valid token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "default-tenant"
Received: false

[Killed] ObjectLiteral
src/security/AgentRegistrySecurity.ts:792:17
       securityLevel: SecurityLevel.INTERNAL,
       authenticatedAt: new Date(),
       expiresAt: new Date(Date.now() + 3600000), // 1 hour
-      metadata: {
-        ipAddress: "127.0.0.1",
-        userAgent: "MockAgent/1.0",
-        source: "test",
-      },
+      metadata: {},
       ipAddress: "127.0.0.1",
       userAgent: "MockAgent/1.0",
killedBy: Agent Registry Security - Production Hardening (ARBITER-013) JWT Authentication should create mock security context when JWT disabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test"
Received: undefined

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:807:9
    */
   private validateSecurityContext(context: SecurityContext): boolean {
     // Basic validation
-    if (!context.tenantId || !context.userId || !context.agentId) {
+    if (context.tenantId || !context.userId || !context.agentId) {
       return false;
     }
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:807:30
    */
   private validateSecurityContext(context: SecurityContext): boolean {
     // Basic validation
-    if (!context.tenantId || !context.userId || !context.agentId) {
+    if (!context.tenantId || context.userId || !context.agentId) {
       return false;
     }
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[NoCoverage] BooleanLiteral
src/security/AgentRegistrySecurity.ts:808:14
   private validateSecurityContext(context: SecurityContext): boolean {
     // Basic validation
     if (!context.tenantId || !context.userId || !context.agentId) {
-      return false;
+      return true;
     }
 

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:813:7
 
     // Validate permissions array
     if (
-      !Array.isArray(context.permissions) ||
-      context.permissions.length === 0
+      true
     ) {
       return false;
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] BooleanLiteral
src/security/AgentRegistrySecurity.ts:813:7
 
     // Validate permissions array
     if (
-      !Array.isArray(context.permissions) ||
+      Array.isArray(context.permissions) ||
       context.permissions.length === 0
     ) {
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:814:7
     // Validate permissions array
     if (
       !Array.isArray(context.permissions) ||
-      context.permissions.length === 0
+      context.permissions.length !== 0
     ) {
       return false;
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Survived] ConditionalExpression
src/security/AgentRegistrySecurity.ts:814:7
     // Validate permissions array
     if (
       !Array.isArray(context.permissions) ||
-      context.permissions.length === 0
+      false
     ) {
       return false;

[NoCoverage] BlockStatement
src/security/AgentRegistrySecurity.ts:815:7
     if (
       !Array.isArray(context.permissions) ||
       context.permissions.length === 0
-    ) {
-      return false;
-    }
+    ) {}
 
     // Check for blocked tenants/users

[Killed] OptionalChaining
src/security/AgentRegistrySecurity.ts:820:9
     }
 
     // Check for blocked tenants/users
-    if (this.config.blockedUserIds?.includes(context.userId)) {
+    if (this.config.blockedUserIds.includes(context.userId)) {
       return false;
     }
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:820:9
     }
 
     // Check for blocked tenants/users
-    if (this.config.blockedUserIds?.includes(context.userId)) {
+    if (true) {
       return false;
     }
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[NoCoverage] BooleanLiteral
src/security/AgentRegistrySecurity.ts:821:14
 
     // Check for blocked tenants/users
     if (this.config.blockedUserIds?.includes(context.userId)) {
-      return false;
+      return true;
     }
 

[Killed] LogicalOperator
src/security/AgentRegistrySecurity.ts:825:7
     }
 
     if (
-      this.config.allowedTenantIds &&
-      !this.config.allowedTenantIds.includes(context.tenantId)
+      this.config.allowedTenantIds || !this.config.allowedTenantIds.includes(context.tenantId)
     ) {
       return false;
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/security/AgentRegistrySecurity.ts:825:7
     }
 
     if (
-      this.config.allowedTenantIds &&
-      !this.config.allowedTenantIds.includes(context.tenantId)
+      true
     ) {
       return false;
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[NoCoverage] BooleanLiteral
src/security/AgentRegistrySecurity.ts:826:7
 
     if (
       this.config.allowedTenantIds &&
-      !this.config.allowedTenantIds.includes(context.tenantId)
+      this.config.allowedTenantIds.includes(context.tenantId)
     ) {
       return false;

[NoCoverage] BlockStatement
src/security/AgentRegistrySecurity.ts:827:7
     if (
       this.config.allowedTenantIds &&
       !this.config.allowedTenantIds.includes(context.tenantId)
-    ) {
-      return false;
-    }
+    ) {}
 
     // Check session expiry

[Killed] EqualityOperator
src/security/AgentRegistrySecurity.ts:832:30
     }
 
     // Check session expiry
-    if (context.expiresAt && Date.now() > context.expiresAt.getTime()) {
+    if (context.expiresAt && Date.now() <= context.expiresAt.getTime()) {
       return false;
     }
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] LogicalOperator
src/security/AgentRegistrySecurity.ts:832:9
     }
 
     // Check session expiry
-    if (context.expiresAt && Date.now() > context.expiresAt.getTime()) {
+    if (context.expiresAt || Date.now() > context.expiresAt.getTime()) {
       return false;
     }
killedBy: AgentRegistrySecurity JWT Token Validation should extract tenant ID from JWT token
statusReason: Error: expect(received).toBeTruthy()

Received: null

[NoCoverage] BooleanLiteral
src/security/AgentRegistrySecurity.ts:833:14
 
     // Check session expiry
     if (context.expiresAt && Date.now() > context.expiresAt.getTime()) {
-      return false;
+      return true;
     }
 
