[Survived] LogicalOperator
src/optimization/BottleneckDetector.ts:291:7
     };
 
     const baseImpact =
-      impactMap[metricType] ?? "Performance degradation detected";
+      impactMap[metricType] && "Performance degradation detected";
     const severityPrefix =
       severity === BottleneckSeverity.CRITICAL ||

[Killed] EqualityOperator
src/optimization/BottleneckDetector.ts:293:7
     const baseImpact =
       impactMap[metricType] ?? "Performance degradation detected";
     const severityPrefix =
-      severity === BottleneckSeverity.CRITICAL ||
+      severity !== BottleneckSeverity.CRITICAL ||
       severity === BottleneckSeverity.HIGH
         ? "URGENT: "
killedBy: BottleneckDetector Impact Description should include urgency prefix for critical severity
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "URGENT"
Received string:    "High CPU usage may cause slow response times and task delays in critical-component"

[Killed] LogicalOperator
src/optimization/BottleneckDetector.ts:293:7
     const baseImpact =
       impactMap[metricType] ?? "Performance degradation detected";
     const severityPrefix =
-      severity === BottleneckSeverity.CRITICAL ||
-      severity === BottleneckSeverity.HIGH
+      severity === BottleneckSeverity.CRITICAL && severity === BottleneckSeverity.HIGH
         ? "URGENT: "
         : "";
killedBy: BottleneckDetector Impact Description should include urgency prefix for critical severity
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "URGENT"
Received string:    "High CPU usage may cause slow response times and task delays in critical-component"

[Survived] ConditionalExpression
src/optimization/BottleneckDetector.ts:294:7
       impactMap[metricType] ?? "Performance degradation detected";
     const severityPrefix =
       severity === BottleneckSeverity.CRITICAL ||
-      severity === BottleneckSeverity.HIGH
+      false
         ? "URGENT: "
         : "";

[Survived] EqualityOperator
src/optimization/BottleneckDetector.ts:294:7
       impactMap[metricType] ?? "Performance degradation detected";
     const severityPrefix =
       severity === BottleneckSeverity.CRITICAL ||
-      severity === BottleneckSeverity.HIGH
+      severity !== BottleneckSeverity.HIGH
         ? "URGENT: "
         : "";

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:309:39
    */
   private groupMetricsByComponent(
     metrics: PerformanceMetric[]
-  ): Map<string, PerformanceMetric[]> {
-    const grouped = new Map<string, PerformanceMetric[]>();
-
-    for (const metric of metrics) {
-      const component = metric.source;
-      const componentMetrics = grouped.get(component) ?? [];
-      componentMetrics.push(metric);
-      grouped.set(component, componentMetrics);
-    }
-
-    return grouped;
-  }
+  ): Map<string, PerformanceMetric[]> {}
 }
 
killedBy: RuntimeOptimizer Analysis should perform analysis
statusReason: TypeError: metricsByComponent is not iterable

[Killed] BlockStatement
src/optimization/BottleneckDetector.ts:312:35
   ): Map<string, PerformanceMetric[]> {
     const grouped = new Map<string, PerformanceMetric[]>();
 
-    for (const metric of metrics) {
-      const component = metric.source;
-      const componentMetrics = grouped.get(component) ?? [];
-      componentMetrics.push(metric);
-      grouped.set(component, componentMetrics);
-    }
+    for (const metric of metrics) {}
 
     return grouped;
killedBy: BottleneckDetector Bottleneck Detection should detect CPU bottleneck
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] LogicalOperator
src/optimization/BottleneckDetector.ts:314:32
 
     for (const metric of metrics) {
       const component = metric.source;
-      const componentMetrics = grouped.get(component) ?? [];
+      const componentMetrics = grouped.get(component) && [];
       componentMetrics.push(metric);
       grouped.set(component, componentMetrics);
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should detect performance bottlenecks from system metrics
statusReason: TypeError: Cannot read properties of undefined (reading 'push')
