[Killed] Regex
src/security/CommandValidator.ts:50:3
  */
 const VARIABLE_EXPANSION_PATTERNS = [
   /\$\{[^}]*\}/g, // ${VAR}
-  /\$[A-Z_a-z][A-Z_a-z0-9]*/g, // $VAR (fixed: lowercase allowed at start)
+  /\$[A-Z_a-z][A-Z_a-z0-9]/g, // $VAR (fixed: lowercase allowed at start)
 ];
 
killedBy: TerminalSessionManager createSession should create session with unique ID
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] Regex
src/security/CommandValidator.ts:50:3
  */
 const VARIABLE_EXPANSION_PATTERNS = [
   /\$\{[^}]*\}/g, // ${VAR}
-  /\$[A-Z_a-z][A-Z_a-z0-9]*/g, // $VAR (fixed: lowercase allowed at start)
+  /\$[A-Z_a-z][^A-Z_a-z0-9]*/g, // $VAR (fixed: lowercase allowed at start)
 ];
 
killedBy: TerminalSessionManager createSession should create session with unique ID
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] Regex
src/security/CommandValidator.ts:63:3
   /token/i,
   /credential/i,
   /auth/i,
-  /api[_-]?key/i,
+  /api[^_-]?key/i,
   /aws[_-]?access/i,
   /aws[_-]?secret/i,
killedBy: TerminalSessionManager createSession should create session with unique ID
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] Regex
src/security/CommandValidator.ts:64:3
   /credential/i,
   /auth/i,
   /api[_-]?key/i,
-  /aws[_-]?access/i,
+  /aws[^_-]?access/i,
   /aws[_-]?secret/i,
   /database[_-]?url/i,
killedBy: TerminalSessionManager createSession should create session with unique ID
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] Regex
src/security/CommandValidator.ts:65:3
   /auth/i,
   /api[_-]?key/i,
   /aws[_-]?access/i,
-  /aws[_-]?secret/i,
+  /aws[^_-]?secret/i,
   /database[_-]?url/i,
   /db[_-]?password/i,
killedBy: TerminalSessionManager createSession should create session with unique ID
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] Regex
src/security/CommandValidator.ts:66:3
   /api[_-]?key/i,
   /aws[_-]?access/i,
   /aws[_-]?secret/i,
-  /database[_-]?url/i,
+  /database[_-]url/i,
   /db[_-]?password/i,
   /private[_-]?key/i,
killedBy: TerminalSessionManager createSession should create session with unique ID
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] Regex
src/security/CommandValidator.ts:67:3
   /aws[_-]?access/i,
   /aws[_-]?secret/i,
   /database[_-]?url/i,
-  /db[_-]?password/i,
+  /db[_-]password/i,
   /private[_-]?key/i,
 ];
killedBy: TerminalSessionManager createSession should create session with unique ID
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] ObjectLiteral
src/security/CommandValidator.ts:87:19
   private config: CommandValidatorConfig;
 
   constructor(config: CommandValidatorConfig) {
-    this.config = {
-      allowRelativePaths: true,
-      maxCommandLength: MAX_COMMAND_LENGTH,
-      maxArgLength: MAX_ARG_LENGTH,
-      sensitiveEnvPatterns: SENSITIVE_ENV_PATTERNS.map((p) => p.source),
-      ...config,
-    };
+    this.config = {};
 
     this.allowedCommands = this.loadAllowlist(config.allowlistPath);
killedBy: TerminalSessionManager createSession should create session with unique ID
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] BooleanLiteral
src/security/CommandValidator.ts:88:27
 
   constructor(config: CommandValidatorConfig) {
     this.config = {
-      allowRelativePaths: true,
+      allowRelativePaths: false,
       maxCommandLength: MAX_COMMAND_LENGTH,
       maxArgLength: MAX_ARG_LENGTH,
killedBy: TerminalSessionManager createSession should create session with unique ID
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] ArrowFunction
src/security/CommandValidator.ts:91:56
       allowRelativePaths: true,
       maxCommandLength: MAX_COMMAND_LENGTH,
       maxArgLength: MAX_ARG_LENGTH,
-      sensitiveEnvPatterns: SENSITIVE_ENV_PATTERNS.map((p) => p.source),
+      sensitiveEnvPatterns: SENSITIVE_ENV_PATTERNS.map(() => undefined),
       ...config,
     };
killedBy: TerminalSessionManager createSession should create session with unique ID
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] BlockStatement
src/security/CommandValidator.ts:104:46
    * @param command - Command to check
    * @returns True if command is allowed
    */
-  isCommandAllowed(command: string): boolean {
-    if (!command || typeof command !== "string") {
-      return false;
-    }
-
-    // Trim whitespace
-    command = command.trim();
-
-    if (command.length === 0) {
-      return false;
-    }
-
-    // Check length limit
-    if (command.length > this.config.maxCommandLength!) {
-      return false;
-    }
-
-    // Extract base command from path
-    const baseCommand = this.extractBaseCommand(command);
-
-    // Check against allowlist
-    return this.allowedCommands.has(baseCommand);
-  }
+  isCommandAllowed(command: string): boolean {}
 
   /**
killedBy: TerminalSessionManager executeCommand should execute allowed command and return result
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] ConditionalExpression
src/security/CommandValidator.ts:105:9
    * @returns True if command is allowed
    */
   isCommandAllowed(command: string): boolean {
-    if (!command || typeof command !== "string") {
+    if (false) {
       return false;
     }
killedBy: Command Validator - Production Hardening (ARBITER-013) Command Allowlist Validation should handle null command
statusReason: TypeError: Cannot read properties of null (reading 'trim')

[Killed] BooleanLiteral
src/security/CommandValidator.ts:105:9
    * @returns True if command is allowed
    */
   isCommandAllowed(command: string): boolean {
-    if (!command || typeof command !== "string") {
+    if (command || typeof command !== "string") {
       return false;
     }
killedBy: TerminalSessionManager executeCommand should execute allowed command and return result
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] BooleanLiteral
src/security/CommandValidator.ts:106:14
    */
   isCommandAllowed(command: string): boolean {
     if (!command || typeof command !== "string") {
-      return false;
+      return true;
     }
 
killedBy: Command Validator - Production Hardening (ARBITER-013) Command Allowlist Validation should handle empty command
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
src/security/CommandValidator.ts:110:15
     }
 
     // Trim whitespace
-    command = command.trim();
+    command = command;
 
     if (command.length === 0) {
killedBy: TerminalSessionManager executeCommand should execute allowed command and return result
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] ConditionalExpression
src/security/CommandValidator.ts:112:9
     // Trim whitespace
     command = command.trim();
 
-    if (command.length === 0) {
+    if (false) {
       return false;
     }
killedBy: TerminalSessionManager executeCommand should execute allowed command and return result
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] ConditionalExpression
src/security/CommandValidator.ts:112:9
     // Trim whitespace
     command = command.trim();
 
-    if (command.length === 0) {
+    if (true) {
       return false;
     }
killedBy: TerminalSessionManager executeCommand should execute allowed command and return result
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] BooleanLiteral
src/security/CommandValidator.ts:113:14
     command = command.trim();
 
     if (command.length === 0) {
-      return false;
+      return true;
     }
 
killedBy: CommandValidator isCommandAllowed should handle whitespace
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/CommandValidator.ts:117:9
     }
 
     // Check length limit
-    if (command.length > this.config.maxCommandLength!) {
+    if (false) {
       return false;
     }
killedBy: TerminalSessionManager executeCommand should execute allowed command and return result
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] EqualityOperator
src/security/CommandValidator.ts:117:9
     }
 
     // Check length limit
-    if (command.length > this.config.maxCommandLength!) {
+    if (command.length <= this.config.maxCommandLength!) {
       return false;
     }
killedBy: TerminalSessionManager executeCommand should execute allowed command and return result
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] BooleanLiteral
src/security/CommandValidator.ts:118:14
 
     // Check length limit
     if (command.length > this.config.maxCommandLength!) {
-      return false;
+      return true;
     }
 
killedBy: Command Validator - Production Hardening (ARBITER-013) Edge Cases and Error Handling should handle very long command names
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/security/CommandValidator.ts:136:37
    */
   validateArguments(args?: string[]): SecurityValidationResult {
     // Empty or undefined is valid
-    if (!args || args.length === 0) {
-      return { valid: true };
-    }
+    if (!args || args.length === 0) {}
 
     const issues: string[] = [];
killedBy: Command Validator - Production Hardening (ARBITER-013) Argument Validation should handle null arguments
statusReason: TypeError: args is not iterable

[Killed] ConditionalExpression
src/security/CommandValidator.ts:136:9
    */
   validateArguments(args?: string[]): SecurityValidationResult {
     // Empty or undefined is valid
-    if (!args || args.length === 0) {
+    if (false) {
       return { valid: true };
     }
killedBy: Command Validator - Production Hardening (ARBITER-013) Argument Validation should handle null arguments
statusReason: TypeError: args is not iterable

[Killed] BooleanLiteral
src/security/CommandValidator.ts:137:23
   validateArguments(args?: string[]): SecurityValidationResult {
     // Empty or undefined is valid
     if (!args || args.length === 0) {
-      return { valid: true };
+      return { valid: false };
     }
 
killedBy: Command Validator - Production Hardening (ARBITER-013) Argument Validation should handle empty arguments array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/security/CommandValidator.ts:144:51
 
     for (const arg of args) {
       // Check argument length
-      if (arg.length > this.config.maxArgLength!) {
-        return {
-          valid: false,
-          error: `Argument too long (max ${this.config.maxArgLength} chars)`,
-          reason: "Length limit exceeded",
-        };
-      }
+      if (arg.length > this.config.maxArgLength!) {}
 
       // Check for command substitution (more specific patterns first)
killedBy: Command Validator - Production Hardening (ARBITER-013) Argument Validation should block arguments that are too long
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/CommandValidator.ts:144:11
 
     for (const arg of args) {
       // Check argument length
-      if (arg.length > this.config.maxArgLength!) {
+      if (false) {
         return {
           valid: false,
killedBy: Command Validator - Production Hardening (ARBITER-013) Argument Validation should block arguments that are too long
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/security/CommandValidator.ts:153:60
       }
 
       // Check for command substitution (more specific patterns first)
-      for (const pattern of COMMAND_SUBSTITUTION_PATTERNS) {
-        // Reset regex lastIndex to avoid global flag issues
-        pattern.lastIndex = 0;
-        if (pattern.test(arg)) {
-          return {
-            valid: false,
-            error: "Dangerous command substitution detected",
-            reason: "Potential command injection",
-            issues: [`Matches pattern: ${pattern}`],
-          };
-        }
-      }
+      for (const pattern of COMMAND_SUBSTITUTION_PATTERNS) {}
 
       // Check for variable expansion (more specific patterns first)
killedBy: Command Injection Prevention Shell Metacharacter Detection should block command substitution with backticks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/CommandValidator.ts:156:13
       for (const pattern of COMMAND_SUBSTITUTION_PATTERNS) {
         // Reset regex lastIndex to avoid global flag issues
         pattern.lastIndex = 0;
-        if (pattern.test(arg)) {
+        if (false) {
           return {
             valid: false,
killedBy: Command Validator - Production Hardening (ARBITER-013) Command Substitution Prevention should block $(command) substitution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/CommandValidator.ts:156:13
       for (const pattern of COMMAND_SUBSTITUTION_PATTERNS) {
         // Reset regex lastIndex to avoid global flag issues
         pattern.lastIndex = 0;
-        if (pattern.test(arg)) {
+        if (true) {
           return {
             valid: false,
killedBy: Command Injection Prevention Shell Metacharacter Detection should block variable expansion with braces
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Dangerous variable expansion"
Received string:    "Dangerous command substitution detected"

[Killed] BlockStatement
src/security/CommandValidator.ts:167:58
       }
 
       // Check for variable expansion (more specific patterns first)
-      for (const pattern of VARIABLE_EXPANSION_PATTERNS) {
-        // Reset regex lastIndex to avoid global flag issues
-        pattern.lastIndex = 0;
-        if (pattern.test(arg)) {
-          return {
-            valid: false,
-            error: "Dangerous variable expansion detected",
-            reason: "Potential variable injection",
-            issues: [`Matches pattern: ${pattern}`],
-          };
-        }
-      }
+      for (const pattern of VARIABLE_EXPANSION_PATTERNS) {}
 
       // Check for dangerous arguments
killedBy: TerminalSessionManager executeCommand should execute allowed command and return result
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] BlockStatement
src/security/CommandValidator.ts:170:32
       for (const pattern of VARIABLE_EXPANSION_PATTERNS) {
         // Reset regex lastIndex to avoid global flag issues
         pattern.lastIndex = 0;
-        if (pattern.test(arg)) {
-          return {
-            valid: false,
-            error: "Dangerous variable expansion detected",
-            reason: "Potential variable injection",
-            issues: [`Matches pattern: ${pattern}`],
-          };
-        }
+        if (pattern.test(arg)) {}
       }
 
killedBy: Command Injection Prevention Shell Metacharacter Detection should block variable expansion with braces
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Dangerous variable expansion"
Received string:    "Dangerous shell metacharacter detected: {"

[Killed] ObjectLiteral
src/security/CommandValidator.ts:171:18
         // Reset regex lastIndex to avoid global flag issues
         pattern.lastIndex = 0;
         if (pattern.test(arg)) {
-          return {
-            valid: false,
-            error: "Dangerous variable expansion detected",
-            reason: "Potential variable injection",
-            issues: [`Matches pattern: ${pattern}`],
-          };
+          return {};
         }
       }
killedBy: Command Injection Prevention Shell Metacharacter Detection should block variable expansion with braces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
src/security/CommandValidator.ts:181:11
       }
 
       // Check for dangerous arguments
-      if (arg === "/" || arg === "/*" || arg === "/**") {
+      if (true) {
         return {
           valid: false,
killedBy: Command Injection Prevention Shell Metacharacter Detection should block shell metacharacter: ;
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Dangerous shell metacharacter"
Received string:    "Dangerous argument detected: root directory deletion"

[Killed] BlockStatement
src/security/CommandValidator.ts:181:57
       }
 
       // Check for dangerous arguments
-      if (arg === "/" || arg === "/*" || arg === "/**") {
-        return {
-          valid: false,
-          error: "Dangerous argument detected: root directory deletion",
-          reason: "Unsafe file system operation",
-          issues: ["Attempting to delete root directory"],
-        };
-      }
+      if (arg === "/" || arg === "/*" || arg === "/**") {}
 
       // Check for shell metacharacters (general patterns last)
killedBy: Command Validator - Production Hardening (ARBITER-013) Command Allowlist Validation should block blocked commands even if in allowlist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/security/CommandValidator.ts:191:52
       }
 
       // Check for shell metacharacters (general patterns last)
-      for (const metachar of SHELL_METACHARACTERS) {
-        if (arg.includes(metachar)) {
-          return {
-            valid: false,
-            error: `Dangerous shell metacharacter detected: ${metachar}`,
-            reason: "Shell injection attempt",
-            issues: [`Contains metacharacter: ${metachar}`],
-          };
-        }
-      }
+      for (const metachar of SHELL_METACHARACTERS) {}
     }
 
killedBy: CommandValidator validateArguments should reject semicolon (command chaining)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/security/CommandValidator.ts:192:37
 
       // Check for shell metacharacters (general patterns last)
       for (const metachar of SHELL_METACHARACTERS) {
-        if (arg.includes(metachar)) {
-          return {
-            valid: false,
-            error: `Dangerous shell metacharacter detected: ${metachar}`,
-            reason: "Shell injection attempt",
-            issues: [`Contains metacharacter: ${metachar}`],
-          };
-        }
+        if (arg.includes(metachar)) {}
       }
     }
killedBy: Command Injection Prevention Shell Metacharacter Detection should block shell metacharacter: ;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/security/CommandValidator.ts:192:13
 
       // Check for shell metacharacters (general patterns last)
       for (const metachar of SHELL_METACHARACTERS) {
-        if (arg.includes(metachar)) {
+        if (false) {
           return {
             valid: false,
killedBy: Command Validator - Production Hardening (ARBITER-013) Argument Validation should handle arguments with non-string values
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BlockStatement
src/security/CommandValidator.ts:212:77
    * @param env - Environment variables to sanitize
    * @returns Sanitized environment variables
    */
-  sanitizeEnvironment(env?: Record<string, string>): Record<string, string> {
-    if (!env) {
-      return {};
-    }
-
-    const sanitized: Record<string, string> = {};
-    const patterns = this.config.sensitiveEnvPatterns!.map(
-      (p) => new RegExp(p, "i")
-    );
-
-    for (const [key, value] of Object.entries(env)) {
-      // Check if key matches any sensitive pattern
-      const isSensitive = patterns.some((pattern) => pattern.test(key));
-
-      // Preserve CAWS-specific variables
-      const isCawsVar = key.startsWith("CAWS_");
-
-      if (!isSensitive || isCawsVar) {
-        sanitized[key] = value;
-      }
-    }
-
-    return sanitized;
-  }
+  sanitizeEnvironment(env?: Record<string, string>): Record<string, string> {}
 
   /**
killedBy: Command Validator - Production Hardening (ARBITER-013) Environment Sanitization should sanitize environment variables
statusReason: TypeError: Cannot read properties of undefined (reading 'PATH')

[Killed] ConditionalExpression
src/security/CommandValidator.ts:213:9
    * @returns Sanitized environment variables
    */
   sanitizeEnvironment(env?: Record<string, string>): Record<string, string> {
-    if (!env) {
+    if (false) {
       return {};
     }
killedBy: TerminalSessionManager createSession should create session with unique ID
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] ConditionalExpression
src/security/CommandValidator.ts:213:9
    * @returns Sanitized environment variables
    */
   sanitizeEnvironment(env?: Record<string, string>): Record<string, string> {
-    if (!env) {
+    if (true) {
       return {};
     }
killedBy: TerminalSessionManager createSession should create session with unique ID
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] ArrowFunction
src/security/CommandValidator.ts:219:7
 
     const sanitized: Record<string, string> = {};
     const patterns = this.config.sensitiveEnvPatterns!.map(
-      (p) => new RegExp(p, "i")
+      () => undefined
     );
 
killedBy: TerminalSessionManager createSession should merge environment variables with CAWS variables
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] BlockStatement
src/security/CommandValidator.ts:222:53
       (p) => new RegExp(p, "i")
     );
 
-    for (const [key, value] of Object.entries(env)) {
-      // Check if key matches any sensitive pattern
-      const isSensitive = patterns.some((pattern) => pattern.test(key));
-
-      // Preserve CAWS-specific variables
-      const isCawsVar = key.startsWith("CAWS_");
-
-      if (!isSensitive || isCawsVar) {
-        sanitized[key] = value;
-      }
-    }
+    for (const [key, value] of Object.entries(env)) {}
 
     return sanitized;
killedBy: TerminalSessionManager createSession should merge environment variables with CAWS variables
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] MethodExpression
src/security/CommandValidator.ts:224:27
 
     for (const [key, value] of Object.entries(env)) {
       // Check if key matches any sensitive pattern
-      const isSensitive = patterns.some((pattern) => pattern.test(key));
+      const isSensitive = patterns.every(pattern => pattern.test(key));
 
       // Preserve CAWS-specific variables
killedBy: TerminalSessionManager createSession should merge environment variables with CAWS variables
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] ArrowFunction
src/security/CommandValidator.ts:224:41
 
     for (const [key, value] of Object.entries(env)) {
       // Check if key matches any sensitive pattern
-      const isSensitive = patterns.some((pattern) => pattern.test(key));
+      const isSensitive = patterns.some(() => undefined);
 
       // Preserve CAWS-specific variables
killedBy: TerminalSessionManager createSession should merge environment variables with CAWS variables
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] MethodExpression
src/security/CommandValidator.ts:227:25
       const isSensitive = patterns.some((pattern) => pattern.test(key));
 
       // Preserve CAWS-specific variables
-      const isCawsVar = key.startsWith("CAWS_");
+      const isCawsVar = key.endsWith("CAWS_");
 
       if (!isSensitive || isCawsVar) {
killedBy: TerminalSessionManager createSession should merge environment variables with CAWS variables
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] ConditionalExpression
src/security/CommandValidator.ts:229:11
       // Preserve CAWS-specific variables
       const isCawsVar = key.startsWith("CAWS_");
 
-      if (!isSensitive || isCawsVar) {
+      if (false) {
         sanitized[key] = value;
       }
killedBy: TerminalSessionManager createSession should merge environment variables with CAWS variables
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] ConditionalExpression
src/security/CommandValidator.ts:229:11
       // Preserve CAWS-specific variables
       const isCawsVar = key.startsWith("CAWS_");
 
-      if (!isSensitive || isCawsVar) {
+      if (true) {
         sanitized[key] = value;
       }
killedBy: TerminalSessionManager createSession should merge environment variables with CAWS variables
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] ConditionalExpression
src/security/CommandValidator.ts:248:9
     const issues: string[] = [];
 
     // Validate command
-    if (!this.isCommandAllowed(command)) {
+    if (true) {
       return {
         valid: false,
killedBy: Command Validator - Production Hardening (ARBITER-013) Command Allowlist Validation should allow commands in allowlist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
