[Survived] BooleanLiteral
src/optimization/PerformanceMonitor.ts:40:22
 const DEFAULT_CONFIG: PerformanceMonitorConfig = {
   maxMetrics: 10000,
   autoCleanOlderThanMs: 3600000, // 1 hour
-  enableAutoCleanup: true,
+  enableAutoCleanup: false,
   cleanupIntervalMs: 300000, // 5 minutes
 };

[Timeout] BooleanLiteral
src/optimization/PerformanceMonitor.ts:58:25
   private config: PerformanceMonitorConfig;
   private metrics: PerformanceMetric[] = [];
   private cleanupTimer?: ReturnType<typeof setInterval>;
-  private metricsLock = false;
+  private metricsLock = true;
 
   constructor(config: Partial<PerformanceMonitorConfig> = {}) {

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:60:63
   private cleanupTimer?: ReturnType<typeof setInterval>;
   private metricsLock = false;
 
-  constructor(config: Partial<PerformanceMonitorConfig> = {}) {
-    this.logger = new Logger("PerformanceMonitor");
-    this.config = { ...DEFAULT_CONFIG, ...config };
-  }
+  constructor(config: Partial<PerformanceMonitorConfig> = {}) {}
 
   /**
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should integrate with SystemHealthMonitor for health metrics
statusReason: TypeError: Cannot read properties of undefined (reading 'enableAutoCleanup')

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:68:32
   /**
    * Start the performance monitor
    */
-  async start(): Promise<void> {
-    // Clear any existing timer first to prevent multiple timers
-    if (this.cleanupTimer) {
-      clearInterval(this.cleanupTimer);
-      this.cleanupTimer = undefined;
-    }
-
-    if (this.config.enableAutoCleanup) {
-      this.startAutoCleanup();
-    }
-    this.logger.info("Performance monitor started", {
-      maxMetrics: this.config.maxMetrics,
-      autoCleanup: this.config.enableAutoCleanup,
-    });
-  }
+  async start(): Promise<void> {}
 
   /**
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   55.13519347809614

[Survived] ConditionalExpression
src/optimization/PerformanceMonitor.ts:70:9
    */
   async start(): Promise<void> {
     // Clear any existing timer first to prevent multiple timers
-    if (this.cleanupTimer) {
+    if (true) {
       clearInterval(this.cleanupTimer);
       this.cleanupTimer = undefined;

[Survived] ConditionalExpression
src/optimization/PerformanceMonitor.ts:70:9
    */
   async start(): Promise<void> {
     // Clear any existing timer first to prevent multiple timers
-    if (this.cleanupTimer) {
+    if (false) {
       clearInterval(this.cleanupTimer);
       this.cleanupTimer = undefined;

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:75:40
       this.cleanupTimer = undefined;
     }
 
-    if (this.config.enableAutoCleanup) {
-      this.startAutoCleanup();
-    }
+    if (this.config.enableAutoCleanup) {}
     this.logger.info("Performance monitor started", {
       maxMetrics: this.config.maxMetrics,
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   20.737873655743027

[Killed] ConditionalExpression
src/optimization/PerformanceMonitor.ts:75:9
       this.cleanupTimer = undefined;
     }
 
-    if (this.config.enableAutoCleanup) {
+    if (false) {
       this.startAutoCleanup();
     }
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   73.70448182111303

[Killed] ObjectLiteral
src/optimization/PerformanceMonitor.ts:78:53
     if (this.config.enableAutoCleanup) {
       this.startAutoCleanup();
     }
-    this.logger.info("Performance monitor started", {
-      maxMetrics: this.config.maxMetrics,
-      autoCleanup: this.config.enableAutoCleanup,
-    });
+    this.logger.info("Performance monitor started", {});
   }
 
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   101.23275844006464

[Survived] BlockStatement
src/optimization/PerformanceMonitor.ts:87:31
   /**
    * Stop the performance monitor
    */
-  async stop(): Promise<void> {
-    if (this.cleanupTimer) {
-      clearInterval(this.cleanupTimer);
-      this.cleanupTimer = undefined;
-    }
-    this.logger.info("Performance monitor stopped");
-  }
+  async stop(): Promise<void> {}
 
   /**

[Killed] ConditionalExpression
src/optimization/PerformanceMonitor.ts:88:9
    * Stop the performance monitor
    */
   async stop(): Promise<void> {
-    if (this.cleanupTimer) {
+    if (false) {
       clearInterval(this.cleanupTimer);
       this.cleanupTimer = undefined;
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   25.095397083284357

[Survived] ConditionalExpression
src/optimization/PerformanceMonitor.ts:88:9
    * Stop the performance monitor
    */
   async stop(): Promise<void> {
-    if (this.cleanupTimer) {
+    if (true) {
       clearInterval(this.cleanupTimer);
       this.cleanupTimer = undefined;

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:100:64
    *
    * @param metric Performance metric to record
    */
-  async recordMetric(metric: PerformanceMetric): Promise<void> {
-    await this.withLock(async () => {
-      // Add metric to buffer
-      this.metrics.push(metric);
-
-      // If buffer is full, remove oldest metric (circular buffer)
-      if (this.metrics.length > this.config.maxMetrics) {
-        this.metrics.shift();
-      }
-    });
-  }
+  async recordMetric(metric: PerformanceMetric): Promise<void> {}
 
   /**
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should detect performance bottlenecks from system metrics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:101:37
    * @param metric Performance metric to record
    */
   async recordMetric(metric: PerformanceMetric): Promise<void> {
-    await this.withLock(async () => {
-      // Add metric to buffer
-      this.metrics.push(metric);
-
-      // If buffer is full, remove oldest metric (circular buffer)
-      if (this.metrics.length > this.config.maxMetrics) {
-        this.metrics.shift();
-      }
-    });
+    await this.withLock(async () => {});
   }
 
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should detect performance bottlenecks from system metrics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] EqualityOperator
src/optimization/PerformanceMonitor.ts:106:11
       this.metrics.push(metric);
 
       // If buffer is full, remove oldest metric (circular buffer)
-      if (this.metrics.length > this.config.maxMetrics) {
+      if (this.metrics.length >= this.config.maxMetrics) {
         this.metrics.shift();
       }
killedBy: PerformanceMonitor Metric Recording should enforce circular buffer limit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 4

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:106:57
       this.metrics.push(metric);
 
       // If buffer is full, remove oldest metric (circular buffer)
-      if (this.metrics.length > this.config.maxMetrics) {
-        this.metrics.shift();
-      }
+      if (this.metrics.length > this.config.maxMetrics) {}
     });
   }
killedBy: PerformanceMonitor Metric Recording should enforce circular buffer limit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:124:35
     startTime: Date,
     endTime: Date,
     metricType?: MetricType
-  ): Promise<PerformanceMetric[]> {
-    return this.withLock(async () => {
-      return this.metrics.filter((metric) => {
-        const inTimeRange =
-          metric.timestamp >= startTime && metric.timestamp <= endTime;
-
-        if (!metricType) {
-          return inTimeRange;
-        }
-
-        return inTimeRange && metric.type === metricType;
-      });
-    });
-  }
+  ): Promise<PerformanceMetric[]> {}
 
   /**
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should integrate with SystemHealthMonitor for health metrics
statusReason: TypeError: metrics is not iterable

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:125:38
     endTime: Date,
     metricType?: MetricType
   ): Promise<PerformanceMetric[]> {
-    return this.withLock(async () => {
-      return this.metrics.filter((metric) => {
-        const inTimeRange =
-          metric.timestamp >= startTime && metric.timestamp <= endTime;
-
-        if (!metricType) {
-          return inTimeRange;
-        }
-
-        return inTimeRange && metric.type === metricType;
-      });
-    });
+    return this.withLock(async () => {});
   }
 
killedBy: PerformanceMonitor Metric Retrieval should retrieve metrics by time window
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:126:46
     metricType?: MetricType
   ): Promise<PerformanceMetric[]> {
     return this.withLock(async () => {
-      return this.metrics.filter((metric) => {
-        const inTimeRange =
-          metric.timestamp >= startTime && metric.timestamp <= endTime;
-
-        if (!metricType) {
-          return inTimeRange;
-        }
-
-        return inTimeRange && metric.type === metricType;
-      });
+      return this.metrics.filter((metric) => {});
     });
   }
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should detect performance bottlenecks from system metrics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] MethodExpression
src/optimization/PerformanceMonitor.ts:126:14
     metricType?: MetricType
   ): Promise<PerformanceMetric[]> {
     return this.withLock(async () => {
-      return this.metrics.filter((metric) => {
-        const inTimeRange =
-          metric.timestamp >= startTime && metric.timestamp <= endTime;
-
-        if (!metricType) {
-          return inTimeRange;
-        }
-
-        return inTimeRange && metric.type === metricType;
-      });
+      return this.metrics;
     });
   }
killedBy: PerformanceMonitor Metric Retrieval should retrieve metrics by time window
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3

[Killed] ConditionalExpression
src/optimization/PerformanceMonitor.ts:128:11
     return this.withLock(async () => {
       return this.metrics.filter((metric) => {
         const inTimeRange =
-          metric.timestamp >= startTime && metric.timestamp <= endTime;
+          true;
 
         if (!metricType) {
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   59.292824901308684

[Killed] ConditionalExpression
src/optimization/PerformanceMonitor.ts:128:11
     return this.withLock(async () => {
       return this.metrics.filter((metric) => {
         const inTimeRange =
-          metric.timestamp >= startTime && metric.timestamp <= endTime;
+          true && metric.timestamp <= endTime;
 
         if (!metricType) {
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   77.64097333297664

[Killed] ConditionalExpression
src/optimization/PerformanceMonitor.ts:130:13
         const inTimeRange =
           metric.timestamp >= startTime && metric.timestamp <= endTime;
 
-        if (!metricType) {
+        if (false) {
           return inTimeRange;
         }
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   93.11093364581808

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:130:26
         const inTimeRange =
           metric.timestamp >= startTime && metric.timestamp <= endTime;
 
-        if (!metricType) {
-          return inTimeRange;
-        }
+        if (!metricType) {}
 
         return inTimeRange && metric.type === metricType;
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should detect performance bottlenecks from system metrics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/optimization/PerformanceMonitor.ts:134:16
           return inTimeRange;
         }
 
-        return inTimeRange && metric.type === metricType;
+        return false;
       });
     });
killedBy: PerformanceMonitor Metric Retrieval should filter metrics by type
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/optimization/PerformanceMonitor.ts:134:16
           return inTimeRange;
         }
 
-        return inTimeRange && metric.type === metricType;
+        return true;
       });
     });
killedBy: PerformanceMonitor Metric Retrieval should filter metrics by type
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"source": "test", "timestamp": 2025-10-15T07:31:11.099Z, "type": "cpu", "unit": "%", "value": 75}, {"source": "test", "timestamp": 2025-10-15T07:31:11.099Z, "type": "memory", "unit": "%", "value": 80}]

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:149:35
   async getLatestMetrics(
     count: number,
     metricType?: MetricType
-  ): Promise<PerformanceMetric[]> {
-    return this.withLock(async () => {
-      let filtered = this.metrics;
-
-      if (metricType) {
-        filtered = this.metrics.filter((m) => m.type === metricType);
-      }
-
-      // Return last N metrics
-      return filtered.slice(-count);
-    });
-  }
+  ): Promise<PerformanceMetric[]> {}
 
   /**
killedBy: PerformanceMonitor Metric Retrieval should retrieve latest N metrics
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:150:38
     count: number,
     metricType?: MetricType
   ): Promise<PerformanceMetric[]> {
-    return this.withLock(async () => {
-      let filtered = this.metrics;
-
-      if (metricType) {
-        filtered = this.metrics.filter((m) => m.type === metricType);
-      }
-
-      // Return last N metrics
-      return filtered.slice(-count);
-    });
+    return this.withLock(async () => {});
   }
 
killedBy: PerformanceMonitor Metric Retrieval should retrieve latest N metrics
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:153:23
     return this.withLock(async () => {
       let filtered = this.metrics;
 
-      if (metricType) {
-        filtered = this.metrics.filter((m) => m.type === metricType);
-      }
+      if (metricType) {}
 
       // Return last N metrics
killedBy: PerformanceMonitor Metric Retrieval should filter latest metrics by type
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 60

[Killed] ConditionalExpression
src/optimization/PerformanceMonitor.ts:153:11
     return this.withLock(async () => {
       let filtered = this.metrics;
 
-      if (metricType) {
+      if (true) {
         filtered = this.metrics.filter((m) => m.type === metricType);
       }
killedBy: PerformanceMonitor Metric Retrieval should retrieve latest N metrics
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/optimization/PerformanceMonitor.ts:154:47
       let filtered = this.metrics;
 
       if (metricType) {
-        filtered = this.metrics.filter((m) => m.type === metricType);
+        filtered = this.metrics.filter((m) => true);
       }
 
killedBy: PerformanceMonitor Metric Retrieval should filter latest metrics by type
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 60

[Killed] EqualityOperator
src/optimization/PerformanceMonitor.ts:154:47
       let filtered = this.metrics;
 
       if (metricType) {
-        filtered = this.metrics.filter((m) => m.type === metricType);
+        filtered = this.metrics.filter((m) => m.type !== metricType);
       }
 
killedBy: PerformanceMonitor Metric Retrieval should filter latest metrics by type
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [{"source": "test", "timestamp": 2025-10-15T07:31:12.841Z, "type": "memory", "unit": "%", "value": 60}]

[Killed] MethodExpression
src/optimization/PerformanceMonitor.ts:158:14
       }
 
       // Return last N metrics
-      return filtered.slice(-count);
+      return filtered;
     });
   }
killedBy: PerformanceMonitor Metric Retrieval should retrieve latest N metrics
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 5

[Killed] UnaryOperator
src/optimization/PerformanceMonitor.ts:158:29
       }
 
       // Return last N metrics
-      return filtered.slice(-count);
+      return filtered.slice(+count);
     });
   }
killedBy: PerformanceMonitor Metric Retrieval should retrieve latest N metrics
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2
Received array:  [{"source": "test", "timestamp": 2025-10-15T07:31:12.845Z, "type": "cpu", "unit": "%", "value": 30}, {"source": "test", "timestamp": 2025-10-15T07:31:12.845Z, "type": "cpu", "unit": "%", "value": 40}]

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:167:54
    *
    * @param olderThan Clear metrics older than this date
    */
-  async clearMetrics(olderThan: Date): Promise<void> {
-    await this.withLock(async () => {
-      const beforeCount = this.metrics.length;
-      this.metrics = this.metrics.filter((m) => m.timestamp >= olderThan);
-      const clearedCount = beforeCount - this.metrics.length;
-
-      if (clearedCount > 0) {
-        this.logger.debug("Cleared old metrics", {
-          clearedCount,
-          remainingCount: this.metrics.length,
-        });
-      }
-    });
-  }
+  async clearMetrics(olderThan: Date): Promise<void> {}
 
   /**
killedBy: PerformanceMonitor Metric Cleanup should clear old metrics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:168:37
    * @param olderThan Clear metrics older than this date
    */
   async clearMetrics(olderThan: Date): Promise<void> {
-    await this.withLock(async () => {
-      const beforeCount = this.metrics.length;
-      this.metrics = this.metrics.filter((m) => m.timestamp >= olderThan);
-      const clearedCount = beforeCount - this.metrics.length;
-
-      if (clearedCount > 0) {
-        this.logger.debug("Cleared old metrics", {
-          clearedCount,
-          remainingCount: this.metrics.length,
-        });
-      }
-    });
+    await this.withLock(async () => {});
   }
 
killedBy: PerformanceMonitor Metric Cleanup should clear old metrics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
src/optimization/PerformanceMonitor.ts:170:49
   async clearMetrics(olderThan: Date): Promise<void> {
     await this.withLock(async () => {
       const beforeCount = this.metrics.length;
-      this.metrics = this.metrics.filter((m) => m.timestamp >= olderThan);
+      this.metrics = this.metrics.filter((m) => false);
       const clearedCount = beforeCount - this.metrics.length;
 
killedBy: PerformanceMonitor Metric Cleanup should clear old metrics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
src/optimization/PerformanceMonitor.ts:170:49
   async clearMetrics(olderThan: Date): Promise<void> {
     await this.withLock(async () => {
       const beforeCount = this.metrics.length;
-      this.metrics = this.metrics.filter((m) => m.timestamp >= olderThan);
+      this.metrics = this.metrics.filter((m) => m.timestamp < olderThan);
       const clearedCount = beforeCount - this.metrics.length;
 
killedBy: PerformanceMonitor Metric Cleanup should clear old metrics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 75
Received: 50

[Survived] ArithmeticOperator
src/optimization/PerformanceMonitor.ts:171:28
     await this.withLock(async () => {
       const beforeCount = this.metrics.length;
       this.metrics = this.metrics.filter((m) => m.timestamp >= olderThan);
-      const clearedCount = beforeCount - this.metrics.length;
+      const clearedCount = beforeCount + this.metrics.length;
 
       if (clearedCount > 0) {

[Survived] EqualityOperator
src/optimization/PerformanceMonitor.ts:173:11
       this.metrics = this.metrics.filter((m) => m.timestamp >= olderThan);
       const clearedCount = beforeCount - this.metrics.length;
 
-      if (clearedCount > 0) {
+      if (clearedCount >= 0) {
         this.logger.debug("Cleared old metrics", {
           clearedCount,

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:185:28
   /**
    * Get current metric count
    */
-  getMetricCount(): number {
-    return this.metrics.length;
-  }
+  getMetricCount(): number {}
 
   /**
killedBy: RuntimeOptimizer Health Status should report health status
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Matcher error: received value must be a number or bigint

Received has value: undefined

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:192:41
   /**
    * Get configuration
    */
-  getConfig(): PerformanceMonitorConfig {
-    return { ...this.config };
-  }
+  getConfig(): PerformanceMonitorConfig {}
 
   /**
killedBy: PerformanceMonitor Metric Cleanup should enable automatic cleanup
statusReason: TypeError: Cannot read properties of undefined (reading 'enableAutoCleanup')

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:199:65
   /**
    * Update configuration
    */
-  updateConfig(config: Partial<PerformanceMonitorConfig>): void {
-    this.config = { ...this.config, ...config };
-
-    // Restart auto-cleanup if needed
-    if (this.cleanupTimer) {
-      clearInterval(this.cleanupTimer);
-      this.cleanupTimer = undefined;
-    }
-
-    if (this.config.enableAutoCleanup) {
-      this.startAutoCleanup();
-    }
-
-    this.logger.info("Configuration updated", this.config);
-  }
+  updateConfig(config: Partial<PerformanceMonitorConfig>): void {}
 
   /**
killedBy: PerformanceMonitor Configuration should update configuration
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5000
Received: 10000

[Survived] ConditionalExpression
src/optimization/PerformanceMonitor.ts:203:9
     this.config = { ...this.config, ...config };
 
     // Restart auto-cleanup if needed
-    if (this.cleanupTimer) {
+    if (true) {
       clearInterval(this.cleanupTimer);
       this.cleanupTimer = undefined;

[Survived] ConditionalExpression
src/optimization/PerformanceMonitor.ts:203:9
     this.config = { ...this.config, ...config };
 
     // Restart auto-cleanup if needed
-    if (this.cleanupTimer) {
+    if (false) {
       clearInterval(this.cleanupTimer);
       this.cleanupTimer = undefined;

[Survived] ConditionalExpression
src/optimization/PerformanceMonitor.ts:208:9
       this.cleanupTimer = undefined;
     }
 
-    if (this.config.enableAutoCleanup) {
+    if (true) {
       this.startAutoCleanup();
     }

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:218:36
   /**
    * Start automatic cleanup
    */
-  private startAutoCleanup(): void {
-    // Clear any existing timer first
-    if (this.cleanupTimer) {
-      clearInterval(this.cleanupTimer);
-      this.cleanupTimer = undefined;
-    }
-
-    this.cleanupTimer = setInterval(async () => {
-      const cutoffTime = new Date(
-        Date.now() - this.config.autoCleanOlderThanMs
-      );
-      await this.clearMetrics(cutoffTime);
-    }, this.config.cleanupIntervalMs);
-  }
+  private startAutoCleanup(): void {}
 
   /**
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   88.24131769837203

[Killed] ConditionalExpression
src/optimization/PerformanceMonitor.ts:220:9
    */
   private startAutoCleanup(): void {
     // Clear any existing timer first
-    if (this.cleanupTimer) {
+    if (false) {
       clearInterval(this.cleanupTimer);
       this.cleanupTimer = undefined;
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   88.8572598942772

[Killed] ConditionalExpression
src/optimization/PerformanceMonitor.ts:220:9
    */
   private startAutoCleanup(): void {
     // Clear any existing timer first
-    if (this.cleanupTimer) {
+    if (true) {
       clearInterval(this.cleanupTimer);
       this.cleanupTimer = undefined;
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   81.9328720316855

[NoCoverage] BlockStatement
src/optimization/PerformanceMonitor.ts:225:49
       this.cleanupTimer = undefined;
     }
 
-    this.cleanupTimer = setInterval(async () => {
-      const cutoffTime = new Date(
-        Date.now() - this.config.autoCleanOlderThanMs
-      );
-      await this.clearMetrics(cutoffTime);
-    }, this.config.cleanupIntervalMs);
+    this.cleanupTimer = setInterval(async () => {}, this.config.cleanupIntervalMs);
   }
 

[NoCoverage] ArithmeticOperator
src/optimization/PerformanceMonitor.ts:227:9
 
     this.cleanupTimer = setInterval(async () => {
       const cutoffTime = new Date(
-        Date.now() - this.config.autoCleanOlderThanMs
+        Date.now() + this.config.autoCleanOlderThanMs
       );
       await this.clearMetrics(cutoffTime);

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:238:67
    *
    * @param fn Function to execute with lock
    */
-  private async withLock<T>(fn: () => T | Promise<T>): Promise<T> {
-    // Wait for lock to be available
-    while (this.metricsLock) {
-      await new Promise((resolve) => setTimeout(resolve, 1));
-    }
-
-    this.metricsLock = true;
-
-    try {
-      return await fn();
-    } finally {
-      this.metricsLock = false;
-    }
-  }
+  private async withLock<T>(fn: () => T | Promise<T>): Promise<T> {}
 }
 
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should integrate with SystemHealthMonitor for health metrics
statusReason: TypeError: metrics is not iterable

[Survived] ConditionalExpression
src/optimization/PerformanceMonitor.ts:240:12
    */
   private async withLock<T>(fn: () => T | Promise<T>): Promise<T> {
     // Wait for lock to be available
-    while (this.metricsLock) {
+    while (false) {
       await new Promise((resolve) => setTimeout(resolve, 1));
     }

[Timeout] BlockStatement
src/optimization/PerformanceMonitor.ts:240:30
    */
   private async withLock<T>(fn: () => T | Promise<T>): Promise<T> {
     // Wait for lock to be available
-    while (this.metricsLock) {
-      await new Promise((resolve) => setTimeout(resolve, 1));
-    }
+    while (this.metricsLock) {}
 
     this.metricsLock = true;

[Timeout] ArrowFunction
src/optimization/PerformanceMonitor.ts:241:25
   private async withLock<T>(fn: () => T | Promise<T>): Promise<T> {
     // Wait for lock to be available
     while (this.metricsLock) {
-      await new Promise((resolve) => setTimeout(resolve, 1));
+      await new Promise(() => undefined);
     }
 

[Killed] BooleanLiteral
src/optimization/PerformanceMonitor.ts:244:24
       await new Promise((resolve) => setTimeout(resolve, 1));
     }
 
-    this.metricsLock = true;
+    this.metricsLock = false;
 
     try {
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   57.8441300015137

[Killed] BlockStatement
src/optimization/PerformanceMonitor.ts:246:9
 
     this.metricsLock = true;
 
-    try {
-      return await fn();
-    } finally {
+    try {} finally {
       this.metricsLock = false;
     }
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should integrate with SystemHealthMonitor for health metrics
statusReason: TypeError: metrics is not iterable

[Timeout] BlockStatement
src/optimization/PerformanceMonitor.ts:248:15
 
     try {
       return await fn();
-    } finally {
-      this.metricsLock = false;
-    }
+    } finally {}
   }
 }

[Timeout] BooleanLiteral
src/optimization/PerformanceMonitor.ts:249:26
     try {
       return await fn();
     } finally {
-      this.metricsLock = false;
+      this.metricsLock = true;
     }
   }
