[Killed] BlockStatement
src/security/CommandValidator.ts:248:42
     const issues: string[] = [];
 
     // Validate command
-    if (!this.isCommandAllowed(command)) {
-      return {
-        valid: false,
-        error: `Command '${command}' is not allowed`,
-        reason: "Command not in allowlist",
-        issues: ["Command not found in allowlist"],
-      };
-    }
+    if (!this.isCommandAllowed(command)) {}
 
     // Validate arguments
killedBy: Command Validator - Production Hardening (ARBITER-013) Command Allowlist Validation should block commands not in allowlist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/security/CommandValidator.ts:259:9
 
     // Validate arguments
     const argsResult = this.validateArguments(args);
-    if (!argsResult.valid) {
+    if (argsResult.valid) {
       return {
         valid: false,
killedBy: Command Validator - Production Hardening (ARBITER-013) Command Allowlist Validation should allow commands in allowlist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/security/CommandValidator.ts:259:9
 
     // Validate arguments
     const argsResult = this.validateArguments(args);
-    if (!argsResult.valid) {
+    if (true) {
       return {
         valid: false,
killedBy: Command Validator - Production Hardening (ARBITER-013) Command Allowlist Validation should allow commands in allowlist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
src/security/CommandValidator.ts:260:14
     // Validate arguments
     const argsResult = this.validateArguments(args);
     if (!argsResult.valid) {
-      return {
-        valid: false,
-        error: argsResult.error,
-        reason: argsResult.reason,
-        issues: ["Unsafe arguments detected"],
-      };
+      return {};
     }
 
killedBy: Command Injection Prevention Terminal Session Security should reject command injection via npm scripts
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Dangerous shell metacharacter detected"
Received string:    "Command validation failed"

[Killed] ConditionalExpression
src/security/CommandValidator.ts:279:11
    */
   private loadAllowlist(allowlistPath: string): Set<string> {
     try {
-      if (!fs.existsSync(allowlistPath)) {
+      if (false) {
         throw new Error(`Allowlist file not found: ${allowlistPath}`);
       }
killedBy: TerminalSessionManager createSession should create session with unique ID
statusReason: Error: ENOENT: no such file or directory, open '/Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json'

[Killed] BooleanLiteral
src/security/CommandValidator.ts:279:11
    */
   private loadAllowlist(allowlistPath: string): Set<string> {
     try {
-      if (!fs.existsSync(allowlistPath)) {
+      if (fs.existsSync(allowlistPath)) {
         throw new Error(`Allowlist file not found: ${allowlistPath}`);
       }
killedBy: Command Validator - Production Hardening (ARBITER-013) Command Allowlist Validation should allow commands in allowlist
statusReason: Error: Failed to load allowlist: Allowlist file not found: tools-allow.json

[Killed] ConditionalExpression
src/security/CommandValidator.ts:286:11
       const content = fs.readFileSync(allowlistPath, "utf-8");
       const commands = JSON.parse(content);
 
-      if (!Array.isArray(commands)) {
+      if (false) {
         throw new Error("Allowlist must be an array of command names");
       }
killedBy: TerminalSessionManager createSession should create session with unique ID
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] ConditionalExpression
src/security/CommandValidator.ts:286:11
       const content = fs.readFileSync(allowlistPath, "utf-8");
       const commands = JSON.parse(content);
 
-      if (!Array.isArray(commands)) {
+      if (true) {
         throw new Error("Allowlist must be an array of command names");
       }
killedBy: Command Validator - Production Hardening (ARBITER-013) Command Allowlist Validation should allow commands in allowlist
statusReason: Error: Failed to load allowlist: Allowlist must be an array of command names

[Killed] BlockStatement
src/security/CommandValidator.ts:291:21
       }
 
       return new Set(commands);
-    } catch (error) {
-      if (error instanceof Error) {
-        throw new Error(`Failed to load allowlist: ${error.message}`);
-      }
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: CommandValidator allowlist loading should throw error if allowlist file not found
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "allowlist"

Received function did not throw

[Killed] BlockStatement
src/security/CommandValidator.ts:292:35
 
       return new Set(commands);
     } catch (error) {
-      if (error instanceof Error) {
-        throw new Error(`Failed to load allowlist: ${error.message}`);
-      }
+      if (error instanceof Error) {}
       throw error;
     }
killedBy: CommandValidator allowlist loading should throw error if allowlist file not found
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "allowlist"
Received message:   "Allowlist file not found: /nonexistent/path.json"

      439 |             } else {
      440 |               stryCov_9fa48("1101");
    > 441 |               throw new Error(`Allowlist file not found: ${allowlistPath}`);

[Killed] BlockStatement
src/security/CommandValidator.ts:305:55
    * @param command - Command with potential path
    * @returns Base command name
    */
-  private extractBaseCommand(command: string): string {
-    // Handle full paths: /usr/bin/npm -> npm
-    const parts = command.split("/");
-    const basename = parts[parts.length - 1];
-
-    // Handle relative paths: ./npm -> npm
-    return basename.replace(/^\.\//, "");
-  }
+  private extractBaseCommand(command: string): string {}
 }
 
killedBy: TerminalSessionManager executeCommand should execute allowed command and return result
statusReason: Error: Failed to load allowlist: Allowlist file not found: /Users/darianrosebrook/Desktop/Projects/agent-agency/iterations/v2/.stryker-tmp/sandbox-E0hL75/tests/fixtures/test-allowlist.json

[Killed] ArithmeticOperator
src/security/CommandValidator.ts:308:28
   private extractBaseCommand(command: string): string {
     // Handle full paths: /usr/bin/npm -> npm
     const parts = command.split("/");
-    const basename = parts[parts.length - 1];
+    const basename = parts[parts.length + 1];
 
     // Handle relative paths: ./npm -> npm
killedBy: Command Validator - Production Hardening (ARBITER-013) Command Allowlist Validation should allow commands in allowlist
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')
