[NoCoverage] ArithmeticOperator
src/optimization/RuntimeOptimizer.ts:420:27
       cacheStats.push({
         cacheId,
         totalRequests: cacheMetrics.length,
-        hits: Math.round((cacheMetrics.length * hitRate) / 100),
+        hits: Math.round((cacheMetrics.length / hitRate) / 100),
         misses: Math.round((cacheMetrics.length * (100 - hitRate)) / 100),
         hitRate,

[NoCoverage] ArithmeticOperator
src/optimization/RuntimeOptimizer.ts:420:26
       cacheStats.push({
         cacheId,
         totalRequests: cacheMetrics.length,
-        hits: Math.round((cacheMetrics.length * hitRate) / 100),
+        hits: Math.round(cacheMetrics.length * hitRate * 100),
         misses: Math.round((cacheMetrics.length * (100 - hitRate)) / 100),
         hitRate,

[NoCoverage] ArithmeticOperator
src/optimization/RuntimeOptimizer.ts:421:28
         cacheId,
         totalRequests: cacheMetrics.length,
         hits: Math.round((cacheMetrics.length * hitRate) / 100),
-        misses: Math.round((cacheMetrics.length * (100 - hitRate)) / 100),
+        misses: Math.round(cacheMetrics.length * (100 - hitRate) * 100),
         hitRate,
         avgHitTimeMs: 10,

[NoCoverage] ArithmeticOperator
src/optimization/RuntimeOptimizer.ts:421:52
         cacheId,
         totalRequests: cacheMetrics.length,
         hits: Math.round((cacheMetrics.length * hitRate) / 100),
-        misses: Math.round((cacheMetrics.length * (100 - hitRate)) / 100),
+        misses: Math.round((cacheMetrics.length * (100 + hitRate)) / 100),
         hitRate,
         avgHitTimeMs: 10,

[NoCoverage] ArithmeticOperator
src/optimization/RuntimeOptimizer.ts:428:37
         cacheSizeBytes: 0,
         evictionCount: 0,
         windowStartTime: cacheMetrics[0].timestamp,
-        windowEndTime: cacheMetrics[cacheMetrics.length - 1].timestamp,
+        windowEndTime: cacheMetrics[cacheMetrics.length + 1].timestamp,
       });
     }

[Killed] EqualityOperator
src/optimization/RuntimeOptimizer.ts:441:9
   private async analyzePerformanceTrends(
     metrics: any[]
   ): Promise<PerformanceTrend[]> {
-    if (metrics.length < this.config.minDataPointsForTrend) {
+    if (metrics.length <= this.config.minDataPointsForTrend) {
       return [];
     }
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   52.98036985905839

[Killed] EqualityOperator
src/optimization/RuntimeOptimizer.ts:441:9
   private async analyzePerformanceTrends(
     metrics: any[]
   ): Promise<PerformanceTrend[]> {
-    if (metrics.length < this.config.minDataPointsForTrend) {
+    if (metrics.length >= this.config.minDataPointsForTrend) {
       return [];
     }
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   62.879903607115885

[Survived] BlockStatement
src/optimization/RuntimeOptimizer.ts:449:35
 
     // Group by component and metric type
     const groupedMetrics = new Map<string, any[]>();
-    for (const metric of metrics) {
-      const key = `${metric.source}-${metric.type}`;
-      const group = groupedMetrics.get(key) ?? [];
-      group.push(metric);
-      groupedMetrics.set(key, group);
-    }
+    for (const metric of metrics) {}
 
     for (const [key, group] of groupedMetrics) {

[Killed] LogicalOperator
src/optimization/RuntimeOptimizer.ts:451:21
     const groupedMetrics = new Map<string, any[]>();
     for (const metric of metrics) {
       const key = `${metric.source}-${metric.type}`;
-      const group = groupedMetrics.get(key) ?? [];
+      const group = groupedMetrics.get(key) && [];
       group.push(metric);
       groupedMetrics.set(key, group);
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] EqualityOperator
src/optimization/RuntimeOptimizer.ts:457:11
     }
 
     for (const [key, group] of groupedMetrics) {
-      if (group.length < this.config.minDataPointsForTrend) continue;
+      if (group.length >= this.config.minDataPointsForTrend) continue;
 
       const values = group.map((m) => m.value);
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   24.444329680497873

[Survived] EqualityOperator
src/optimization/RuntimeOptimizer.ts:457:11
     }
 
     for (const [key, group] of groupedMetrics) {
-      if (group.length < this.config.minDataPointsForTrend) continue;
+      if (group.length <= this.config.minDataPointsForTrend) continue;
 
       const values = group.map((m) => m.value);

[Survived] ArrowFunction
src/optimization/RuntimeOptimizer.ts:459:32
     for (const [key, group] of groupedMetrics) {
       if (group.length < this.config.minDataPointsForTrend) continue;
 
-      const values = group.map((m) => m.value);
+      const values = group.map(() => undefined);
       const avgValue = values.reduce((sum, v) => sum + v, 0) / values.length;
       const minValue = Math.min(...values);

[Survived] ArithmeticOperator
src/optimization/RuntimeOptimizer.ts:460:24
       if (group.length < this.config.minDataPointsForTrend) continue;
 
       const values = group.map((m) => m.value);
-      const avgValue = values.reduce((sum, v) => sum + v, 0) / values.length;
+      const avgValue = values.reduce((sum, v) => sum + v, 0) * values.length;
       const minValue = Math.min(...values);
       const maxValue = Math.max(...values);

[Survived] ArithmeticOperator
src/optimization/RuntimeOptimizer.ts:460:50
       if (group.length < this.config.minDataPointsForTrend) continue;
 
       const values = group.map((m) => m.value);
-      const avgValue = values.reduce((sum, v) => sum + v, 0) / values.length;
+      const avgValue = values.reduce((sum, v) => sum - v, 0) / values.length;
       const minValue = Math.min(...values);
       const maxValue = Math.max(...values);

[Survived] MethodExpression
src/optimization/RuntimeOptimizer.ts:461:24
 
       const values = group.map((m) => m.value);
       const avgValue = values.reduce((sum, v) => sum + v, 0) / values.length;
-      const minValue = Math.min(...values);
+      const minValue = Math.max(...values);
       const maxValue = Math.max(...values);
 

[Survived] MethodExpression
src/optimization/RuntimeOptimizer.ts:462:24
       const values = group.map((m) => m.value);
       const avgValue = values.reduce((sum, v) => sum + v, 0) / values.length;
       const minValue = Math.min(...values);
-      const maxValue = Math.max(...values);
+      const maxValue = Math.min(...values);
 
       // Calculate standard deviation

[Survived] ArithmeticOperator
src/optimization/RuntimeOptimizer.ts:466:50
 
       // Calculate standard deviation
       const variance =
-        values.reduce((sum, v) => sum + Math.pow(v - avgValue, 2), 0) /
+        values.reduce((sum, v) => sum + Math.pow(v + avgValue, 2), 0) /
         values.length;
       const stdDev = Math.sqrt(variance);

[Survived] ArithmeticOperator
src/optimization/RuntimeOptimizer.ts:466:35
 
       // Calculate standard deviation
       const variance =
-        values.reduce((sum, v) => sum + Math.pow(v - avgValue, 2), 0) /
+        values.reduce((sum, v) => sum - Math.pow(v - avgValue, 2), 0) /
         values.length;
       const stdDev = Math.sqrt(variance);

[Survived] ArithmeticOperator
src/optimization/RuntimeOptimizer.ts:471:52
       const stdDev = Math.sqrt(variance);
 
       // Determine trend direction
-      const firstHalf = values.slice(0, Math.floor(values.length / 2));
+      const firstHalf = values.slice(0, Math.floor(values.length * 2));
       const secondHalf = values.slice(Math.floor(values.length / 2));
       const firstAvg =

[Survived] MethodExpression
src/optimization/RuntimeOptimizer.ts:471:25
       const stdDev = Math.sqrt(variance);
 
       // Determine trend direction
-      const firstHalf = values.slice(0, Math.floor(values.length / 2));
+      const firstHalf = values;
       const secondHalf = values.slice(Math.floor(values.length / 2));
       const firstAvg =

[Survived] MethodExpression
src/optimization/RuntimeOptimizer.ts:472:26
 
       // Determine trend direction
       const firstHalf = values.slice(0, Math.floor(values.length / 2));
-      const secondHalf = values.slice(Math.floor(values.length / 2));
+      const secondHalf = values;
       const firstAvg =
         firstHalf.reduce((sum, v) => sum + v, 0) / firstHalf.length;

[Survived] ArithmeticOperator
src/optimization/RuntimeOptimizer.ts:472:50
 
       // Determine trend direction
       const firstHalf = values.slice(0, Math.floor(values.length / 2));
-      const secondHalf = values.slice(Math.floor(values.length / 2));
+      const secondHalf = values.slice(Math.floor(values.length * 2));
       const firstAvg =
         firstHalf.reduce((sum, v) => sum + v, 0) / firstHalf.length;

[Survived] ArrowFunction
src/optimization/RuntimeOptimizer.ts:474:26
       const firstHalf = values.slice(0, Math.floor(values.length / 2));
       const secondHalf = values.slice(Math.floor(values.length / 2));
       const firstAvg =
-        firstHalf.reduce((sum, v) => sum + v, 0) / firstHalf.length;
+        firstHalf.reduce(() => undefined, 0) / firstHalf.length;
       const secondAvg =
         secondHalf.reduce((sum, v) => sum + v, 0) / secondHalf.length;

[Survived] ArithmeticOperator
src/optimization/RuntimeOptimizer.ts:474:38
       const firstHalf = values.slice(0, Math.floor(values.length / 2));
       const secondHalf = values.slice(Math.floor(values.length / 2));
       const firstAvg =
-        firstHalf.reduce((sum, v) => sum + v, 0) / firstHalf.length;
+        firstHalf.reduce((sum, v) => sum - v, 0) / firstHalf.length;
       const secondAvg =
         secondHalf.reduce((sum, v) => sum + v, 0) / secondHalf.length;

[Survived] ArithmeticOperator
src/optimization/RuntimeOptimizer.ts:476:9
       const firstAvg =
         firstHalf.reduce((sum, v) => sum + v, 0) / firstHalf.length;
       const secondAvg =
-        secondHalf.reduce((sum, v) => sum + v, 0) / secondHalf.length;
+        secondHalf.reduce((sum, v) => sum + v, 0) * secondHalf.length;
 
       let direction: "improving" | "stable" | "degrading";

[Survived] ArrowFunction
src/optimization/RuntimeOptimizer.ts:476:27
       const firstAvg =
         firstHalf.reduce((sum, v) => sum + v, 0) / firstHalf.length;
       const secondAvg =
-        secondHalf.reduce((sum, v) => sum + v, 0) / secondHalf.length;
+        secondHalf.reduce(() => undefined, 0) / secondHalf.length;
 
       let direction: "improving" | "stable" | "degrading";

[Survived] ConditionalExpression
src/optimization/RuntimeOptimizer.ts:479:11
         secondHalf.reduce((sum, v) => sum + v, 0) / secondHalf.length;
 
       let direction: "improving" | "stable" | "degrading";
-      if (Math.abs(secondAvg - firstAvg) / firstAvg < 0.1) {
+      if (true) {
         direction = "stable";
       } else if (secondAvg < firstAvg) {

[Survived] BlockStatement
src/optimization/RuntimeOptimizer.ts:479:60
         secondHalf.reduce((sum, v) => sum + v, 0) / secondHalf.length;
 
       let direction: "improving" | "stable" | "degrading";
-      if (Math.abs(secondAvg - firstAvg) / firstAvg < 0.1) {
-        direction = "stable";
-      } else if (secondAvg < firstAvg) {
+      if (Math.abs(secondAvg - firstAvg) / firstAvg < 0.1) {} else if (secondAvg < firstAvg) {
         direction = "improving";
       } else {

[NoCoverage] BlockStatement
src/optimization/RuntimeOptimizer.ts:481:40
       let direction: "improving" | "stable" | "degrading";
       if (Math.abs(secondAvg - firstAvg) / firstAvg < 0.1) {
         direction = "stable";
-      } else if (secondAvg < firstAvg) {
-        direction = "improving";
-      } else {
+      } else if (secondAvg < firstAvg) {} else {
         direction = "degrading";
       }

[Survived] EqualityOperator
src/optimization/RuntimeOptimizer.ts:481:18
       let direction: "improving" | "stable" | "degrading";
       if (Math.abs(secondAvg - firstAvg) / firstAvg < 0.1) {
         direction = "stable";
-      } else if (secondAvg < firstAvg) {
+      } else if (secondAvg >= firstAvg) {
         direction = "improving";
       } else {

[Survived] BlockStatement
src/optimization/RuntimeOptimizer.ts:483:14
         direction = "stable";
       } else if (secondAvg < firstAvg) {
         direction = "improving";
-      } else {
-        direction = "degrading";
-      }
+      } else {}
 
       trends.push({

[Survived] ObjectLiteral
src/optimization/RuntimeOptimizer.ts:487:19
         direction = "degrading";
       }
 
-      trends.push({
-        metricType: group[0].type,
-        component: group[0].source,
-        direction,
-        averageValue: avgValue,
-        minValue,
-        maxValue,
-        standardDeviation: stdDev,
-        startTime: group[0].timestamp,
-        endTime: group[group.length - 1].timestamp,
-        dataPointCount: group.length,
-      });
+      trends.push({});
     }
 

[Killed] ArithmeticOperator
src/optimization/RuntimeOptimizer.ts:496:24
         maxValue,
         standardDeviation: stdDev,
         startTime: group[0].timestamp,
-        endTime: group[group.length - 1].timestamp,
+        endTime: group[group.length + 1].timestamp,
         dataPointCount: group.length,
       });
killedBy: RuntimeOptimizer Integration SystemHealthMonitor Integration should detect performance bottlenecks from system metrics
statusReason: TypeError: Cannot read properties of undefined (reading 'timestamp')

[Killed] ConditionalExpression
src/optimization/RuntimeOptimizer.ts:508:9
    * Calculate overall system health score (0-100 percentage)
    */
   private calculateHealthScore(bottlenecks: any[]): number {
-    if (bottlenecks.length === 0) {
+    if (true) {
       return 100; // Perfect health
     }
killedBy: RuntimeOptimizer Integration End-to-End Optimization Flow should complete full optimization cycle
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 80
Received:   100

[Killed] EqualityOperator
src/optimization/RuntimeOptimizer.ts:508:9
    * Calculate overall system health score (0-100 percentage)
    */
   private calculateHealthScore(bottlenecks: any[]): number {
-    if (bottlenecks.length === 0) {
+    if (bottlenecks.length !== 0) {
       return 100; // Perfect health
     }
killedBy: RuntimeOptimizer Integration End-to-End Optimization Flow should complete full optimization cycle
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 80
Received:   100

[Killed] BlockStatement
src/optimization/RuntimeOptimizer.ts:514:43
 
     let score = 100;
 
-    for (const bottleneck of bottlenecks) {
-      switch (bottleneck.severity) {
-        case BottleneckSeverity.CRITICAL:
-          score -= 20;
-          break;
-        case BottleneckSeverity.HIGH:
-          score -= 10;
-          break;
-        case BottleneckSeverity.MEDIUM:
-          score -= 5;
-          break;
-        case BottleneckSeverity.LOW:
-          score -= 2;
-          break;
-      }
-    }
+    for (const bottleneck of bottlenecks) {}
 
     // Return percentage (0-100)
killedBy: RuntimeOptimizer Integration End-to-End Optimization Flow should complete full optimization cycle
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 80
Received:   100

[Killed] ConditionalExpression
src/optimization/RuntimeOptimizer.ts:516:9
 
     for (const bottleneck of bottlenecks) {
       switch (bottleneck.severity) {
-        case BottleneckSeverity.CRITICAL:
-          score -= 20;
-          break;
+        case BottleneckSeverity.CRITICAL:
         case BottleneckSeverity.HIGH:
           score -= 10;
killedBy: RuntimeOptimizer Integration End-to-End Optimization Flow should complete full optimization cycle
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 80
Received:   80

[Killed] AssignmentOperator
src/optimization/RuntimeOptimizer.ts:517:11
     for (const bottleneck of bottlenecks) {
       switch (bottleneck.severity) {
         case BottleneckSeverity.CRITICAL:
-          score -= 20;
+          score += 20;
           break;
         case BottleneckSeverity.HIGH:
killedBy: RuntimeOptimizer Integration End-to-End Optimization Flow should complete full optimization cycle
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 80
Received:   110

[Killed] ConditionalExpression
src/optimization/RuntimeOptimizer.ts:519:9
         case BottleneckSeverity.CRITICAL:
           score -= 20;
           break;
-        case BottleneckSeverity.HIGH:
-          score -= 10;
-          break;
+        case BottleneckSeverity.HIGH:
         case BottleneckSeverity.MEDIUM:
           score -= 5;
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   86.8086892125401

[Killed] AssignmentOperator
src/optimization/RuntimeOptimizer.ts:520:11
           score -= 20;
           break;
         case BottleneckSeverity.HIGH:
-          score -= 10;
+          score += 10;
           break;
         case BottleneckSeverity.MEDIUM:
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   26.661928579173125

[Survived] ConditionalExpression
src/optimization/RuntimeOptimizer.ts:522:9
         case BottleneckSeverity.HIGH:
           score -= 10;
           break;
-        case BottleneckSeverity.MEDIUM:
-          score -= 5;
-          break;
+        case BottleneckSeverity.MEDIUM:
         case BottleneckSeverity.LOW:
           score -= 2;

[Killed] AssignmentOperator
src/optimization/RuntimeOptimizer.ts:523:11
           score -= 10;
           break;
         case BottleneckSeverity.MEDIUM:
-          score -= 5;
+          score += 5;
           break;
         case BottleneckSeverity.LOW:
killedBy: RuntimeOptimizer Integration End-to-End Optimization Flow should complete full optimization cycle
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 80
Received:   90

[Killed] ConditionalExpression
src/optimization/RuntimeOptimizer.ts:525:9
         case BottleneckSeverity.MEDIUM:
           score -= 5;
           break;
-        case BottleneckSeverity.LOW:
-          score -= 2;
-          break;
+        case BottleneckSeverity.LOW:
       }
     }
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   48.061422939485965

[Survived] AssignmentOperator
src/optimization/RuntimeOptimizer.ts:526:11
           score -= 5;
           break;
         case BottleneckSeverity.LOW:
-          score -= 2;
+          score += 2;
           break;
       }

[Survived] MethodExpression
src/optimization/RuntimeOptimizer.ts:532:12
     }
 
     // Return percentage (0-100)
-    return Math.max(0, score);
+    return Math.min(0, score);
   }
 

[Killed] BlockStatement
src/optimization/RuntimeOptimizer.ts:540:32
    */
   private mapSeverityToPriority(
     severity: BottleneckSeverity
-  ): "low" | "medium" | "high" {
-    switch (severity) {
-      case BottleneckSeverity.CRITICAL:
-      case BottleneckSeverity.HIGH:
-        return "high";
-      case BottleneckSeverity.MEDIUM:
-        return "medium";
-      case BottleneckSeverity.LOW:
-      default:
-        return "low";
-    }
-  }
+  ): "low" | "medium" | "high" {}
 }
 
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   52.31845538231582

[Survived] ConditionalExpression
src/optimization/RuntimeOptimizer.ts:543:7
   ): "low" | "medium" | "high" {
     switch (severity) {
       case BottleneckSeverity.CRITICAL:
-      case BottleneckSeverity.HIGH:
-        return "high";
+      case BottleneckSeverity.HIGH:
       case BottleneckSeverity.MEDIUM:
         return "medium";

[Killed] ConditionalExpression
src/optimization/RuntimeOptimizer.ts:545:7
       case BottleneckSeverity.CRITICAL:
       case BottleneckSeverity.HIGH:
         return "high";
-      case BottleneckSeverity.MEDIUM:
-        return "medium";
+      case BottleneckSeverity.MEDIUM:
       case BottleneckSeverity.LOW:
       default:
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 20
Received:   24.683607320163112

[Survived] ConditionalExpression
src/optimization/RuntimeOptimizer.ts:548:7
       case BottleneckSeverity.MEDIUM:
         return "medium";
       case BottleneckSeverity.LOW:
-      default:
-        return "low";
+      default:
     }
   }
