[Killed] BlockStatement
src/learning/ContextPreservationEngine.ts:304:5
     snapshotCount: number;
     totalSizeBytes: number;
     averageCompressionRatio: number;
-  } {
-    let totalSize = 0;
-    let totalCompressionRatio = 0;
-    let count = 0;
-
-    for (const snapshot of this.snapshotCache.values()) {
-      totalSize += snapshot.sizeBytes;
-      totalCompressionRatio += snapshot.compressionRatio;
-      count++;
-    }
-
-    return {
-      snapshotCount: count,
-      totalSizeBytes: totalSize,
-      averageCompressionRatio: count > 0 ? totalCompressionRatio / count : 0,
-    };
-  }
+  } {}
 
   /**
killedBy: ContextPreservationEngine Cache Management should provide cache statistics
statusReason: Error: expect(received).toHaveProperty(path)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
src/learning/ContextPreservationEngine.ts:309:57
     let totalCompressionRatio = 0;
     let count = 0;
 
-    for (const snapshot of this.snapshotCache.values()) {
-      totalSize += snapshot.sizeBytes;
-      totalCompressionRatio += snapshot.compressionRatio;
-      count++;
-    }
+    for (const snapshot of this.snapshotCache.values()) {}
 
     return {
killedBy: ContextPreservationEngine Cache Management should provide cache statistics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] AssignmentOperator
src/learning/ContextPreservationEngine.ts:310:7
     let count = 0;
 
     for (const snapshot of this.snapshotCache.values()) {
-      totalSize += snapshot.sizeBytes;
+      totalSize -= snapshot.sizeBytes;
       totalCompressionRatio += snapshot.compressionRatio;
       count++;
killedBy: ContextPreservationEngine configuration edge cases should handle many snapshots efficiently
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   -2160

[Survived] AssignmentOperator
src/learning/ContextPreservationEngine.ts:311:7
 
     for (const snapshot of this.snapshotCache.values()) {
       totalSize += snapshot.sizeBytes;
-      totalCompressionRatio += snapshot.compressionRatio;
+      totalCompressionRatio -= snapshot.compressionRatio;
       count++;
     }

[Killed] UpdateOperator
src/learning/ContextPreservationEngine.ts:312:7
     for (const snapshot of this.snapshotCache.values()) {
       totalSize += snapshot.sizeBytes;
       totalCompressionRatio += snapshot.compressionRatio;
-      count++;
+      count--;
     }
 
killedBy: ContextPreservationEngine Cache Management should provide cache statistics
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   -2

[Killed] ObjectLiteral
src/learning/ContextPreservationEngine.ts:315:12
       count++;
     }
 
-    return {
-      snapshotCount: count,
-      totalSizeBytes: totalSize,
-      averageCompressionRatio: count > 0 ? totalCompressionRatio / count : 0,
-    };
+    return {};
   }
 
killedBy: ContextPreservationEngine Cache Management should provide cache statistics
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "snapshotCount"
Received path: []

Received value: {}

[Survived] ConditionalExpression
src/learning/ContextPreservationEngine.ts:318:32
     return {
       snapshotCount: count,
       totalSizeBytes: totalSize,
-      averageCompressionRatio: count > 0 ? totalCompressionRatio / count : 0,
+      averageCompressionRatio: false ? totalCompressionRatio / count : 0,
     };
   }

[Survived] ArithmeticOperator
src/learning/ContextPreservationEngine.ts:318:44
     return {
       snapshotCount: count,
       totalSizeBytes: totalSize,
-      averageCompressionRatio: count > 0 ? totalCompressionRatio / count : 0,
+      averageCompressionRatio: count > 0 ? totalCompressionRatio * count : 0,
     };
   }

[Killed] BlockStatement
src/learning/ContextPreservationEngine.ts:328:13
   private generateSnapshotId(
     sessionId: string,
     iterationNumber: number
-  ): string {
-    return `snapshot_${sessionId}_${iterationNumber}_${Date.now()}`;
-  }
+  ): string {}
 
   /**
killedBy: ContextPreservationEngine Snapshot Creation should create a new context snapshot
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
src/learning/ContextPreservationEngine.ts:335:46
   /**
    * Compress data using gzip
    */
-  private compressData(data: string): string {
-    if (!this.config.enableCompression) {
-      return data;
-    }
-
-    const buffer = Buffer.from(data, "utf-8");
-    const compressed = gzipSync(buffer, {
-      level: this.config.compressionLevel,
-    });
-    return compressed.toString("base64");
-  }
+  private compressData(data: string): string {}
 
   /**
killedBy: ContextPreservationEngine Snapshot Creation should create a new context snapshot
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/learning/ContextPreservationEngine.ts:336:9
    * Compress data using gzip
    */
   private compressData(data: string): string {
-    if (!this.config.enableCompression) {
+    if (false) {
       return data;
     }
killedBy: ContextPreservationEngine configuration edge cases should handle disabled features gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -1.3703703703703702

[Killed] BlockStatement
src/learning/ContextPreservationEngine.ts:336:41
    * Compress data using gzip
    */
   private compressData(data: string): string {
-    if (!this.config.enableCompression) {
-      return data;
-    }
+    if (!this.config.enableCompression) {}
 
     const buffer = Buffer.from(data, "utf-8");
killedBy: ContextPreservationEngine configuration edge cases should handle disabled features gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -1.3703703703703702

[Killed] BlockStatement
src/learning/ContextPreservationEngine.ts:350:58
   /**
    * Decompress data from gzip
    */
-  private decompressData(compressedData: string): string {
-    if (!this.config.enableCompression) {
-      return compressedData;
-    }
-
-    const buffer = Buffer.from(compressedData, "base64");
-    const decompressed = gunzipSync(buffer);
-    return decompressed.toString("utf-8");
-  }
+  private decompressData(compressedData: string): string {}
 
   /**
killedBy: ContextPreservationEngine Differential Storage should use higher compression for differential snapshots with similar data
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 104
Received:   104

[Killed] BooleanLiteral
src/learning/ContextPreservationEngine.ts:351:9
    * Decompress data from gzip
    */
   private decompressData(compressedData: string): string {
-    if (!this.config.enableCompression) {
+    if (this.config.enableCompression) {
       return compressedData;
     }
killedBy: ContextPreservationEngine Differential Storage should use higher compression for differential snapshots with similar data
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 104
Received:   104

[Killed] ConditionalExpression
src/learning/ContextPreservationEngine.ts:351:9
    * Decompress data from gzip
    */
   private decompressData(compressedData: string): string {
-    if (!this.config.enableCompression) {
+    if (true) {
       return compressedData;
     }
killedBy: ContextPreservationEngine Differential Storage should use higher compression for differential snapshots with similar data
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 104
Received:   104

[Survived] BlockStatement
src/learning/ContextPreservationEngine.ts:363:49
   /**
    * Compute MD5 checksum for data integrity
    */
-  private computeChecksum(data: string): string {
-    return createHash("md5").update(data).digest("hex");
-  }
+  private computeChecksum(data: string): string {}
 
   /**

[Killed] EqualityOperator
src/learning/ContextPreservationEngine.ts:374:7
    */
   private computeDiff(base: unknown, current: unknown): unknown {
     if (
-      typeof base !== "object" ||
+      typeof base === "object" ||
       base === null ||
       typeof current !== "object" ||
killedBy: ContextPreservationEngine Differential Storage should use higher compression for differential snapshots with similar data
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 104
Received:   104

[Killed] ConditionalExpression
src/learning/ContextPreservationEngine.ts:374:7
    */
   private computeDiff(base: unknown, current: unknown): unknown {
     if (
-      typeof base !== "object" ||
-      base === null ||
-      typeof current !== "object" ||
-      current === null
+      true
     ) {
       return current;
killedBy: ContextPreservationEngine Differential Storage should use higher compression for differential snapshots with similar data
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 104
Received:   104

[Killed] EqualityOperator
src/learning/ContextPreservationEngine.ts:375:7
   private computeDiff(base: unknown, current: unknown): unknown {
     if (
       typeof base !== "object" ||
-      base === null ||
+      base !== null ||
       typeof current !== "object" ||
       current === null
killedBy: ContextPreservationEngine Differential Storage should use higher compression for differential snapshots with similar data
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 104
Received:   104

[Survived] ConditionalExpression
src/learning/ContextPreservationEngine.ts:375:7
   private computeDiff(base: unknown, current: unknown): unknown {
     if (
       typeof base !== "object" ||
-      base === null ||
+      false ||
       typeof current !== "object" ||
       current === null

[Killed] EqualityOperator
src/learning/ContextPreservationEngine.ts:376:7
     if (
       typeof base !== "object" ||
       base === null ||
-      typeof current !== "object" ||
+      typeof current === "object" ||
       current === null
     ) {
killedBy: ContextPreservationEngine Differential Storage should use higher compression for differential snapshots with similar data
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 104
Received:   104

[Survived] ConditionalExpression
src/learning/ContextPreservationEngine.ts:376:7
     if (
       typeof base !== "object" ||
       base === null ||
-      typeof current !== "object" ||
+      false ||
       current === null
     ) {

[Killed] EqualityOperator
src/learning/ContextPreservationEngine.ts:377:7
       typeof base !== "object" ||
       base === null ||
       typeof current !== "object" ||
-      current === null
+      current !== null
     ) {
       return current;
killedBy: ContextPreservationEngine Differential Storage should use higher compression for differential snapshots with similar data
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 104
Received:   104

[Survived] ConditionalExpression
src/learning/ContextPreservationEngine.ts:377:7
       typeof base !== "object" ||
       base === null ||
       typeof current !== "object" ||
-      current === null
+      false
     ) {
       return current;

[Survived] BlockStatement
src/learning/ContextPreservationEngine.ts:378:7
       base === null ||
       typeof current !== "object" ||
       current === null
-    ) {
-      return current;
-    }
+    ) {}
 
     const diff: Record<string, unknown> = {};

[Killed] BlockStatement
src/learning/ContextPreservationEngine.ts:387:48
     const currentObj = current as Record<string, unknown>;
 
     // Find changed or new keys
-    for (const key of Object.keys(currentObj)) {
-      if (!(key in baseObj)) {
-        diff[key] = currentObj[key];
-      } else if (
-        JSON.stringify(baseObj[key]) !== JSON.stringify(currentObj[key])
-      ) {
-        diff[key] = currentObj[key];
-      }
-    }
+    for (const key of Object.keys(currentObj)) {}
 
     // Mark deleted keys
killedBy: ContextPreservationEngine Context Restoration should restore differential snapshots correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/learning/ContextPreservationEngine.ts:388:30
 
     // Find changed or new keys
     for (const key of Object.keys(currentObj)) {
-      if (!(key in baseObj)) {
-        diff[key] = currentObj[key];
-      } else if (
+      if (!(key in baseObj)) {} else if (
         JSON.stringify(baseObj[key]) !== JSON.stringify(currentObj[key])
       ) {
killedBy: ContextPreservationEngine error handling and edge cases should handle differential snapshots with existing base
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/learning/ContextPreservationEngine.ts:388:11
 
     // Find changed or new keys
     for (const key of Object.keys(currentObj)) {
-      if (!(key in baseObj)) {
+      if (true) {
         diff[key] = currentObj[key];
       } else if (
killedBy: ContextPreservationEngine Differential Storage should use higher compression for differential snapshots with similar data
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 104
Received:   104

[Killed] ConditionalExpression
src/learning/ContextPreservationEngine.ts:391:9
       if (!(key in baseObj)) {
         diff[key] = currentObj[key];
       } else if (
-        JSON.stringify(baseObj[key]) !== JSON.stringify(currentObj[key])
+        false
       ) {
         diff[key] = currentObj[key];
killedBy: ContextPreservationEngine Context Restoration should restore differential snapshots correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/learning/ContextPreservationEngine.ts:391:9
       if (!(key in baseObj)) {
         diff[key] = currentObj[key];
       } else if (
-        JSON.stringify(baseObj[key]) !== JSON.stringify(currentObj[key])
+        true
       ) {
         diff[key] = currentObj[key];
killedBy: ContextPreservationEngine Differential Storage should use higher compression for differential snapshots with similar data
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 104
Received:   104

[Killed] BlockStatement
src/learning/ContextPreservationEngine.ts:392:9
         diff[key] = currentObj[key];
       } else if (
         JSON.stringify(baseObj[key]) !== JSON.stringify(currentObj[key])
-      ) {
-        diff[key] = currentObj[key];
-      }
+      ) {}
     }
 
killedBy: ContextPreservationEngine Context Restoration should restore differential snapshots correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BlockStatement
src/learning/ContextPreservationEngine.ts:398:45
     }
 
     // Mark deleted keys
-    for (const key of Object.keys(baseObj)) {
-      if (!(key in currentObj)) {
-        diff[`__deleted__${key}`] = true;
-      }
-    }
+    for (const key of Object.keys(baseObj)) {}
 
     return diff;

[Killed] BooleanLiteral
src/learning/ContextPreservationEngine.ts:399:11
 
     // Mark deleted keys
     for (const key of Object.keys(baseObj)) {
-      if (!(key in currentObj)) {
+      if (key in currentObj) {
         diff[`__deleted__${key}`] = true;
       }
killedBy: ContextPreservationEngine Context Restoration should restore differential snapshots correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/learning/ContextPreservationEngine.ts:399:11
 
     // Mark deleted keys
     for (const key of Object.keys(baseObj)) {
-      if (!(key in currentObj)) {
+      if (true) {
         diff[`__deleted__${key}`] = true;
       }
killedBy: ContextPreservationEngine Context Restoration should restore differential snapshots correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BooleanLiteral
src/learning/ContextPreservationEngine.ts:400:37
     // Mark deleted keys
     for (const key of Object.keys(baseObj)) {
       if (!(key in currentObj)) {
-        diff[`__deleted__${key}`] = true;
+        diff[`__deleted__${key}`] = false;
       }
     }

[Killed] BlockStatement
src/learning/ContextPreservationEngine.ts:410:60
   /**
    * Apply diff to base context
    */
-  private applyDiff(base: unknown, diff: unknown): unknown {
-    if (typeof base !== "object" || base === null) {
-      return diff;
-    }
-
-    if (typeof diff !== "object" || diff === null) {
-      return diff;
-    }
-
-    const result = { ...base } as Record<string, unknown>;
-    const diffObj = diff as Record<string, unknown>;
-
-    for (const key of Object.keys(diffObj)) {
-      if (key.startsWith("__deleted__")) {
-        const originalKey = key.replace("__deleted__", "");
-        delete result[originalKey];
-      } else {
-        result[key] = diffObj[key];
-      }
-    }
-
-    return result;
-  }
+  private applyDiff(base: unknown, diff: unknown): unknown {}
 }
 
killedBy: ContextPreservationEngine Context Restoration should restore differential snapshots correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BlockStatement
src/learning/ContextPreservationEngine.ts:411:52
    * Apply diff to base context
    */
   private applyDiff(base: unknown, diff: unknown): unknown {
-    if (typeof base !== "object" || base === null) {
-      return diff;
-    }
+    if (typeof base !== "object" || base === null) {}
 
     if (typeof diff !== "object" || diff === null) {

[Survived] ConditionalExpression
src/learning/ContextPreservationEngine.ts:411:37
    * Apply diff to base context
    */
   private applyDiff(base: unknown, diff: unknown): unknown {
-    if (typeof base !== "object" || base === null) {
+    if (typeof base !== "object" || false) {
       return diff;
     }

[Survived] ConditionalExpression
src/learning/ContextPreservationEngine.ts:415:9
       return diff;
     }
 
-    if (typeof diff !== "object" || diff === null) {
+    if (false) {
       return diff;
     }

[Survived] ConditionalExpression
src/learning/ContextPreservationEngine.ts:415:9
       return diff;
     }
 
-    if (typeof diff !== "object" || diff === null) {
+    if (false || diff === null) {
       return diff;
     }

[Killed] BlockStatement
src/learning/ContextPreservationEngine.ts:422:45
     const result = { ...base } as Record<string, unknown>;
     const diffObj = diff as Record<string, unknown>;
 
-    for (const key of Object.keys(diffObj)) {
-      if (key.startsWith("__deleted__")) {
-        const originalKey = key.replace("__deleted__", "");
-        delete result[originalKey];
-      } else {
-        result[key] = diffObj[key];
-      }
-    }
+    for (const key of Object.keys(diffObj)) {}
 
     return result;
killedBy: ContextPreservationEngine Context Restoration should restore differential snapshots correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/learning/ContextPreservationEngine.ts:423:11
     const diffObj = diff as Record<string, unknown>;
 
     for (const key of Object.keys(diffObj)) {
-      if (key.startsWith("__deleted__")) {
+      if (true) {
         const originalKey = key.replace("__deleted__", "");
         delete result[originalKey];
killedBy: ContextPreservationEngine Context Restoration should restore differential snapshots correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] MethodExpression
src/learning/ContextPreservationEngine.ts:423:11
     const diffObj = diff as Record<string, unknown>;
 
     for (const key of Object.keys(diffObj)) {
-      if (key.startsWith("__deleted__")) {
+      if (key.endsWith("__deleted__")) {
         const originalKey = key.replace("__deleted__", "");
         delete result[originalKey];

[Killed] BlockStatement
src/learning/ContextPreservationEngine.ts:426:14
       if (key.startsWith("__deleted__")) {
         const originalKey = key.replace("__deleted__", "");
         delete result[originalKey];
-      } else {
-        result[key] = diffObj[key];
-      }
+      } else {}
     }
 
killedBy: ContextPreservationEngine Context Restoration should restore differential snapshots correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
