[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:139:37
   /**
    * Initialize by loading known patterns from database
    */
-  async initialize(): Promise<void> {
-    try {
-      const patterns = await this.dbClient.getErrorPatterns();
-
-      for (const pattern of patterns) {
-        this.knownPatterns.set(pattern.patternId, pattern);
-      }
-    } catch (error) {
-      // If database table doesn't exist yet, start with empty patterns
-      // This is expected during initial setup or migration
-      this.logger.warn(
-        "Failed to load error patterns from database, starting with empty set",
-        {
-          error: error instanceof Error ? error.message : String(error),
-        }
-      );
-    }
-  }
+  async initialize(): Promise<void> {}
 
   /**
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:140:9
    * Initialize by loading known patterns from database
    */
   async initialize(): Promise<void> {
-    try {
-      const patterns = await this.dbClient.getErrorPatterns();
-
-      for (const pattern of patterns) {
-        this.knownPatterns.set(pattern.patternId, pattern);
-      }
-    } catch (error) {
+    try {} catch (error) {
       // If database table doesn't exist yet, start with empty patterns
       // This is expected during initial setup or migration
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:143:39
     try {
       const patterns = await this.dbClient.getErrorPatterns();
 
-      for (const pattern of patterns) {
-        this.knownPatterns.set(pattern.patternId, pattern);
-      }
+      for (const pattern of patterns) {}
     } catch (error) {
       // If database table doesn't exist yet, start with empty patterns
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Survived] BlockStatement
src/learning/ErrorPatternRecognizer.ts:146:21
       for (const pattern of patterns) {
         this.knownPatterns.set(pattern.patternId, pattern);
       }
-    } catch (error) {
-      // If database table doesn't exist yet, start with empty patterns
-      // This is expected during initial setup or migration
-      this.logger.warn(
-        "Failed to load error patterns from database, starting with empty set",
-        {
-          error: error instanceof Error ? error.message : String(error),
-        }
-      );
-    }
+    } catch (error) {}
   }
 

[Killed] LogicalOperator
src/learning/ErrorPatternRecognizer.ts:171:45
     errorMessage: string,
     stackTrace?: string
   ): Promise<ErrorAnalysisResult> {
-    const fullContext = `${errorMessage}\n${stackTrace || ""}`;
+    const fullContext = `${errorMessage}\n${stackTrace && ""}`;
 
     // Try to match against known patterns first
killedBy: ErrorPatternRecognizer Pattern Matching should update pattern frequency on match
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"frequency": 4, "patternId": "pattern-2"}

Number of calls: 1

[Killed] ConditionalExpression
src/learning/ErrorPatternRecognizer.ts:171:45
     errorMessage: string,
     stackTrace?: string
   ): Promise<ErrorAnalysisResult> {
-    const fullContext = `${errorMessage}\n${stackTrace || ""}`;
+    const fullContext = `${errorMessage}\n${true}`;
 
     // Try to match against known patterns first
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Killed] ConditionalExpression
src/learning/ErrorPatternRecognizer.ts:175:9
 
     // Try to match against known patterns first
     const knownMatch = this.matchKnownPattern(fullContext);
-    if (knownMatch) {
+    if (true) {
       await this.updatePatternFrequency(knownMatch.patternId);
 
killedBy: ErrorPatternRecognizer Error Categorization should categorize syntax errors correctly
statusReason: TypeError: Cannot read properties of null (reading 'patternId')

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:175:21
 
     // Try to match against known patterns first
     const knownMatch = this.matchKnownPattern(fullContext);
-    if (knownMatch) {
-      await this.updatePatternFrequency(knownMatch.patternId);
-
-      this.emit(LearningCoordinatorEvent.PATTERN_RECOGNIZED, {
-        sessionId: iteration.sessionId,
-        timestamp: new Date(),
-        eventType: LearningCoordinatorEvent.PATTERN_RECOGNIZED,
-        data: {
-          patternId: knownMatch.patternId,
-          category: knownMatch.category,
-          confidence: knownMatch.confidence,
-        },
-      });
-
-      return {
-        category: knownMatch.category,
-        confidence: knownMatch.confidence,
-        remediationStrategy: knownMatch.remediationStrategy,
-        patternId: knownMatch.patternId,
-        isKnownPattern: true,
-      };
-    }
+    if (knownMatch) {}
 
     // Categorize using regex patterns
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Survived] ObjectLiteral
src/learning/ErrorPatternRecognizer.ts:178:62
     if (knownMatch) {
       await this.updatePatternFrequency(knownMatch.patternId);
 
-      this.emit(LearningCoordinatorEvent.PATTERN_RECOGNIZED, {
-        sessionId: iteration.sessionId,
-        timestamp: new Date(),
-        eventType: LearningCoordinatorEvent.PATTERN_RECOGNIZED,
-        data: {
-          patternId: knownMatch.patternId,
-          category: knownMatch.category,
-          confidence: knownMatch.confidence,
-        },
-      });
+      this.emit(LearningCoordinatorEvent.PATTERN_RECOGNIZED, {});
 
       return {

[Killed] BooleanLiteral
src/learning/ErrorPatternRecognizer.ts:194:25
         confidence: knownMatch.confidence,
         remediationStrategy: knownMatch.remediationStrategy,
         patternId: knownMatch.patternId,
-        isKnownPattern: true,
+        isKnownPattern: false,
       };
     }
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] MethodExpression
src/learning/ErrorPatternRecognizer.ts:215:18
       detectedAt: new Date(),
       remediationStrategy,
       successRate: 0,
-      examples: [errorMessage.substring(0, 200)],
+      examples: [errorMessage],
     };
 

[Survived] ObjectLiteral
src/learning/ErrorPatternRecognizer.ts:226:13
       sessionId: iteration.sessionId,
       timestamp: new Date(),
       eventType: LearningCoordinatorEvent.ERROR_DETECTED,
-      data: {
-        category,
-        patternId,
-        isNewPattern: true,
-      },
+      data: {},
     });
 

[Survived] BooleanLiteral
src/learning/ErrorPatternRecognizer.ts:229:23
       data: {
         category,
         patternId,
-        isNewPattern: true,
+        isNewPattern: false,
       },
     });

[Killed] ObjectLiteral
src/learning/ErrorPatternRecognizer.ts:233:12
       },
     });
 
-    return {
-      category,
-      confidence,
-      remediationStrategy,
-      patternId,
-      isKnownPattern: false,
-    };
+    return {};
   }
 
killedBy: ErrorPatternRecognizer Error Categorization should categorize syntax errors correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "syntax_error"
Received: undefined

[Killed] BooleanLiteral
src/learning/ErrorPatternRecognizer.ts:238:23
       confidence,
       remediationStrategy,
       patternId,
-      isKnownPattern: false,
+      isKnownPattern: true,
     };
   }
killedBy: ErrorPatternRecognizer Pattern Matching should create new pattern for novel errors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:248:72
    * @param errorContext - Full error context
    * @returns Matching pattern or null
    */
-  private matchKnownPattern(errorContext: string): ErrorPattern | null {
-    let bestMatch: ErrorPattern | null = null;
-    let highestScore = 0;
-
-    for (const pattern of this.knownPatterns.values()) {
-      const score = this.calculateSimilarity(errorContext, pattern.pattern);
-
-      if (score > highestScore && score > 0.7) {
-        highestScore = score;
-        bestMatch = pattern;
-      }
-    }
-
-    return bestMatch;
-  }
+  private matchKnownPattern(errorContext: string): ErrorPattern | null {}
 
   /**
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:252:56
     let bestMatch: ErrorPattern | null = null;
     let highestScore = 0;
 
-    for (const pattern of this.knownPatterns.values()) {
-      const score = this.calculateSimilarity(errorContext, pattern.pattern);
-
-      if (score > highestScore && score > 0.7) {
-        highestScore = score;
-        bestMatch = pattern;
-      }
-    }
+    for (const pattern of this.knownPatterns.values()) {}
 
     return bestMatch;
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Killed] EqualityOperator
src/learning/ErrorPatternRecognizer.ts:255:35
     for (const pattern of this.knownPatterns.values()) {
       const score = this.calculateSimilarity(errorContext, pattern.pattern);
 
-      if (score > highestScore && score > 0.7) {
+      if (score > highestScore && score <= 0.7) {
         highestScore = score;
         bestMatch = pattern;
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Killed] ConditionalExpression
src/learning/ErrorPatternRecognizer.ts:255:11
     for (const pattern of this.knownPatterns.values()) {
       const score = this.calculateSimilarity(errorContext, pattern.pattern);
 
-      if (score > highestScore && score > 0.7) {
+      if (false) {
         highestScore = score;
         bestMatch = pattern;
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:270:64
    * @param errorContext - Full error context
    * @returns Error category
    */
-  private categorizeError(errorContext: string): ErrorCategory {
-    for (const [category, patterns] of Object.entries(
-      ErrorPatternRecognizer.ERROR_PATTERNS
-    )) {
-      for (const pattern of patterns) {
-        if (pattern.test(errorContext)) {
-          return category as ErrorCategory;
-        }
-      }
-    }
-
-    return ErrorCategory.UNKNOWN;
-  }
+  private categorizeError(errorContext: string): ErrorCategory {}
 
   /**
killedBy: ErrorPatternRecognizer Error Categorization should categorize syntax errors correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "syntax_error"
Received: undefined

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:273:8
   private categorizeError(errorContext: string): ErrorCategory {
     for (const [category, patterns] of Object.entries(
       ErrorPatternRecognizer.ERROR_PATTERNS
-    )) {
-      for (const pattern of patterns) {
-        if (pattern.test(errorContext)) {
-          return category as ErrorCategory;
-        }
-      }
-    }
+    )) {}
 
     return ErrorCategory.UNKNOWN;
killedBy: ErrorPatternRecognizer Error Categorization should categorize syntax errors correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "syntax_error"
Received: "unknown"

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:274:39
     for (const [category, patterns] of Object.entries(
       ErrorPatternRecognizer.ERROR_PATTERNS
     )) {
-      for (const pattern of patterns) {
-        if (pattern.test(errorContext)) {
-          return category as ErrorCategory;
-        }
-      }
+      for (const pattern of patterns) {}
     }
 
killedBy: ErrorPatternRecognizer Error Categorization should categorize syntax errors correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "syntax_error"
Received: "unknown"

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:275:41
       ErrorPatternRecognizer.ERROR_PATTERNS
     )) {
       for (const pattern of patterns) {
-        if (pattern.test(errorContext)) {
-          return category as ErrorCategory;
-        }
+        if (pattern.test(errorContext)) {}
       }
     }
killedBy: ErrorPatternRecognizer Error Categorization should categorize syntax errors correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "syntax_error"
Received: "unknown"

[Killed] ConditionalExpression
src/learning/ErrorPatternRecognizer.ts:275:13
       ErrorPatternRecognizer.ERROR_PATTERNS
     )) {
       for (const pattern of patterns) {
-        if (pattern.test(errorContext)) {
+        if (true) {
           return category as ErrorCategory;
         }
killedBy: ErrorPatternRecognizer Error Categorization should categorize type errors correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "type_error"
Received: "syntax_error"

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:293:71
    * @param pattern - Pattern string
    * @returns Similarity score 0-1
    */
-  private calculateSimilarity(error: string, pattern: string): number {
-    const errorWords = new Set(this.tokenize(error));
-    const patternWords = new Set(this.tokenize(pattern));
-
-    const intersection = new Set(
-      [...errorWords].filter((x) => patternWords.has(x))
-    );
-    const union = new Set([...errorWords, ...patternWords]);
-
-    return intersection.size / union.size;
-  }
+  private calculateSimilarity(error: string, pattern: string): number {}
 
   /**
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Killed] ArrowFunction
src/learning/ErrorPatternRecognizer.ts:298:30
     const patternWords = new Set(this.tokenize(pattern));
 
     const intersection = new Set(
-      [...errorWords].filter((x) => patternWords.has(x))
+      [...errorWords].filter(() => undefined)
     );
     const union = new Set([...errorWords, ...patternWords]);
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Survived] MethodExpression
src/learning/ErrorPatternRecognizer.ts:298:7
     const patternWords = new Set(this.tokenize(pattern));
 
     const intersection = new Set(
-      [...errorWords].filter((x) => patternWords.has(x))
+      [...errorWords]
     );
     const union = new Set([...errorWords, ...patternWords]);

[Survived] ArithmeticOperator
src/learning/ErrorPatternRecognizer.ts:302:12
     );
     const union = new Set([...errorWords, ...patternWords]);
 
-    return intersection.size / union.size;
+    return intersection.size * union.size;
   }
 

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:311:44
    * @param text - Text to tokenize
    * @returns Array of tokens
    */
-  private tokenize(text: string): string[] {
-    return text
-      .toLowerCase()
-      .replace(/[^a-z0-9\s]/g, " ")
-      .split(/\s+/)
-      .filter((word) => word.length > 2);
-  }
+  private tokenize(text: string): string[] {}
 
   /**
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Killed] MethodExpression
src/learning/ErrorPatternRecognizer.ts:312:12
    * @returns Array of tokens
    */
   private tokenize(text: string): string[] {
-    return text
-      .toLowerCase()
+    return text.toUpperCase()
       .replace(/[^a-z0-9\s]/g, " ")
       .split(/\s+/)
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Killed] MethodExpression
src/learning/ErrorPatternRecognizer.ts:312:12
    * @returns Array of tokens
    */
   private tokenize(text: string): string[] {
-    return text
-      .toLowerCase()
-      .replace(/[^a-z0-9\s]/g, " ")
-      .split(/\s+/)
-      .filter((word) => word.length > 2);
+    return text.toLowerCase().replace(/[^a-z0-9\s]/g, " ").split(/\s+/);
   }
 
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Killed] Regex
src/learning/ErrorPatternRecognizer.ts:314:16
   private tokenize(text: string): string[] {
     return text
       .toLowerCase()
-      .replace(/[^a-z0-9\s]/g, " ")
+      .replace(/[a-z0-9\s]/g, " ")
       .split(/\s+/)
       .filter((word) => word.length > 2);
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Killed] Regex
src/learning/ErrorPatternRecognizer.ts:314:16
   private tokenize(text: string): string[] {
     return text
       .toLowerCase()
-      .replace(/[^a-z0-9\s]/g, " ")
+      .replace(/[^a-z0-9\S]/g, " ")
       .split(/\s+/)
       .filter((word) => word.length > 2);
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Killed] Regex
src/learning/ErrorPatternRecognizer.ts:315:14
     return text
       .toLowerCase()
       .replace(/[^a-z0-9\s]/g, " ")
-      .split(/\s+/)
+      .split(/\S+/)
       .filter((word) => word.length > 2);
   }
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Killed] ConditionalExpression
src/learning/ErrorPatternRecognizer.ts:316:25
       .toLowerCase()
       .replace(/[^a-z0-9\s]/g, " ")
       .split(/\s+/)
-      .filter((word) => word.length > 2);
+      .filter((word) => true);
   }
 
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Killed] ArrowFunction
src/learning/ErrorPatternRecognizer.ts:316:15
       .toLowerCase()
       .replace(/[^a-z0-9\s]/g, " ")
       .split(/\s+/)
-      .filter((word) => word.length > 2);
+      .filter(() => undefined);
   }
 
killedBy: ErrorPatternRecognizer Pattern Matching should match similar errors to existing patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pattern-1"
Received: "pattern_d23e2528"

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:327:56
    * @param errorMessage - Error message
    * @returns Generalized pattern
    */
-  private extractPattern(errorMessage: string): string {
-    return errorMessage
-      .replace(/\d+/g, "NUM")
-      .replace(/["'].*?["']/g, "STR")
-      .replace(/\/[\w\/\-_.]+/g, "PATH")
-      .replace(/0x[0-9a-f]+/gi, "HEX")
-      .substring(0, 200);
-  }
+  private extractPattern(errorMessage: string): string {}
 
   /**
killedBy: ErrorPatternRecognizer Error Categorization should categorize syntax errors correctly
statusReason: TypeError: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Survived] MethodExpression
src/learning/ErrorPatternRecognizer.ts:328:12
    * @returns Generalized pattern
    */
   private extractPattern(errorMessage: string): string {
-    return errorMessage
-      .replace(/\d+/g, "NUM")
-      .replace(/["'].*?["']/g, "STR")
-      .replace(/\/[\w\/\-_.]+/g, "PATH")
-      .replace(/0x[0-9a-f]+/gi, "HEX")
-      .substring(0, 200);
+    return errorMessage.replace(/\d+/g, "NUM").replace(/["'].*?["']/g, "STR").replace(/\/[\w\/\-_.]+/g, "PATH").replace(/0x[0-9a-f]+/gi, "HEX");
   }
 

[Survived] Regex
src/learning/ErrorPatternRecognizer.ts:331:16
     return errorMessage
       .replace(/\d+/g, "NUM")
       .replace(/["'].*?["']/g, "STR")
-      .replace(/\/[\w\/\-_.]+/g, "PATH")
+      .replace(/\/[\w\/\-_.]/g, "PATH")
       .replace(/0x[0-9a-f]+/gi, "HEX")
       .substring(0, 200);

[Survived] Regex
src/learning/ErrorPatternRecognizer.ts:332:16
       .replace(/\d+/g, "NUM")
       .replace(/["'].*?["']/g, "STR")
       .replace(/\/[\w\/\-_.]+/g, "PATH")
-      .replace(/0x[0-9a-f]+/gi, "HEX")
+      .replace(/0x[^0-9a-f]+/gi, "HEX")
       .substring(0, 200);
   }

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:342:59
    * @param errorMessage - Error message
    * @returns Pattern ID
    */
-  private generatePatternId(errorMessage: string): string {
-    const pattern = this.extractPattern(errorMessage);
-    const hash = createHash("md5")
-      .update(pattern)
-      .digest("hex")
-      .substring(0, 8);
-    return `pattern_${hash}`;
-  }
+  private generatePatternId(errorMessage: string): string {}
 
   /**
killedBy: ErrorPatternRecognizer Pattern Matching should create new pattern for novel errors
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Survived] MethodExpression
src/learning/ErrorPatternRecognizer.ts:344:18
    */
   private generatePatternId(errorMessage: string): string {
     const pattern = this.extractPattern(errorMessage);
-    const hash = createHash("md5")
-      .update(pattern)
-      .digest("hex")
-      .substring(0, 8);
+    const hash = createHash("md5").update(pattern).digest("hex");
     return `pattern_${hash}`;
   }

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:356:74
    *
    * @param patternId - Pattern ID to update
    */
-  private async updatePatternFrequency(patternId: string): Promise<void> {
-    const pattern = this.knownPatterns.get(patternId);
-
-    if (pattern) {
-      pattern.frequency++;
-      pattern.confidence = Math.min(0.95, pattern.confidence + 0.01);
-      await this.dbClient.upsertErrorPattern(pattern);
-    }
-  }
+  private async updatePatternFrequency(patternId: string): Promise<void> {}
 
   /**
killedBy: ErrorPatternRecognizer Pattern Matching should update pattern frequency on match
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"frequency": 4, "patternId": "pattern-2"}

Number of calls: 0

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:359:18
   private async updatePatternFrequency(patternId: string): Promise<void> {
     const pattern = this.knownPatterns.get(patternId);
 
-    if (pattern) {
-      pattern.frequency++;
-      pattern.confidence = Math.min(0.95, pattern.confidence + 0.01);
-      await this.dbClient.upsertErrorPattern(pattern);
-    }
+    if (pattern) {}
   }
 
killedBy: ErrorPatternRecognizer Pattern Matching should update pattern frequency on match
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"frequency": 4, "patternId": "pattern-2"}

Number of calls: 0

[Killed] UpdateOperator
src/learning/ErrorPatternRecognizer.ts:360:7
     const pattern = this.knownPatterns.get(patternId);
 
     if (pattern) {
-      pattern.frequency++;
+      pattern.frequency--;
       pattern.confidence = Math.min(0.95, pattern.confidence + 0.01);
       await this.dbClient.upsertErrorPattern(pattern);
killedBy: ErrorPatternRecognizer Pattern Matching should update pattern frequency on match
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"frequency": 4, "patternId": "pattern-2"}
Received: {"category": "syntax_error", "confidence": 0.81, "detectedAt": 2025-10-16T23:39:42.833Z, "examples": [], "frequency": 2, "pattern": "SyntaxError Unexpected token", "patternId": "pattern-2", "remediationStrategy": "Check for missing brackets or commas", "succes

[Survived] MethodExpression
src/learning/ErrorPatternRecognizer.ts:361:28
 
     if (pattern) {
       pattern.frequency++;
-      pattern.confidence = Math.min(0.95, pattern.confidence + 0.01);
+      pattern.confidence = Math.max(0.95, pattern.confidence + 0.01);
       await this.dbClient.upsertErrorPattern(pattern);
     }

[Survived] ArithmeticOperator
src/learning/ErrorPatternRecognizer.ts:361:43
 
     if (pattern) {
       pattern.frequency++;
-      pattern.confidence = Math.min(0.95, pattern.confidence + 0.01);
+      pattern.confidence = Math.min(0.95, pattern.confidence - 0.01);
       await this.dbClient.upsertErrorPattern(pattern);
     }

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:375:20
   async updatePatternSuccess(
     patternId: string,
     wasSuccessful: boolean
-  ): Promise<void> {
-    const pattern = this.knownPatterns.get(patternId);
-
-    if (pattern) {
-      const totalAttempts = pattern.frequency;
-      const successfulAttempts = Math.floor(
-        pattern.successRate * totalAttempts
-      );
-      const newSuccessfulAttempts =
-        successfulAttempts + (wasSuccessful ? 1 : 0);
-
-      pattern.successRate = newSuccessfulAttempts / totalAttempts;
-      await this.dbClient.upsertErrorPattern(pattern);
-    }
-  }
+  ): Promise<void> {}
 
   /**
killedBy: ErrorPatternRecognizer Pattern Success Tracking should update pattern success rate
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"patternId": "pattern-4", "successRate": Any<Number>}

Number of calls: 0

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:378:18
   ): Promise<void> {
     const pattern = this.knownPatterns.get(patternId);
 
-    if (pattern) {
-      const totalAttempts = pattern.frequency;
-      const successfulAttempts = Math.floor(
-        pattern.successRate * totalAttempts
-      );
-      const newSuccessfulAttempts =
-        successfulAttempts + (wasSuccessful ? 1 : 0);
-
-      pattern.successRate = newSuccessfulAttempts / totalAttempts;
-      await this.dbClient.upsertErrorPattern(pattern);
-    }
+    if (pattern) {}
   }
 
killedBy: ErrorPatternRecognizer Pattern Success Tracking should update pattern success rate
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"patternId": "pattern-4", "successRate": Any<Number>}

Number of calls: 0

[Survived] ArithmeticOperator
src/learning/ErrorPatternRecognizer.ts:381:9
     if (pattern) {
       const totalAttempts = pattern.frequency;
       const successfulAttempts = Math.floor(
-        pattern.successRate * totalAttempts
+        pattern.successRate / totalAttempts
       );
       const newSuccessfulAttempts =

[Survived] ArithmeticOperator
src/learning/ErrorPatternRecognizer.ts:384:9
         pattern.successRate * totalAttempts
       );
       const newSuccessfulAttempts =
-        successfulAttempts + (wasSuccessful ? 1 : 0);
+        successfulAttempts - (wasSuccessful ? 1 : 0);
 
       pattern.successRate = newSuccessfulAttempts / totalAttempts;

[Killed] ArithmeticOperator
src/learning/ErrorPatternRecognizer.ts:386:29
       const newSuccessfulAttempts =
         successfulAttempts + (wasSuccessful ? 1 : 0);
 
-      pattern.successRate = newSuccessfulAttempts / totalAttempts;
+      pattern.successRate = newSuccessfulAttempts * totalAttempts;
       await this.dbClient.upsertErrorPattern(pattern);
     }
killedBy: ErrorPatternRecognizer Pattern Success Tracking should decrease success rate on failure
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 0.6
Received:    15
