[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:399:30
    */
   async getPatternsByCategory(
     category: ErrorCategory
-  ): Promise<ErrorPattern[]> {
-    return this.dbClient.getErrorPatterns(category);
-  }
+  ): Promise<ErrorPattern[]> {}
 
   /**
killedBy: ErrorPatternRecognizer Pattern Statistics should get patterns by category
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:409:61
    * @param limit - Number of patterns to return
    * @returns Top patterns by frequency
    */
-  getMostCommonPatterns(limit: number = 10): ErrorPattern[] {
-    return Array.from(this.knownPatterns.values())
-      .sort((a, b) => b.frequency - a.frequency)
-      .slice(0, limit);
-  }
+  getMostCommonPatterns(limit: number = 10): ErrorPattern[] {}
 
   /**
killedBy: ErrorPatternRecognizer Pattern Statistics should get most common patterns
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] MethodExpression
src/learning/ErrorPatternRecognizer.ts:410:12
    * @returns Top patterns by frequency
    */
   getMostCommonPatterns(limit: number = 10): ErrorPattern[] {
-    return Array.from(this.knownPatterns.values())
-      .sort((a, b) => b.frequency - a.frequency)
-      .slice(0, limit);
+    return Array.from(this.knownPatterns.values()).sort((a, b) => b.frequency - a.frequency);
   }
 
killedBy: ErrorPatternRecognizer Pattern Statistics should get most common patterns
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2

[Survived] MethodExpression
src/learning/ErrorPatternRecognizer.ts:410:12
    * @returns Top patterns by frequency
    */
   getMostCommonPatterns(limit: number = 10): ErrorPattern[] {
-    return Array.from(this.knownPatterns.values())
-      .sort((a, b) => b.frequency - a.frequency)
+    return Array.from(this.knownPatterns.values())
       .slice(0, limit);
   }

[Survived] ArrowFunction
src/learning/ErrorPatternRecognizer.ts:411:13
    */
   getMostCommonPatterns(limit: number = 10): ErrorPattern[] {
     return Array.from(this.knownPatterns.values())
-      .sort((a, b) => b.frequency - a.frequency)
+      .sort(() => undefined)
       .slice(0, limit);
   }

[Survived] ArithmeticOperator
src/learning/ErrorPatternRecognizer.ts:411:23
    */
   getMostCommonPatterns(limit: number = 10): ErrorPattern[] {
     return Array.from(this.knownPatterns.values())
-      .sort((a, b) => b.frequency - a.frequency)
+      .sort((a, b) => b.frequency + a.frequency)
       .slice(0, limit);
   }

[Killed] BlockStatement
src/learning/ErrorPatternRecognizer.ts:425:5
     byCategory: Record<string, number>;
     averageConfidence: number;
     averageSuccessRate: number;
-  } {
-    const byCategory: Record<string, number> = {};
-    let totalConfidence = 0;
-    let totalSuccessRate = 0;
-
-    for (const pattern of this.knownPatterns.values()) {
-      byCategory[pattern.category] = (byCategory[pattern.category] || 0) + 1;
-      totalConfidence += pattern.confidence;
-      totalSuccessRate += pattern.successRate;
-    }
-
-    const count = this.knownPatterns.size;
-
-    return {
-      totalPatterns: count,
-      byCategory,
-      averageConfidence: count > 0 ? totalConfidence / count : 0,
-      averageSuccessRate: count > 0 ? totalSuccessRate / count : 0,
-    };
-  }
+  } {}
 }
 
killedBy: ErrorPatternRecognizer Pattern Statistics should track and report pattern statistics
statusReason: Error: expect(received).toHaveProperty(path)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Survived] BlockStatement
src/learning/ErrorPatternRecognizer.ts:430:56
     let totalConfidence = 0;
     let totalSuccessRate = 0;
 
-    for (const pattern of this.knownPatterns.values()) {
-      byCategory[pattern.category] = (byCategory[pattern.category] || 0) + 1;
-      totalConfidence += pattern.confidence;
-      totalSuccessRate += pattern.successRate;
-    }
+    for (const pattern of this.knownPatterns.values()) {}
 
     const count = this.knownPatterns.size;

[Survived] LogicalOperator
src/learning/ErrorPatternRecognizer.ts:431:39
     let totalSuccessRate = 0;
 
     for (const pattern of this.knownPatterns.values()) {
-      byCategory[pattern.category] = (byCategory[pattern.category] || 0) + 1;
+      byCategory[pattern.category] = (byCategory[pattern.category] && 0) + 1;
       totalConfidence += pattern.confidence;
       totalSuccessRate += pattern.successRate;

[Survived] ConditionalExpression
src/learning/ErrorPatternRecognizer.ts:431:39
     let totalSuccessRate = 0;
 
     for (const pattern of this.knownPatterns.values()) {
-      byCategory[pattern.category] = (byCategory[pattern.category] || 0) + 1;
+      byCategory[pattern.category] = (false) + 1;
       totalConfidence += pattern.confidence;
       totalSuccessRate += pattern.successRate;

[Survived] AssignmentOperator
src/learning/ErrorPatternRecognizer.ts:432:7
 
     for (const pattern of this.knownPatterns.values()) {
       byCategory[pattern.category] = (byCategory[pattern.category] || 0) + 1;
-      totalConfidence += pattern.confidence;
+      totalConfidence -= pattern.confidence;
       totalSuccessRate += pattern.successRate;
     }

[Survived] AssignmentOperator
src/learning/ErrorPatternRecognizer.ts:433:7
     for (const pattern of this.knownPatterns.values()) {
       byCategory[pattern.category] = (byCategory[pattern.category] || 0) + 1;
       totalConfidence += pattern.confidence;
-      totalSuccessRate += pattern.successRate;
+      totalSuccessRate -= pattern.successRate;
     }
 

[Survived] ArithmeticOperator
src/learning/ErrorPatternRecognizer.ts:441:38
     return {
       totalPatterns: count,
       byCategory,
-      averageConfidence: count > 0 ? totalConfidence / count : 0,
+      averageConfidence: count > 0 ? totalConfidence * count : 0,
       averageSuccessRate: count > 0 ? totalSuccessRate / count : 0,
     };

[Survived] EqualityOperator
src/learning/ErrorPatternRecognizer.ts:441:26
     return {
       totalPatterns: count,
       byCategory,
-      averageConfidence: count > 0 ? totalConfidence / count : 0,
+      averageConfidence: count <= 0 ? totalConfidence / count : 0,
       averageSuccessRate: count > 0 ? totalSuccessRate / count : 0,
     };

[Survived] ConditionalExpression
src/learning/ErrorPatternRecognizer.ts:442:27
       totalPatterns: count,
       byCategory,
       averageConfidence: count > 0 ? totalConfidence / count : 0,
-      averageSuccessRate: count > 0 ? totalSuccessRate / count : 0,
+      averageSuccessRate: true ? totalSuccessRate / count : 0,
     };
   }

[Survived] EqualityOperator
src/learning/ErrorPatternRecognizer.ts:442:27
       totalPatterns: count,
       byCategory,
       averageConfidence: count > 0 ? totalConfidence / count : 0,
-      averageSuccessRate: count > 0 ? totalSuccessRate / count : 0,
+      averageSuccessRate: count <= 0 ? totalSuccessRate / count : 0,
     };
   }
