[Survived] AssignmentOperator
src/learning/FeedbackGenerator.ts:426:9
       const variance = this.calculateVariance(recentDeltas);
 
       if (variance > 0.01) {
-        confidence -= 0.1;
+        confidence += 0.1;
       }
     }

[Survived] MethodExpression
src/learning/FeedbackGenerator.ts:430:12
       }
     }
 
-    return Math.max(0, Math.min(1, confidence));
+    return Math.min(0, Math.min(1, confidence));
   }
 

[Survived] MethodExpression
src/learning/FeedbackGenerator.ts:430:24
       }
     }
 
-    return Math.max(0, Math.min(1, confidence));
+    return Math.max(0, Math.max(1, confidence));
   }
 

[Survived] BlockStatement
src/learning/FeedbackGenerator.ts:439:52
    * @param values - Array of values
    * @returns Trend (positive = improving)
    */
-  private calculateTrend(values: number[]): number {
-    if (values.length < 2) {
-      return 0;
-    }
-
-    let sum = 0;
-    for (let i = 1; i < values.length; i++) {
-      sum += values[i] - values[i - 1];
-    }
-
-    return sum / (values.length - 1);
-  }
+  private calculateTrend(values: number[]): number {}
 
   /**

[Survived] ConditionalExpression
src/learning/FeedbackGenerator.ts:440:9
    * @returns Trend (positive = improving)
    */
   private calculateTrend(values: number[]): number {
-    if (values.length < 2) {
+    if (true) {
       return 0;
     }

[Survived] ConditionalExpression
src/learning/FeedbackGenerator.ts:440:9
    * @returns Trend (positive = improving)
    */
   private calculateTrend(values: number[]): number {
-    if (values.length < 2) {
+    if (false) {
       return 0;
     }

[Survived] BlockStatement
src/learning/FeedbackGenerator.ts:445:45
     }
 
     let sum = 0;
-    for (let i = 1; i < values.length; i++) {
-      sum += values[i] - values[i - 1];
-    }
+    for (let i = 1; i < values.length; i++) {}
 
     return sum / (values.length - 1);

[Survived] EqualityOperator
src/learning/FeedbackGenerator.ts:445:21
     }
 
     let sum = 0;
-    for (let i = 1; i < values.length; i++) {
+    for (let i = 1; i <= values.length; i++) {
       sum += values[i] - values[i - 1];
     }

[Survived] AssignmentOperator
src/learning/FeedbackGenerator.ts:446:7
 
     let sum = 0;
     for (let i = 1; i < values.length; i++) {
-      sum += values[i] - values[i - 1];
+      sum -= values[i] - values[i - 1];
     }
 

[Survived] ArithmeticOperator
src/learning/FeedbackGenerator.ts:446:14
 
     let sum = 0;
     for (let i = 1; i < values.length; i++) {
-      sum += values[i] - values[i - 1];
+      sum += values[i] + values[i - 1];
     }
 

[Survived] ArithmeticOperator
src/learning/FeedbackGenerator.ts:449:19
       sum += values[i] - values[i - 1];
     }
 
-    return sum / (values.length - 1);
+    return sum / (values.length + 1);
   }
 

[Survived] ArithmeticOperator
src/learning/FeedbackGenerator.ts:449:12
       sum += values[i] - values[i - 1];
     }
 
-    return sum / (values.length - 1);
+    return sum * (values.length - 1);
   }
 

[Survived] BlockStatement
src/learning/FeedbackGenerator.ts:458:55
    * @param values - Array of values
    * @returns Variance
    */
-  private calculateVariance(values: number[]): number {
-    if (values.length === 0) {
-      return 0;
-    }
-
-    const mean = values.reduce((a, b) => a + b, 0) / values.length;
-    const squaredDiffs = values.map((v) => Math.pow(v - mean, 2));
-
-    return squaredDiffs.reduce((a, b) => a + b, 0) / values.length;
-  }
+  private calculateVariance(values: number[]): number {}
 
   /**

[Survived] ConditionalExpression
src/learning/FeedbackGenerator.ts:459:9
    * @returns Variance
    */
   private calculateVariance(values: number[]): number {
-    if (values.length === 0) {
+    if (true) {
       return 0;
     }

[Survived] BlockStatement
src/learning/FeedbackGenerator.ts:459:30
    * @returns Variance
    */
   private calculateVariance(values: number[]): number {
-    if (values.length === 0) {
-      return 0;
-    }
+    if (values.length === 0) {}
 
     const mean = values.reduce((a, b) => a + b, 0) / values.length;

[Survived] ArrowFunction
src/learning/FeedbackGenerator.ts:463:32
       return 0;
     }
 
-    const mean = values.reduce((a, b) => a + b, 0) / values.length;
+    const mean = values.reduce(() => undefined, 0) / values.length;
     const squaredDiffs = values.map((v) => Math.pow(v - mean, 2));
 

[Survived] ArithmeticOperator
src/learning/FeedbackGenerator.ts:463:18
       return 0;
     }
 
-    const mean = values.reduce((a, b) => a + b, 0) / values.length;
+    const mean = values.reduce((a, b) => a + b, 0) * values.length;
     const squaredDiffs = values.map((v) => Math.pow(v - mean, 2));
 

[Survived] ArrowFunction
src/learning/FeedbackGenerator.ts:464:37
     }
 
     const mean = values.reduce((a, b) => a + b, 0) / values.length;
-    const squaredDiffs = values.map((v) => Math.pow(v - mean, 2));
+    const squaredDiffs = values.map(() => undefined);
 
     return squaredDiffs.reduce((a, b) => a + b, 0) / values.length;

[Survived] ArithmeticOperator
src/learning/FeedbackGenerator.ts:464:53
     }
 
     const mean = values.reduce((a, b) => a + b, 0) / values.length;
-    const squaredDiffs = values.map((v) => Math.pow(v - mean, 2));
+    const squaredDiffs = values.map((v) => Math.pow(v + mean, 2));
 
     return squaredDiffs.reduce((a, b) => a + b, 0) / values.length;

[Survived] ArithmeticOperator
src/learning/FeedbackGenerator.ts:466:12
     const mean = values.reduce((a, b) => a + b, 0) / values.length;
     const squaredDiffs = values.map((v) => Math.pow(v - mean, 2));
 
-    return squaredDiffs.reduce((a, b) => a + b, 0) / values.length;
+    return squaredDiffs.reduce((a, b) => a + b, 0) * values.length;
   }
 

[Survived] ArithmeticOperator
src/learning/FeedbackGenerator.ts:466:42
     const mean = values.reduce((a, b) => a + b, 0) / values.length;
     const squaredDiffs = values.map((v) => Math.pow(v - mean, 2));
 
-    return squaredDiffs.reduce((a, b) => a + b, 0) / values.length;
+    return squaredDiffs.reduce((a, b) => a - b, 0) / values.length;
   }
 

[Killed] BlockStatement
src/learning/FeedbackGenerator.ts:475:62
    * @param sessionId - Session ID
    * @returns Array of feedback
    */
-  getFeedbackHistory(sessionId: string): IterationFeedback[] {
-    return this.feedbackHistory.get(sessionId) || [];
-  }
+  getFeedbackHistory(sessionId: string): IterationFeedback[] {}
 
   /**
killedBy: FeedbackGenerator feedback history should track feedback history by session
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/learning/FeedbackGenerator.ts:476:12
    * @returns Array of feedback
    */
   getFeedbackHistory(sessionId: string): IterationFeedback[] {
-    return this.feedbackHistory.get(sessionId) || [];
+    return this.feedbackHistory.get(sessionId) && [];
   }
 
killedBy: FeedbackGenerator feedback history should track feedback history by session
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/learning/FeedbackGenerator.ts:476:12
    * @returns Array of feedback
    */
   getFeedbackHistory(sessionId: string): IterationFeedback[] {
-    return this.feedbackHistory.get(sessionId) || [];
+    return true;
   }
 
killedBy: FeedbackGenerator feedback history should track feedback history by session
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/learning/FeedbackGenerator.ts:491:22
     totalRecommendations: number;
     recommendationsByPriority: Record<string, number>;
   } {
-    const feedback = this.feedbackHistory.get(sessionId) || [];
+    const feedback = this.feedbackHistory.get(sessionId) && [];
 
     if (feedback.length === 0) {
killedBy: FeedbackGenerator statistics should return zero stats for unknown sessions
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/learning/FeedbackGenerator.ts:491:22
     totalRecommendations: number;
     recommendationsByPriority: Record<string, number>;
   } {
-    const feedback = this.feedbackHistory.get(sessionId) || [];
+    const feedback = false;
 
     if (feedback.length === 0) {
killedBy: FeedbackGenerator statistics should provide feedback statistics
statusReason: TypeError: feedback.reduce is not a function

[Killed] ConditionalExpression
src/learning/FeedbackGenerator.ts:493:9
   } {
     const feedback = this.feedbackHistory.get(sessionId) || [];
 
-    if (feedback.length === 0) {
+    if (false) {
       return {
         totalFeedback: 0,
killedBy: FeedbackGenerator statistics should return zero stats for unknown sessions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] BlockStatement
src/learning/FeedbackGenerator.ts:493:32
   } {
     const feedback = this.feedbackHistory.get(sessionId) || [];
 
-    if (feedback.length === 0) {
-      return {
-        totalFeedback: 0,
-        averageConfidence: 0,
-        totalRecommendations: 0,
-        recommendationsByPriority: {},
-      };
-    }
+    if (feedback.length === 0) {}
 
     const totalConfidence = feedback.reduce((sum, f) => sum + f.confidence, 0);
killedBy: FeedbackGenerator statistics should return zero stats for unknown sessions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Survived] ArithmeticOperator
src/learning/FeedbackGenerator.ts:502:57
       };
     }
 
-    const totalConfidence = feedback.reduce((sum, f) => sum + f.confidence, 0);
+    const totalConfidence = feedback.reduce((sum, f) => sum - f.confidence, 0);
     const totalRecommendations = feedback.reduce(
       (sum, f) => sum + f.recommendations.length,

[Survived] ArrowFunction
src/learning/FeedbackGenerator.ts:502:45
       };
     }
 
-    const totalConfidence = feedback.reduce((sum, f) => sum + f.confidence, 0);
+    const totalConfidence = feedback.reduce(() => undefined, 0);
     const totalRecommendations = feedback.reduce(
       (sum, f) => sum + f.recommendations.length,

[Killed] ArrowFunction
src/learning/FeedbackGenerator.ts:504:7
 
     const totalConfidence = feedback.reduce((sum, f) => sum + f.confidence, 0);
     const totalRecommendations = feedback.reduce(
-      (sum, f) => sum + f.recommendations.length,
+      () => undefined,
       0
     );
killedBy: FeedbackGenerator statistics should provide feedback statistics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "number"
Received: "undefined"

[Survived] ArithmeticOperator
src/learning/FeedbackGenerator.ts:504:19
 
     const totalConfidence = feedback.reduce((sum, f) => sum + f.confidence, 0);
     const totalRecommendations = feedback.reduce(
-      (sum, f) => sum + f.recommendations.length,
+      (sum, f) => sum - f.recommendations.length,
       0
     );

[Survived] BlockStatement
src/learning/FeedbackGenerator.ts:509:32
     );
 
     const recommendationsByPriority: Record<string, number> = {};
-    for (const fb of feedback) {
-      for (const rec of fb.recommendations) {
-        recommendationsByPriority[rec.priority] =
-          (recommendationsByPriority[rec.priority] || 0) + 1;
-      }
-    }
+    for (const fb of feedback) {}
 
     return {

[Survived] BlockStatement
src/learning/FeedbackGenerator.ts:510:45
 
     const recommendationsByPriority: Record<string, number> = {};
     for (const fb of feedback) {
-      for (const rec of fb.recommendations) {
-        recommendationsByPriority[rec.priority] =
-          (recommendationsByPriority[rec.priority] || 0) + 1;
-      }
+      for (const rec of fb.recommendations) {}
     }
 

[Survived] ConditionalExpression
src/learning/FeedbackGenerator.ts:512:12
     for (const fb of feedback) {
       for (const rec of fb.recommendations) {
         recommendationsByPriority[rec.priority] =
-          (recommendationsByPriority[rec.priority] || 0) + 1;
+          (false) + 1;
       }
     }

[Survived] ArithmeticOperator
src/learning/FeedbackGenerator.ts:512:11
     for (const fb of feedback) {
       for (const rec of fb.recommendations) {
         recommendationsByPriority[rec.priority] =
-          (recommendationsByPriority[rec.priority] || 0) + 1;
+          (recommendationsByPriority[rec.priority] || 0) - 1;
       }
     }

[Survived] ArithmeticOperator
src/learning/FeedbackGenerator.ts:518:26
 
     return {
       totalFeedback: feedback.length,
-      averageConfidence: totalConfidence / feedback.length,
+      averageConfidence: totalConfidence * feedback.length,
       totalRecommendations,
       recommendationsByPriority,

[Killed] BlockStatement
src/learning/FeedbackGenerator.ts:529:36
    *
    * @param sessionId - Session ID
    */
-  cleanup(sessionId: string): void {
-    this.feedbackHistory.delete(sessionId);
-  }
+  cleanup(sessionId: string): void {}
 }
 
killedBy: FeedbackGenerator cleanup should cleanup session data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1
