--- mcp-integration/src/server.rs
+++ replace != with == in MCPServer::spawn_http_server
@@ -206,17 +206,17 @@
             );
             let builder = ServerBuilder::new(io).request_middleware(
                 move |request: jsonrpc_http_server::hyper::Request<Body>| {
                     if let Some(ref expected) = auth_api_key {
                         let provided = request
                             .headers()
                             .get("x-api-key")
                             .and_then(|value| value.to_str().ok());
-                        if provided != Some(expected.as_str()) {
+                        if provided == /* ~ changed by cargo-mutants ~ */ Some(expected.as_str()) {
                             return RequestMiddlewareAction::from(unauthorized_http_response());
                         }
                     }
 
                     if let Some(ref limiter) = rate_limiter {
                         let mut guard = limiter.lock().unwrap();
                         if !guard.allow() {
                             return RequestMiddlewareAction::from(rate_limited_http_response());
