--- mcp-integration/src/server.rs
+++ replace MCPServer::start_http_with_readiness -> Result<(oneshot::Receiver<()>, HttpServerHandle)> with Ok((Receiver::new(()), Default::default()))
@@ -297,17 +297,17 @@
 
         io
     }
 
     /// Start the MCP HTTP server and return a readiness receiver and structured handle for tests.
     pub async fn start_http_with_readiness(
         &self,
     ) -> Result<(oneshot::Receiver<()>, HttpServerHandle)> {
-        self.spawn_http_server().await
+        Ok((Receiver::new(()), Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn start_ws_with_readiness(
         &self,
     ) -> Result<(oneshot::Receiver<()>, HttpServerHandle)> {
         self.spawn_websocket_server().await
     }
 
