--- mcp-integration/src/server.rs
+++ replace MCPServer::get_status -> MCPServerStatus with Default::default()
@@ -420,18 +420,17 @@
             status = "stopped",
             "MCP server stopped successfully"
         );
         Ok(())
     }
 
     /// Get server status
     pub async fn get_status(&self) -> MCPServerStatus {
-        let status = self.status.read().await;
-        status.clone()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get active connections
     pub async fn get_connections(&self) -> Vec<MCPConnection> {
         let connections = self.connections.read().await;
         connections.clone()
     }
 
