--- mcp-integration/src/server.rs
+++ replace MCPServer::discover_tools -> Result<ToolDiscoveryResult> with Ok(Default::default())
@@ -478,30 +478,17 @@
     // Test helper: register a tool directly in registry
     #[cfg(test)]
     pub async fn execute_tool_registry_register(&self, tool: MCPTool) {
         let _ = self.tool_registry.register_tool(tool).await;
     }
 
     /// Discover and register tools
     pub async fn discover_tools(&self) -> Result<ToolDiscoveryResult> {
-        info!("Starting tool discovery");
-
-        let result = self.tool_discovery.discover_tools().await?;
-
-        // Register discovered tools
-        for tool in &result.discovered_tools {
-            self.tool_registry.register_tool(tool.clone()).await?;
-        }
-
-        info!(
-            "Tool discovery completed: {} tools discovered",
-            result.discovered_tools.len()
-        );
-        Ok(result)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get tool registry statistics
     pub async fn get_registry_stats(&self) -> ToolRegistryStats {
         self.tool_registry.get_statistics().await
     }
 
     /// Test-only: register tool via server
