--- mcp-integration/src/server.rs
+++ replace RateLimiter::allow -> bool with true
@@ -78,28 +78,17 @@
         Self {
             limit_per_minute,
             window_start: Instant::now(),
             count: 0,
         }
     }
 
     fn allow(&mut self) -> bool {
-        let now = Instant::now();
-        if now.duration_since(self.window_start) >= Duration::from_secs(60) {
-            self.window_start = now;
-            self.count = 0;
-        }
-
-        if self.count >= self.limit_per_minute {
-            false
-        } else {
-            self.count += 1;
-            true
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Main MCP server
 #[derive(Debug)]
 pub struct MCPServer {
     config: MCPConfig,
     tool_registry: Arc<ToolRegistry>,
