--- mcp-integration/src/server.rs
+++ delete ! in MCPServer::spawn_http_server
@@ -174,17 +174,17 @@
             status = "running",
             "MCP server started successfully"
         );
         Ok(())
     }
 
     /// Spawn the MCP HTTP server and return a readiness receiver plus handle.
     async fn spawn_http_server(&self) -> Result<(oneshot::Receiver<()>, HttpServerHandle)> {
-        if !self.config.server.enable_http {
+        if  /* ~ changed by cargo-mutants ~ */self.config.server.enable_http {
             bail!("HTTP disabled");
         }
 
         let (ready_tx, ready_rx) = oneshot::channel();
         let (stop_tx, stop_rx) = oneshot::channel();
 
         let addr = format!("{}:{}", self.config.server.host, self.config.server.port);
         let registry = self.tool_registry.clone();
