--- mcp-integration/src/server.rs
+++ delete ! in MCPServer::spawn_http_server
@@ -213,17 +213,17 @@
                             .and_then(|value| value.to_str().ok());
                         if provided != Some(expected.as_str()) {
                             return RequestMiddlewareAction::from(unauthorized_http_response());
                         }
                     }
 
                     if let Some(ref limiter) = rate_limiter {
                         let mut guard = limiter.lock().unwrap();
-                        if !guard.allow() {
+                        if  /* ~ changed by cargo-mutants ~ */guard.allow() {
                             return RequestMiddlewareAction::from(rate_limited_http_response());
                         }
                     }
 
                     RequestMiddlewareAction::from(request)
                 },
             );
 
