--- mcp-integration/src/server.rs
+++ replace MCPServer::start_ws_with_readiness -> Result<(oneshot::Receiver<()>, HttpServerHandle)> with Ok((Receiver::from(()), Default::default()))
@@ -303,17 +303,17 @@
         &self,
     ) -> Result<(oneshot::Receiver<()>, HttpServerHandle)> {
         self.spawn_http_server().await
     }
 
     pub async fn start_ws_with_readiness(
         &self,
     ) -> Result<(oneshot::Receiver<()>, HttpServerHandle)> {
-        self.spawn_websocket_server().await
+        Ok((Receiver::from(()), Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn push_connection_for_testing(&self, connection: MCPConnection) {
         let mut guard = self.connections.write().await;
         guard.push(connection);
     }
 
     async fn spawn_websocket_server(&self) -> Result<(oneshot::Receiver<()>, HttpServerHandle)> {
