--- mcp-integration/src/server.rs
+++ delete ! in MCPServer::spawn_websocket_server
@@ -312,17 +312,17 @@
     }
 
     pub async fn push_connection_for_testing(&self, connection: MCPConnection) {
         let mut guard = self.connections.write().await;
         guard.push(connection);
     }
 
     async fn spawn_websocket_server(&self) -> Result<(oneshot::Receiver<()>, HttpServerHandle)> {
-        if !self.config.server.enable_websocket {
+        if  /* ~ changed by cargo-mutants ~ */self.config.server.enable_websocket {
             bail!("WebSocket disabled");
         }
 
         let (ready_tx, ready_rx) = oneshot::channel();
         let (stop_tx, stop_rx) = oneshot::channel();
 
         let port = self.config.server.port + 1;
         let addr: SocketAddr = format!("{}:{}", self.config.server.host, port).parse()?;
