--- mcp-integration/src/server.rs
+++ replace != with == in MCPServer::spawn_websocket_server
@@ -344,17 +344,17 @@
                 version_payload.clone(),
             );
 
             let middleware = move |req: &ws::Request| {
                 if let Some(ref expected) = auth_api_key {
                     let provided = req
                         .header("x-api-key")
                         .and_then(|value| std::str::from_utf8(value).ok());
-                    if provided != Some(expected.as_str()) {
+                    if provided == /* ~ changed by cargo-mutants ~ */ Some(expected.as_str()) {
                         return Some(unauthorized_ws_response());
                     }
                 }
 
                 if let Some(ref limiter) = rate_limiter {
                     let mut guard = limiter.lock().unwrap();
                     if !guard.allow() {
                         return Some(rate_limited_ws_response());
