--- mcp-integration/src/server.rs
+++ delete ! in MCPServer::start_http_server
@@ -519,17 +519,17 @@
     #[cfg(feature = "test-utils")]
     pub async fn register_tool_for_testing(&self, tool: MCPTool) -> Result<()> {
         info!("Registering tool for testing: {}", tool.name);
         self.tool_registry.register_tool(tool).await
     }
 
     /// Start HTTP server
     async fn start_http_server(&self) -> Result<()> {
-        if !self.config.server.enable_http {
+        if  /* ~ changed by cargo-mutants ~ */self.config.server.enable_http {
             return Ok(());
         }
 
         info!("Starting HTTP server on port {}", self.config.server.port);
 
         let (ready, handle) = self.spawn_http_server().await?;
 
         match timeout(Duration::from_secs(3), ready).await {
