--- mcp-integration/src/server.rs
+++ replace MCPServer::start_websocket_server -> Result<()> with Ok(())
@@ -546,36 +546,11 @@
                 handle.shutdown().await?;
                 bail!("HTTP server failed to become ready in time");
             }
         }
     }
 
     /// Start WebSocket server
     async fn start_websocket_server(&self) -> Result<()> {
-        if !self.config.server.enable_websocket {
-            return Ok(());
-        }
-
-        info!(
-            "Starting WebSocket server on port {}",
-            self.config.server.port + 1
-        );
-
-        let (ready, handle) = self.spawn_websocket_server().await?;
-
-        match timeout(Duration::from_secs(3), ready).await {
-            Ok(Ok(())) => {
-                let mut slot = self.ws_handle.write().await;
-                *slot = Some(handle);
-                Ok(())
-            }
-            Ok(Err(_)) => {
-                handle.shutdown().await?;
-                bail!("WebSocket server task ended before readiness");
-            }
-            Err(_) => {
-                handle.shutdown().await?;
-                bail!("WebSocket server failed to become ready in time");
-            }
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
