--- mcp-integration/src/server.rs
+++ replace >= with < in RateLimiter::allow
@@ -84,17 +84,17 @@
 
     fn allow(&mut self) -> bool {
         let now = Instant::now();
         if now.duration_since(self.window_start) >= Duration::from_secs(60) {
             self.window_start = now;
             self.count = 0;
         }
 
-        if self.count >= self.limit_per_minute {
+        if self.count < /* ~ changed by cargo-mutants ~ */ self.limit_per_minute {
             false
         } else {
             self.count += 1;
             true
         }
     }
 }
 
